{
  "html": [
    "<div id='body0'>",
    "<p id='p14' data-head-level=\"2\" class=\"head\">不真空論第二</p>",
    "<p id='p15'>夫至虛無生者，蓋是般若玄鑑之妙趣，有物之宗極者也。自非聖明特達，何能契神於有無之間哉？是以至人通神心於無窮，窮所不能滯；極耳目於視聽，聲色所不能制者，豈不以其即萬物之自虛，故物不能累其神明者也。是以聖人乘真心而理順，則無滯而不通；審一氣以觀化，故所遇而順適。無滯而不通，故能混雜致湻；所遇而順適，故則觸物而一。如此，則萬象雖殊而不能自異。不能自異，故知象非真象。象非真象故，則雖象而非象。</p>",
    "<p id='p15a'>然則物我同根、是非一氣，潛微幽隱，殆非群情之所盡，故頃爾談論，至於虛宗，每有不同。夫以不同而適同，有何物而可同哉？故眾論競作而性莫同焉。何則？心無者，無心於萬物，萬物未嘗無。此得在於神靜，失在於物虛。即色者，明色不自色，故雖色而非色也。夫言色者，但當色即色，豈待色色而後為色哉？此直語色不自色，未領色之非色也。本無者，情尚於無，多觸言以賓無。故非有，有即無；非無，無亦無。尋夫立文之本旨者，直以非有非真有，非無非真無耳。何必非有無此有，非無無彼無？此直好無之談，豈謂順通事實，即物之情哉！夫以物物於物，則所物而可物；以物物非物，故雖物而非物。是以物不即名而就實，名不即物而履真。然則真諦獨靜於名教之外，豈曰文言之能辨哉？然不能杜默，聊復厝言以擬之。試論之曰：</p>",
    "<p id='p16'>《摩訶衍論》云：「諸法亦非有相，亦非無相。」《中論》云：「諸法不有不無者，第一真諦也。」尋夫不有不無者，豈謂滌除萬物、杜塞視聽，寂寥虛豁，然後為真諦者乎？誠以即物順通，故物莫之逆；即偽即真，故性莫之易。性莫之易，故雖無而有；物莫之逆，故雖有而無。雖有而無，所謂非有；雖無而有，所謂非無。如此，則非無物也，物非真物。物非真物，故於何而可物？故經云：「色之性空，非色敗空。」以明夫聖人之於物也，即萬物之自虛，豈待宰割以求通哉！</p>",
    "<p id='p16a'>是以寢疾有不真之談，超日有即虛之稱；然則三藏殊文，統之者一也。故《放光》云：「第一真諦，無成無得；世俗諦故，便有成有得。」夫有得即是無得之偽號，無得即是有得之真名。真名故，雖真而非有；偽號故，雖偽而非無。是以言真未嘗有，言偽未嘗無。二言未始一，二理未始殊。故經云：「真諦、俗諦謂有異耶？答曰：無異也。」此經直辯真諦以明非有，俗諦以明非無；豈以諦二而二於物哉？</p>",
    "<p id='p16b'>然則萬物果有其所以不有，有其所以不無。有其所以不有，故雖有而非有；有其所以不無，故雖無而非無。雖無而非無，無者不絕虛；雖有而非有，有者非真有。若有不即真，無不夷跡，然則有無稱異，其致一也。故童子歎曰：「說法不有亦不無，以因緣故諸法生。」《瓔珞經》云：「轉法輪者，亦非有轉，亦非無轉，是謂轉無所轉。」此乃眾經之微言也。何者？謂物無耶，則邪見非惑；謂物有耶，則常見為得。以物非無，故邪見為惑；以物非有，故常見不得。</p>",
    "<p id='p16c'>然則非有非無者，信真諦之談也。故《道行》云：「心亦不有亦不無。」《中觀》云：「物從因緣故不有，緣起故不無。」尋理，即其然矣。所以然者，夫有若真有，有自常有，豈待緣而後有哉？譬彼真無，無自常無，豈待緣而後無也！若有不自有，待緣而後有者，故知有非真有。有非真有，雖有，不可謂之有矣。不無者，夫無則湛然不動，可謂之無。萬物若無，則不應起；起則非無。以明緣起故不無也。故《摩訶衍論》云：「一切諸法，一切因緣故應有；一切諸法，一切因緣故不應有。一切無法，一切因緣故應有；一切有法，一切因緣故不應有。」尋此有無之言，豈直反論而已哉！若應有，即是有，不應言無；若應無，即是無，不應言有。言有，是為假有，以明非無。借無，以辨非有。此事一稱二，其文有似不同。苟領其所同，則無異而不同。</p>",
    "<p id='p16d'>然則萬法，果有其所以不有不可得而有；有其所以不無不可得而無。何則？欲言其有，有非真生；欲言其無；事象既形。象形，不即無；非真，非實有。然則不真空義，顯於茲矣！故《放光》云：「諸法假號不真，譬如幻化人。非無幻化人，幻化人非真人也。」夫以名求物，物無當名之實；以物求名，名無得物之功。物無當名之實，非物也；名無得物之功，非名也。是以名不當實，實不當名。名實無當，萬物安在？故《中觀》云：「物無彼此。」而人以此為此，以彼為彼。彼亦以此為彼，以彼為此。此、彼莫定乎一名，而惑者懷必然之志。</p>",
    "<p id='p16e'>然則彼此初非有，惑者初非無，既悟彼此之非有，有何物而可有哉？故知萬物非真，假號久矣！是以《成具》立強名之文，園林託指馬之況。如此，則深遠之言，於何而不在！是以聖人乘千化而不變，履萬惑而常通者，以其即萬物之自虛，不假虛而虛物也。故經云：「甚奇，世尊！不動真際為諸法立處。」非離真而立處，立處即真也。然則道遠乎哉？觸事而真！聖遠乎哉？體之即神！</p>",
    "<p id='p17' class='juan-end'>不真空論<span class='doube-line-note'>終</span></p>",
    "</div>"
  ],
  "html_org": [
    [
      "<div id='body0'>",
      "<p id='p14' data-head-level=\"2\" class=\"head\">不真空論第二</p>",
      "<p id='p15'>夫至虛無生者，蓋是般若玄鑑之妙趣，有物之宗極者也。自非聖明特達，何能契神於有無之間哉？是以至人通神心於無窮，窮所不能滯；極耳目於視聽，聲色所不能制者，豈不以其即萬物之自虛，故物不能累其神明者也。是以聖人乘真心而理順，則無滯而不通；審一氣以觀化，故所遇而順適。無滯而不通，故能混雜致湻；所遇而順適，故則觸物而一。如此，則萬象雖殊而不能自異。不能自異，故知象非真象。象非真象故，則雖象而非象。然則物我同根、是非一氣，潛微幽隱，殆非群情之所盡，故頃爾談論，至於虛宗，每有不同。夫以不同而適同，有何物而可同哉？故眾論競作而性莫同焉。何則？心無者，無心於萬物，萬物未嘗無。此得在於神靜，失在於物虛。即色者，明色不自色，故雖色而非色也。夫言色者，但當色即色，豈待色色而後為色哉？此直語色不自色，未領色之非色也。本無者，情尚於無，多觸言以賓無。故非有，有即無；非無，無亦無。尋夫立文之本旨者，直以非有非真有，非無非真無耳。何必非有無此有，非無無彼無？此直好無之談，豈謂順通事實，即物之情哉！夫以物物於物，則所物而可物；以物物非物，故雖物而非物。是以物不即名而就實，名不即物而履真。然則真諦獨靜於名教之外，豈曰文言之能辨哉？然不能杜默，聊復厝言以擬之。試論之曰：</p>",
      "<p id='p16'>《摩訶衍論》云：「諸法亦非有相，亦非無相。」《中論》云：「諸法不有不無者，第一真諦也。」尋夫不有不無者，豈謂滌除萬物、杜塞視聽，寂寥虛豁，然後為真諦者乎？誠以即物順通，故物莫之逆；即偽即真，故性莫之易。性莫之易，故雖無而有；物莫之逆，故雖有而無。雖有而無，所謂非有；雖無而有，所謂非無。如此，則非無物也，物非真物。物非真物，故於何而可物？故經云：「色之性空，非色敗空。」以明夫聖人之於物也，即萬物之自虛，豈待宰割以求通哉！是以寢疾有不真之談，超日有即虛之稱；然則三藏殊文，統之者一也。故《放光》云：「第一真諦，無成無得；世俗諦故，便有成有得。」夫有得即是無得之偽號，無得即是有得之真名。真名故，雖真而非有；偽號故，雖偽而非無。是以言真未嘗有，言偽未嘗無。二言未始一，二理未始殊。故經云：「真諦、俗諦謂有異耶？答曰：無異也。」此經直辯真諦以明非有，俗諦以明非無；豈以諦二而二於物哉？然則萬物果有其所以不有，有其所以不無。有其所以不有，故雖有而非有；有其所以不無，故雖無而非無。雖無而非無，無者不絕虛；雖有而非有，有者非真有。若有不即真，無不夷跡，然則有無稱異，其致一也。故童子歎曰：「說法不有亦不無，以因緣故諸法生。」《瓔珞經》云：「轉法輪者，亦非有轉，亦非無轉，是謂轉無所轉。」此乃眾經之微言也。何者？謂物無耶，則邪見非惑；謂物有耶，則常見為得。以物非無，故邪見為惑；以物非有，故常見不得。然則非有非無者，信真諦之談也。故《道行》云：「心亦不有亦不無。」《中觀》云：「物從因緣故不有，緣起故不無。」尋理，即其然矣。所以然者，夫有若真有，有自常有，豈待緣而後有哉？譬彼真無，無自常無，豈待緣而後無也！若有不自有，待緣而後有者，故知有非真有。有非真有，雖有，不可謂之有矣。不無者，夫無則湛然不動，可謂之無。萬物若無，則不應起；起則非無。以明緣起故不無也。故《摩訶衍論》云：「一切諸法，一切因緣故應有；一切諸法，一切因緣故不應有。一切無法，一切因緣故應有；一切有法，一切因緣故不應有。」尋此有無之言，豈直反論而已哉！若應有，即是有，不應言無；若應無，即是無，不應言有。言有，是為假有，以明非無。借無，以辨非有。此事一稱二，其文有似不同。苟領其所同，則無異而不同。然則萬法，果有其所以不有不可得而有；有其所以不無不可得而無。何則？欲言其有，有非真生；欲言其無；事象既形。象形，不即無；非真，非實有。然則不真空義，顯於茲矣！故《放光》云：「諸法假號不真，譬如幻化人。非無幻化人，幻化人非真人也。」夫以名求物，物無當名之實；以物求名，名無得物之功。物無當名之實，非物也；名無得物之功，非名也。是以名不當實，實不當名。名實無當，萬物安在？故《中觀》云：「物無彼此。」而人以此為此，以彼為彼。彼亦以此為彼，以彼為此。此、彼莫定乎一名，而惑者懷必然之志。然則彼此初非有，惑者初非無，既悟彼此之非有，有何物而可有哉？故知萬物非真，假號久矣！是以《成具》立強名之文，園林託指馬之況。如此，則深遠之言，於何而不在！是以聖人乘千化而不變，履萬惑而常通者，以其即萬物之自虛，不假虛而虛物也。故經云：「甚奇，世尊！不動真際為諸法立處。」非離真而立處，立處即真也。然則道遠乎哉？觸事而真！聖遠乎哉？體之即神！</p>",
      "<p id='p17' class='juan-end'>不真空論<span class='doube-line-note'>終</span></p>",
      "</div>"
    ]
  ],
  "info": {
    "caption": "不真空論",
    "cb_ids": "T1858_001",
    "cols": 1,
    "id": "T1858B",
    "note_count": 9,
    "note_id": 700,
    "notes": [
      "0|憨|X0873_002|X0873 肇論略注，明·德清",
      "0|康|T1859_001|T1859 肇論疏，唐·元康",
      "0|遵|X0870_002|X0870 注肇論疏，宋·遵式",
      "0|文|T1860_001|T1860 肇論新疏，元·文才"
    ],
    "step": 2
  },
  "log": [
    "Split paragraph #p15 at 2 as result #p15a: 夫至虛無生者，蓋是般若玄鑑之妙趣，有物之宗極者也。自非聖明特達，何能契神於有無之間哉？是以至人通神心於無窮，窮所不能滯；極耳目於視聽，聲色所不能制者，豈不以其即萬物之自虛，故物不能累其神明者也。是以聖人乘真心而理順，則無滯而不通；審一氣以觀化，故所遇而順適。無滯而不通，故能混雜致湻；所遇而順適，故則觸物而一。如此，則萬象雖殊而不能自異。不能自異，故知象非真象。象非真象故，則雖象而非象。@然則物我同根、是非一氣，潛微幽隱，殆非群情之所盡，故頃爾談論，至於虛宗，每有不同。夫以不同而適同，有何物而可同哉？故眾論競作而性莫同焉。何則？心無者，無心於萬物，萬物未嘗無。此得在於神靜，失在於物虛。即色者，明色不自色，故雖色而非色也。夫言色者，但當色即色，豈待色色而後為色哉？此直語色不自色，未領色之非色也。本無者，情尚於無，多觸言以賓無。故非有，有即無；非無，無亦無。尋夫立文之本旨者，直以非有非真有，非無非真無耳。何必非有無此有，非無無彼無？此直好無之談，豈謂順通事實，即物之情哉！夫以物物於物，則所物而可物；以物物非物，故雖物而非物。是以物不即名而就實，名不即物而履真。然則真諦獨靜於名教之外，豈曰文言之能辨哉？然不能杜默，聊復厝言以擬之。試論之曰：",
    "Split paragraph #p16 at 4 as result #p16a,p16b,p16c,p16d,p16e: 《摩訶衍論》云：「諸法亦非有相，亦非無相。」《中論》云：「諸法不有不無者，第一真諦也。」尋夫不有不無者，豈謂滌除萬物、杜塞視聽，寂寥虛豁，然後為真諦者乎？誠以即物順通，故物莫之逆；即偽即真，故性莫之易。性莫之易，故雖無而有；物莫之逆，故雖有而無。雖有而無，所謂非有；雖無而有，所謂非無。如此，則非無物也，物非真物。物非真物，故於何而可物？故經云：「色之性空，非色敗空。」以明夫聖人之於物也，即萬物之自虛，豈待宰割以求通哉！@是以寢疾有不真之談，超日有即虛之稱；然則三藏殊文，統之者一也。故《放光》云：「第一真諦，無成無得；世俗諦故，便有成有得。」夫有得即是無得之偽號，無得即是有得之真名。真名故，雖真而非有；偽號故，雖偽而非無。是以言真未嘗有，言偽未嘗無。二言未始一，二理未始殊。故經云：「真諦、俗諦謂有異耶？答曰：無異也。」此經直辯真諦以明非有，俗諦以明非無；豈以諦二而二於物哉？@然則萬物果有其所以不有，有其所以不無。有其所以不有，故雖有而非有；有其所以不無，故雖無而非無。雖無而非無，無者不絕虛；雖有而非有，有者非真有。若有不即真，無不夷跡，然則有無稱異，其致一也。故童子歎曰：「說法不有亦不無，以因緣故諸法生。」《瓔珞經》云：「轉法輪者，亦非有轉，亦非無轉，是謂轉無所轉。」此乃眾經之微言也。何者？謂物無耶，則邪見非惑；謂物有耶，則常見為得。以物非無，故邪見為惑；以物非有，故常見不得。@然則非有非無者，信真諦之談也。故《道行》云：「心亦不有亦不無。」《中觀》云：「物從因緣故不有，緣起故不無。」尋理，即其然矣。所以然者，夫有若真有，有自常有，豈待緣而後有哉？譬彼真無，無自常無，豈待緣而後無也！若有不自有，待緣而後有者，故知有非真有。有非真有，雖有，不可謂之有矣。不無者，夫無則湛然不動，可謂之無。萬物若無，則不應起；起則非無。以明緣起故不無也。故《摩訶衍論》云：「一切諸法，一切因緣故應有；一切諸法，一切因緣故不應有。一切無法，一切因緣故應有；一切有法，一切因緣故不應有。」尋此有無之言，豈直反論而已哉！若應有，即是有，不應言無；若應無，即是無，不應言有。言有，是為假有，以明非無。借無，以辨非有。此事一稱二，其文有似不同。苟領其所同，則無異而不同。@然則萬法，果有其所以不有不可得而有；有其所以不無不可得而無。何則？欲言其有，有非真生；欲言其無；事象既形。象形，不即無；非真，非實有。然則不真空義，顯於茲矣！故《放光》云：「諸法假號不真，譬如幻化人。非無幻化人，幻化人非真人也。」夫以名求物，物無當名之實；以物求名，名無得物之功。物無當名之實，非物也；名無得物之功，非名也。是以名不當實，實不當名。名實無當，萬物安在？故《中觀》云：「物無彼此。」而人以此為此，以彼為彼。彼亦以此為彼，以彼為此。此、彼莫定乎一名，而惑者懷必然之志。@然則彼此初非有，惑者初非無，既悟彼此之非有，有何物而可有哉？故知萬物非真，假號久矣！是以《成具》立強名之文，園林託指馬之況。如此，則深遠之言，於何而不在！是以聖人乘千化而不變，履萬惑而常通者，以其即萬物之自虛，不假虛而虛物也。故經云：「甚奇，世尊！不動真際為諸法立處。」非離真而立處，立處即真也。然則道遠乎哉？觸事而真！聖遠乎哉？體之即神！",
    "Extract note #79 of 康 with #111,112,113,114,115,116,117,118,119,120: 極耳目於視聽聲色所不",
    "Extract note #83 of 康 with #121,122: 然則真諦獨靜於名教之",
    "Extract note #82 of 康 with #123,124,125,126,127,128: 故非有有即無非無無即",
    "Extract note #81 of 康 with #129,130,131: 夫言色者當色色即色豈",
    "Extract note #80 of 康 with #132,133,134,135,136: 夫以不同而適同有何物",
    "Extract note #86 of 康 with #137,138,139,140,141,142: 以明夫聖人之於物也即",
    "Extract note #140 of 康 with #143: 然則三藏殊文統之者一",
    "Extract note #85 of 康 with #144,145,146,147,148,149,150: 寂寥者。老子云。寂兮",
    "Extract note #98 of 康 with #151,152,153,154,155,156,157,158,159,160,161: 今云物無彼此者。通是"
  ],
  "notes": {
    "康": {
      "col": 0,
      "desc": "T1859 肇論疏，唐·元康",
      "name": "T1859_001",
      "notes": [
        [
          77,
          "夫至虛無生者下",
          "此論文有二章。先序。後正。今初序也。序文有三。第一標正宗。第二破異見。第三序論意。今初。文中又三。第一標真境。第二明真智。第三合明境智。今初。言至虛無生者。即無生畢竟空真境也。蓋是般若玄鑒之妙趣有物之宗極者。蓋是不定之辭。將以為是。未敢為定故。所以云蓋。趣是趣向義。宗是宗本。謂此無生畢竟空。是般若所鑒之境。萬物之宗本也。0170c23"
        ],
        [
          78,
          "自非聖明特達下",
          "第二明真智也。聖明即般若也。非是般若奇特明達。何能以神情。契合中道非有非無之理哉。即此非有非無。是中道畢竟空。故云有無之間耳。0171a03"
        ],
        [
          79,
          "是以至人通神心於無窮下",
          "第三合明境智相契會也。以神心觀無窮之理。故云通神心於無窮。不為有物之所滯礙。故云窮所不能滯也。0171a07"
        ],
        [
          120,
          "極耳目於視聽聲色所不能制者。",
          "縱耳聽聲。不為聲所惑。縱目覩色。不為色所迷也。0171a07"
        ],
        [
          119,
          "豈不以其即萬物之自虛下。",
          "良以萬物是虛。故縱視聽。不為聲色所惑耳。累者勞累也。0171a07"
        ],
        [
          118,
          "是以乘真心以理順則無滯而不通者。",
          "順謂諸法是空。不違正道也。乘御般若之心。慗理順空之道。則無有滯礙而不通暢也。有本作履字。亦可然也。謂履踐順空之道耳。0171a07"
        ],
        [
          117,
          "審一氣以觀化故所遇而順適者。",
          "化謂萬化也。適謂往適也。莊子內篇大宗師章云。彼方且興造物者。為人而遊乎。天地之一氣。郭注云。皆冥之。故無二也。莊子外篇北遊章云。人之生也。氣之聚也。是其美者為神奇。其不美者為臭腐臭腐復化為神奇神。奇復化為臭腐。故曰通天下一氣也。離騷第六卷遠遊章云。順凱風以從遊。至南巢而一息。見王子而宿之。審一氣之和德。王逸注云。究問元釋精之祕要也。今借此等諸言。以目一道也。0171a07"
        ],
        [
          116,
          "無滯而不通故能混雜致淳者。",
          "莊子云。眾人役役。聖人愚芒。參萬歲而一成紀。今借此語。以喻不二法門。若能無滯不通。即是不二法門也。0171a07"
        ],
        [
          115,
          "所遇順適則觸物而一者。",
          "所逢遇皆以般若觀之。知其皆空。無有滯礙。是則萬法一相無相也。0171a07"
        ],
        [
          114,
          "如此則萬像雖殊而不能自異者。",
          "既同一相。所以不異也。0171a07"
        ],
        [
          113,
          "不能自異故知像非真像者。",
          "一相無相。所以像即非像。下覆上意也。0171a07"
        ],
        [
          112,
          "然則物我同根是非一氣者。",
          "物是外物。我者己身。同一無相。故曰同根。同一正道。故曰一氣也。0171a07"
        ],
        [
          111,
          "潛微幽隱殆非群情之所盡者。",
          "潛是潛藏。微是微細。幽是幽深。隱是隱映。以難見故。非諸人所能窮盡也。殆者。爾雅云危也。廣雅云敗也。鄭玄注禮云幾也。毛長注傳云始也。今取其音幾。幾者近也。0171a07"
        ],
        [
          80,
          "故頃爾談論下",
          "第二破異見也。頃者俄頃。謂少許時也。此頃諸家作論。多有不同。良以虛宗玄妙故。談者不得其實。致成異見耳。0171b14"
        ],
        [
          136,
          "夫以不同而適同有何物而可同者。",
          "以用也。適往也。以不同之情。往取同理。何由可得同耶。有本作釋字。皆謂解也。0171b14"
        ],
        [
          135,
          "故眾論競作而性莫同焉者。",
          "總明諸家作論理性不同也。0171b14"
        ],
        [
          134,
          "何則心無者下。",
          "正出諸家不同之論也。然不同之論。非止一家。今略破三家。餘可知矣。0171b14"
        ],
        [
          133,
          "心無者。",
          "破晉朝支慜度心無義也。世說注云。慜度欲過江。與一傖道人為侶。謀曰。若用舊義往江東。恐不辨得食。便立心無義。既此道人不成度江。慜果講此義。後有傖人來。先道人。語云。為我致意。慜度心無義那可立。此法權救飢耳。無為遂負如來也。從是以後此義大行。高僧傳云。沙門道恒頗有才力。常執心無義。大行荊土。竺法汰曰。此是邪說。應須破之。乃大集名僧。令弟子曇一難之。據經引理。折駁紛紜。恒杖其口辨。不肯受屈。日色既暮。明旦更集。慧遠就席。攻數番。問責鋒起。恒自覺義途差異。神色漸。動麈尾扣案。未即有答。遠曰。不疾而速。杼軸何為。坐者皆笑。心無之義。於是而息。今肇法師亦破此義。先敘其宗。然後破也。無心萬物。萬物未甞無。謂經中言空者。但於物上不起執心。故言其空。然物是有不曾無也。0171b14"
        ],
        [
          132,
          "此得在於神靜失在於物虛者。",
          "正破也。能於法上無執故名為得。不知物性是空故名為失也。0171b14"
        ],
        [
          81,
          "即色者明色不自色下",
          "第二破晉朝支道林即色遊玄義也。今尋林法師即色論。無有此語。然林法師集。別有妙觀章。云夫色之性也。不自有色。色不自色。雖色而空。今之所引。正此引文也。0171c13"
        ],
        [
          131,
          "夫言色者當色色即色豈待色色而後為色哉者。",
          "此猶是林法師語意也。若當色自是色。可名有色。\n若待緣色成果色者。是則色非定色也。亦可云若待細色成麁色。是則色非定色也。0171c13"
        ],
        [
          129,
          "此直悟色不自色未領色之非色者。",
          "正破也。有本作悟。有本作語。皆得也。此林法師但知言色非自色因緣而成。而不知色本是空。猶存假有也。0171c13"
        ],
        [
          82,
          "本無者下",
          "第三破晉朝竺法汰本無義也。情尚於無多觸言而賓無者。情多貴尚此無也。觸言皆向無也。賓者客也。客皆向主。今本無宗。言皆向無也。爾雅云。賓服也。言服無故云賓無耳也。0171c25"
        ],
        [
          128,
          "故非有有即無非無無即無者。",
          "謂經中言非有者。無有此有也。言非無者。無有彼無也。0171c25"
        ],
        [
          127,
          "尋夫立文之本旨者。",
          "有本作文。有本作無。今用文也。謂尋經文本意也。0171c25"
        ],
        [
          126,
          "直以非有非真有非無非真無者。",
          "真實也。非實定是有。故言非有。非實定是無。故言非無耳。0171c25"
        ],
        [
          125,
          "何必非有無此有非無無彼無者。",
          "不言非有無却此有。非無無却彼無也。0171c25"
        ],
        [
          124,
          "此直好無之談者。",
          "直是好尚於無。故觸言向無耳。0171c25"
        ],
        [
          123,
          "豈所謂順通事實即物之情哉者。",
          "不順萬事之實性。不得即物之實性也。0171c25"
        ],
        [
          83,
          "夫以物物於物下",
          "第三明作論意也。以物名名有物。故云以物物於物。以物名名非物。故言以物物非物。以物名名有物。則有物體之可名。故云則所物而可物。以物名名非物。則無物體之可名。故云雖物而非物也。是以物不即名而就實者。物體自別。不即以名字為物實也。名不即物而履真者。名字又別。不即以物體為名之真也。0172a11"
        ],
        [
          122,
          "然則真諦獨靜於名教之外下。",
          "俗諦之物。尚名不即實。實不即名。真諦之理。名教之所不及。故云獨靜於名教之外也。既非名教所及。0172a11"
        ],
        [
          121,
          "文言豈能辨得真諦乎。不能杜默聊復厝言以擬之者。",
          "杜塞也厝者。小雅云。措置也。今作厝字。義亦同也。理雖不可言。試以言理也。0172a11"
        ],
        [
          84,
          "摩訶衍論云諸法亦不有相亦不無相下",
          "第二正是論文也。文中有六。第一引教以明空。第二據理以明空。第三重引教以明空。第四重據理以明空。第五就名實以明空。第六結會以明空。引教據理。\n所以為異者。引教則先引經。然後釋成。據理則先明所以。然後引經論帖釋也。\n今初引教文有三段。第一正引兩論以明空。第二解釋論意。第三引經證成。今初。\n言摩訶衍論者。大智度論也。通指一部論意。亦可但指論中一文。文云。譬如鏡中像。非鏡亦非面。非有亦非無也。\n中論者。通指一部論意。亦可但指論中一文。文云。若使無有有。云何當有無。有無既已無。知有無者誰也。\n而言第一真諦者。自從者字已上。是二論之文。今言第一。肇法師之語。明此兩論所說。是第一義諦。亦名真諦。故合說也。0172a25"
        ],
        [
          85,
          "尋夫不有不無者下",
          "第二解釋二論之意也。豈謂滌除萬物杜塞視聽下。滌除是洗蕩也。老子云。滌除玄覽能無疵乎。今借此語用也。杜猶是塞也。0172b12"
        ],
        [
          150,
          "寂寥者。",
          "老子云。寂兮寥兮獨立而不改。釋者云。無聲曰寂。無色曰寥。此意言。非謂斷空始為真諦也。0172b12"
        ],
        [
          149,
          "誠以即物順通故物莫之逆者。",
          "誠信也。即萬物之有為空。故云順通。順通故無阻逆也。0172b12"
        ],
        [
          148,
          "即偽即真故性莫之易者。",
          "即俗諦之偽。真諦之真。非謂改變俗諦。別明真諦也。0172b12"
        ],
        [
          147,
          "性莫之易故雖無而有者。",
          "即有是空。雖空猶是有也。0172b12"
        ],
        [
          146,
          "物莫之逆故雖有而無者。",
          "即萬物順通性空。當知雖有而是空也。0172b12"
        ],
        [
          145,
          "雖有而無所謂非有下。",
          "雖有而是無。當知非定有。下句反此也。0172b12"
        ],
        [
          144,
          "如此則非無物也物非真也者。",
          "非無物也。明非無也。物非真也明非有也。亦可直云非是無物。但物非真有之物耳。物非真物於何而可物者。既云非真。何處有此物乎。0172b12"
        ],
        [
          86,
          "故經云下",
          "第三引五經證成也。今引維摩經也。經云。色即是空。非色滅空。謂色性即是空。非謂滅色然後始空也。而云敗者。古經也。壞敗是毀敗。亦是滅義。0172c01"
        ],
        [
          142,
          "以明夫聖人之於物也即萬物之自虛者。",
          "以明兩字。或可屬上。或可屬下。唯莊子應屬上。今此文意則將屬下也。後亦然。明聖人見萬物之性自空耳。0172c01"
        ],
        [
          141,
          "豈待宰割以求通哉者。",
          "小雅云。宰治也。割謂裁也。即色是空。不須宰割破壞。然後方乃通於空也。0172c01"
        ],
        [
          140,
          "是以寢疾有非真之談超日有即空之稱者。",
          "前引一經。此引兩經。後更有兩經也。寢疾謂維摩經也。彼經云。菩薩病者非真非有。眾生病亦非真非有也。超日者。超日明經也。彼經云。不有受不保命四大虛也。0172c01"
        ],
        [
          143,
          "然則三藏殊文統之者一者也。",
          "三藏謂修多羅毘曇毘尼。雖言迹異端。以理統之。莫終不歸畢竟空也。故放光云第一真諦無成無得下。據第一義諦。無有成佛。無有得涅槃。世諦則有耳。0172c01"
        ],
        [
          139,
          "夫有得則是無得之偽號下。",
          "諸本皆云。成得則是無得之偽號。今依古本。有得為正也。准下無得句。義亦應然。實是無得。而云有得是假偽之名。無得反此也。0172c01"
        ],
        [
          138,
          "真名故雖真而非有者。",
          "諸本皆云。雖得而非得。今依古本。雖真而非有也。准下偽號句。義亦應然也。雖曰真名仍非是有。偽號反此也。是以言真未甞有者。覆前兩句也。二言未始一下。真偽兩言不一。而有無二理不殊也。0172c01"
        ],
        [
          137,
          "故經云真諦俗諦謂有異耶下。",
          "此是大品經第二十二卷道樹品中問答也。此經直辨下。釋前經中問答意也。真諦明非有下。據真則非有。據俗則非無也。豈以二下。不以諦名有二。則謂法體有二也。0172c01"
        ],
        [
          87,
          "然則萬物果有其所以不有下",
          "第二據理以明空也。文中有二。先正據理以明空。後引二經證成也。\n今言然則者。若然則皆空也。果者果敢決定義。所以者是義也。萬物有不有義。有不無義。故云爾也。\n有其所以不有故雖有而非有者下。諸本多云。有其所以不無。今勘古本。正應言不有。文義亦應然也。人謂萬物是有。今明萬物有不有義。故雖有非是有。下句反此也。\n雖無而非無無者不絕虛者。雖是無而非定無。則此無。不同大虛永絕。下句反此也。\n若有不即真無不夷迹者。有非定有。故云不即真。無不泯滅。故云不夷迹。夷平也。老子云。視之不見名曰夷也。迹者事相之迹。即事是無。不待夷平然後始無耳。\n然則有無稱異其致一也者。名殊而理一也。0173a04"
        ],
        [
          88,
          "故童子歎曰下",
          "第二引二經證成也。童子者。維摩經中長者子寶積也。言佛說法非定是有。亦非是無。皆從因緣而有也。\n瓔珞經云者。此是大纓絡經也。彼經第十三卷初。文殊師利問云。一切諸佛轉法輪。為有轉耶。為無轉耶。佛言諸佛正法。亦不有轉。亦不無轉。文殊復問。云何亦不有轉亦不無轉。佛言諸法空故。亦無有轉。亦無無轉也。此乃眾經之微言者。諸經中微妙之言也。0173a19"
        ],
        [
          89,
          "何者謂物無耶則邪見非惑下",
          "第二解釋經意也。邪見見無。若謂物定是無。則邪見應非是惑乎。\n謂物有則耶常見為得者。常見見有。若謂物定是有。則常見應非是惑乎。以物非無故下。覆上句可見也。\n然則非有非無信真諦之談者。非有非無是真諦教也。0173a28"
        ],
        [
          90,
          "故道行云心亦不有亦不無下",
          "第三章重引教以明空也。初安故字。似如引證。看後語勢。乃是開章也。文中有二。前引一經一論以明空。後單引一論以明空。今初文二。前正引一經一論以明空。後釋經論意。今初也。\n中論云者。此通引中論意也。亦可是四諦品偈。偈云。眾因緣生法。我說即是空。亦為是假名。亦是中道義也。尋理即其然矣。此經論所說理如然也。0173b05"
        ],
        [
          91,
          "所以然者下",
          "第二解釋經論意也。文中二。先釋非有。後釋非無。今初也。\n豈待緣而後有哉者。有若定有。不須待緣生方有也。譬彼真無下。此舉大虛之無。以喻有也。\n若有不能自有待緣而後有下。有要待緣。明知非有也。有非真有下。結明有空也。\n不無者下。釋非無也。夫無則湛然不動下。若湛然不動。始可名為無也。\n萬物若無則不應起者。無若定無。則不應緣會而起也。\n起則非無者。以緣起而生。故知非無也。\n以明夫緣起故不無也者。明知緣起故非無也。而言以者。以用也。0173b14"
        ],
        [
          92,
          "故摩訶衍論云下",
          "第二單引一論以明空也。文中有二。前正引論。後釋論意也。\n一切諸法一切因緣故應有者。諸法皆從因緣故有也。\n一切諸法一切因緣故不應有者。諸法皆從緣故。非定有也。\n一切無法一切因緣故應有者。諸法本無。從緣故有也。\n一切無法一切因緣故不應有者。諸法從緣有者。以從緣故。非定有也。0173b25"
        ],
        [
          93,
          "尋此有無之言下",
          "第二釋論意也。上來兩對各各相反。如此相反。非徒然也。尋此語意。是明非有非無中道耳。\n此是理一稱二其文有似不同者。只是一物。而言非有非無。故云稱二。言非有似異非無。言非無似異非有。故云不同也。\n苟領其所同則無異而不同者。苟且也。所同者。謂中道也。言非有非無皆明中道。中道既同。故無不同也。0173c03"
        ],
        [
          94,
          "然則萬法果有其所以不有下",
          "第四重據理以明空也。文中有三。先正明空。次覆疏解釋。後引經證成。今初。據理意同前章也。0173c11"
        ],
        [
          95,
          "何則欲言其有下",
          "第二覆疏解釋也。有非真生者。假緣而生。故非真生。非真生故。不得言有也。\n事像既形者。萬事萬像皆已形現。皆已形現。不得言無也。像形不即無。\n非真無非實有者。事像形現。不即是無。有非真生。非是定有也。\n然則不真空義顯於茲矣者。正以非真實有。故言不真。既非實有。所以言空。論之得名。從此義也。0173c14"
        ],
        [
          96,
          "故放光云下",
          "第三引經證成也。譬如幻化人者。此有三讀。一者。連三句通成一段。二者譬如幻化人為句。後兩句相著也。三者。譬如幻化人非無幻化人為句。已後為一段。今且從初也。幻化異者。從無起有為化。從有起有為幻也。非無幻化人幻化人非真人者。非無即非無也。非真即非有也。0173c22"
        ],
        [
          97,
          "夫以名求物物無當名之實下",
          "第五就名實以明空也。文中有二。前正明空。後引經論證成。今初也。將名取物。物非是名。故云物無當名之實也。以物求名名無得物之功者。將物取名。名非是物。故云名無得物之功也。物無當名之實下。覆疏前句也。是為名不當實下。又覆疏上句。直明名非實。實非名耳。名實無當萬物安在者。名不當實。則名非名矣。實不當名。則實非實矣。名實不當。萬物皆空。故云安在。安在者何在也。0173c29"
        ],
        [
          98,
          "故中觀云下",
          "第二引經論證成也。先引中觀論。後引成具等經。0174a10"
        ],
        [
          161,
          "今云物無彼此者。",
          "通是中論意也。亦可別指觀苦品一偈。偈云。自作若不成。云何彼作苦。若彼人作苦。是亦名為作。今取此意反證也。此彼莫定乎一名下。此不定此。彼不定彼。而惑者謂為定有此彼也。必然者決定也。志者志意。意有記錄故名為志耳。0174a10"
        ],
        [
          160,
          "然則彼此初非有惑者初非無者。",
          "彼此無定性。故云非有。於惑者則元不無也。0174a10"
        ],
        [
          159,
          "既悟此彼之非有又何物而可有哉者。",
          "彼此在物既無。彼此又無物也。0174a10"
        ],
        [
          158,
          "故知萬物非真假號久矣者。",
          "號名也。以非真是假。故名為空。0174a10"
        ],
        [
          157,
          "是以成具立釋名之文下。",
          "引成具及大品經證成也。先引成具經及莊子。後引大品。今引成具經。兼引莊子。助成此義也。成具光明定意經云。是法無所有。強為其名也。莊子云。以指喻指之非指。不若非指喻指之非指。以馬喻馬之非馬。不若非馬喻馬之非馬。此意云。此以此指為指。將彼指為非指。彼亦以彼指為指。將此指為非指。於馬亦然。各有一彼此。則彼此無定。各有一是非。則是非無定也。0174a10"
        ],
        [
          156,
          "而言園林者。",
          "莊子為膝園吏。故云爾也。0174a10"
        ],
        [
          155,
          "如此則深遠之言於何而不在者。",
          "無彼無此。此是深言。成具固已有之。莊子亦作此說也。0174a10"
        ],
        [
          154,
          "是以聖人乘千化而不變下。",
          "以萬法是空。故聖人變之。而不染也。0174a10"
        ],
        [
          153,
          "千化萬變者。",
          "意言多也。變化非一。故云千化。惑倒非一。故云萬惑。雖乘千化。出生入死。而不為生死所染。故云不變。雖履萬惑。無所不為。而不為倒惑所壅。故云常通也。0174a10"
        ],
        [
          152,
          "必以其即萬物之自虛下。",
          "以法自空。不假將空觀。本空法也。經云甚奇世尊下。引大品經證成也。彼經云。如來建立眾生於實際。古本云立處。今引古大品文也。明一切諸法是實際。能令眾生知諸法皆是真際。故云為諸法立處也。0174a10"
        ],
        [
          151,
          "非離真而立處下。",
          "非是離真際。別建立眾生於真際。即明眾生是真際。故云立處即真也。0174a10"
        ],
        [
          99,
          "然則道遠乎哉下",
          "第六會結以明空也。道謂無生真理也。聖謂般若真智也。道遠乎哉者。言不遠也。觸事皆是道。更無別道耳。聖遠乎哉。言不遠也。體悟即是聖。更無別有聖人。0174b18"
        ]
      ],
      "tag": "康"
    },
    "憨": {
      "col": 0,
      "desc": "X0873 肇論略注，明·德清",
      "name": "X0873_002",
      "notes": [
        [
          1,
          "不真空論第二",
          "此論真空不空。以為所觀真諦之境也。不真有二義。一有為之法。緣生故假。假而不實。其體本空。此俗諦不真故空。名不真空。真性緣起。成一切法。體非斷滅。不是實實的空。名不真空。有是假有為妙有。空非斷空為妙空。此則非有非空為中道第一義諦。以妙空破心無論本無論二宗。以妙有破即色遊玄論一宗。即命題一語。曲盡真諦之妙。妙契中道之旨。非玄鑑幽靈。何以至此。0337a21"
        ],
        [
          2,
          "夫至虗無生者。(指中道第一義諦。非思量分別境界)蓋是般若玄鑑之妙趣。有物之宗極者也。(般若實智照理。故曰玄鑑。中道為實智所歸。故曰妙趣。此則空而不空。有物以中道為宗極。故有而不有。非空非有。妙盡中道。此標宗立體。下依宗辨相)自非聖明特達。何能契神於有無之間哉。(上言所觀之境。此言能觀之人。中道妙理。唯聖乃證。故曰自非聖明有獨達之智。何能契悟於二而不二之間哉)是以至人通神心於無窮。窮所不能滯。極耳目於視聽。聲色所不能制者。豈不以其即萬物之自虗。故物不能累其神明者也。",
          "此釋上不滯二邊之所以也。神心。謂實智內照即玄鑑。無窮。謂中道即妙趣。窮不能滯。謂不墮斷空此釋上半句謂不滯空。下釋次半句不滯有。極耳下。謂權智外應。耳目聲色乃有物。極。謂宗極。由權智外應。而不動本際。故處有而不為所制。聖能如此者。豈不以即萬物之自虗。故物不真累其神明哉。由萬物自體本虗。故即有以觀空。故物物皆真。與智冥一。故不能累其神明也。0337b13"
        ],
        [
          3,
          "是以聖人乘真心而理順。則無滯而不通。(此承上不滯二邊以明妙契中道之所以也。理。調也。聖人乘一真之心。而調順萬物。則物物皆真。無一法可當情。故無滯不通)審一氣以觀化。故所遇而順適。(審。猶處也。一氣。猶一真。化。謂萬法。以審處一真之心。以觀萬法。則法法皆真。萬物皆己。故所遇順適)無滯而不通。故能混雜致湻。(混。謂混融。雜。謂異類。[涼-小+田]。謂一真。由法法皆真。故眾生如也。眾生本如。故能混融異類。則終日度生不見生之可度。平等寂滅。故一一[涼-小+田]真)所遇而順適。故則觸物而一。(以所遇皆真。故觸事而真。故物物歸一)如此。則萬象雖殊。而不能自異。(此結顯一源。良由心境一如。故萬法皆如。故不能自異)不能自異。故知象非真象。象非真象故。則雖象而非象。(由心境不異。則萬法皆空。故象非真象。諸相寂滅。則無法當情。故雖象而非象矣)然則物我同根。(物。謂境。我。謂心。同根。謂心境一如。釋上觀智俱泯。心境兩忘)是非一氣。(是。謂真諦。非謂俗諦。一氣。謂真俗不二。妙契中道)潛微幽隱。(如此境智俱忘。真俗絕待。長為深潛微密幽隱之境界。唯聖能證能知)殆(殊也)非群情之所盡。(如上所云。殊非淺智劣解者所能盡也)故頃爾談論。至於虗宗。每有不同。夫以不同而適同。有何物而可同哉。故眾論競作。而性莫同焉。",
          "此下敘異見皆在所破。以申作論之懷也。虗宗。即下所引三宗。各立異見。故每有不同。大凡立論蓋為顯理。今以不同之見。以適大同之理。有何法而可同哉。由各騁己見。競論虗宗。所見不一。故論旨不同。要歸至理。則畢竟難同。故得不已。造此論以破之。0337c12"
        ],
        [
          4,
          "何則。(徵起眾論)心無者。(先敘破晉道恒心無宗)無心於萬物。萬物未嘗無。(此敘異計也。言心無者。謂但無心趨附於萬物。未達物虗故。萬物未嘗無)此得在於神靜。失在於物虗。",
          "此出得失也。以心不附物。則不被外境搖動。故得在於神靜。以不了萬物緣生性空。故失在於物虗。以心空境有。非中道也。0337c21"
        ],
        [
          5,
          "即色者。(次破晉道林造即色遊玄論。為即色宗)明色不自色。故雖色而非色也。(此敘計也。謂青黃等色。不自為色。但因人名之為色。心若不計。則雖色而非色矣)夫言色者。但當色即色。豈待色色而後為色哉。此直語色不自色。未領色之非色也。",
          "此敘破也。夫凡言色者。但當在色本就是色。豈待人名彼青黃然後為色哉。此直下。言得失。此但言色不自色而已。未了色體本空也。以唯知依他起名假。不知圓成體真。故非正論。0338a04"
        ],
        [
          6,
          "本無者。(此破晉竺法汰本無宗)情尚於無。多觸言以賓無。故非有。有即無。非無。無亦無。(此敘計也。此以情好尚於無。故觸事發言。皆賓伏於無。故言非有。則計有亦無也。及言非無。則計無亦無也。有無俱無。將謂虗玄。不知墮於斷見。未明正理。故非正論)尋夫立文之本旨者。直以非有。非真有。非無。非真無耳。(此出正理也。詳夫聖人立言之本意。但以非有者。顯物非實有。言非無者。顯無非絕無也)何必非有無此有。非無無彼無。此直好無之談。豈謂順通事實。即物之情哉。",
          "何必下。斥異見也。然非有非無。但是有非實有。無非實無。又何必執計非有為絕無此有。非無謂絕無彼無哉。然雖有無俱無。似為玄妙。此直好無之談。未達正理。豈是順通事物之實性。以達即物明真之旨哉。上敘破計。下敘立論正義。0338a15"
        ],
        [
          7,
          "夫以物物(二物字。謂以名名物)於物。(此物字。所名之物)則所物(此物字謂所名)而可物。(此物字。乃所名之物)以物物(二物字。亦是以名名物)非物。(此物字亦指所名之物。言非物。如龜毛兔角等)故雖物而非物。(言雖有其名。無實物可得)是以物不即名而就實。名不即物而履真。",
          "將以名言論真諦。惟真諦非名言可及。故發論之初。先以名物以啟端。謂以名名於有相之物。則有物可指。若以名名於非物。然非物乃無相之物。如呼龜毛兔角等。此則但有虗名。其實無物以當其名。故曰雖物而非物。由是觀之。如說火談冰。豈有寒熱於齒頰。此物不即名以就實也。如呼龜毛兔角。豈有毛角以應求。此名不即物而履真。謂不就所呼而得實物也。是知名不就實。則有相之物皆假名。物不履真。則無狀之體但虗稱。密嚴云。世間眾色法。但相無有餘。唯依相立名。是名無實事。物尚如此。況真諦無相。豈名言之可及乎。故下云。0338a24"
        ],
        [
          8,
          "然則真諦獨靜於名教之外。豈曰文言之能辨哉。然不能杜默。聊復厝言以擬之。試論之曰。",
          "真諦寂寥空廓。思議之所不及。離相離名。象數所不能詮。迥出常情。故曰獨靜於名教之外。如此豈語言文字所能辯哉。今為破迷執以顯正理。故不能杜口緘默。聊復厝置其言以擬議之。略試論之耳。上敘意。下正論。0338b13"
        ],
        [
          9,
          "摩訶衍論云。諸法亦非有相。亦非無相。中論云。諸法不有不無者。第一真諦也。",
          "此引教定宗也。言諸法非有非無者。先立中道諦體也。言不有者。即俗諦不有也。不無者。真諦不無也。以俗諦假有不真故空。真諦緣生故。不是實實斷空。故題稱不真空。含有二義。此遮二邊以顯中也。故立論之初。引此二論以定綱宗。發明中道第一義諦。不屬有無二邊也。下依宗斥邪。0338b20"
        ],
        [
          10,
          "尋夫不有不無者。豈謂滌除萬物。杜塞視聽。寂寥虗豁。然後為真諦者乎。",
          "此斥邪謬。先破本無一宗也。以本無宗義。謂非有。有亦無。非無。無亦無。有無俱絕。不達緣生千化之有。故墮斷空。以此斷空絕無一法。故云滌除萬物。聞見俱泯。故云杜塞視聽。古人呼此為豁達空。故云寂寥虗豁。意謂不有不無者。蓋是雙非二邊。以顯中道第一義諦。豈以豁達斷空為真諦乎。古德云。寧起有見如須彌山。不起無見如芥子許。永嘉云。豁達空。撥因果。莽莽蕩蕩招殃禍。以此一宗為害甚巨。眾聖所呵。正在所破。故論開端即痛斥之。急欲令人發起大乘正信也。下顯正義。0338c04"
        ],
        [
          11,
          "誠以即物順通。故物莫之逆。(此顯正義。言非有者。在即物以順通其理。故物物順理而不逆。是為非有)即偽即真。故性莫之易。(言諸法緣生虗假。故即假即真。不必改易然後為真。若改易求真。是為析色非真空也。故為非無)性莫之易。故雖無而有。(不是實無)物莫之逆。故雖有而無。(不是實有)雖有而無。所謂非有。(結以不真故空)雖無而有。所謂非無。(結不是實空)如此。則非無物也。(言非是絕無。正破所執)物非真物。(但物非真物耳。正出論義)物非真物。(非真。即題稱不真)故於何而可物(不可物。即題稱空義)。",
          "反覆論議非有非無。以釋成不真空義。以破本無之妄計也。蓋即有以明空。是謂妙空。即空以明有。是謂妙有。不真一語。盡大乘空義。真諦之理。妙極於斯。0338c21"
        ],
        [
          12,
          "故經云。色之性空。非色敗空。以明夫聖人之於物也。即萬物之自虗。豈待宰割以求通哉。",
          "此下依宗廣辨。以明二諦無雙。以顯中道第一義諦也。文有三段。初色空不二。次真俗不二。三有無不二。今初。色性自空。在色即是空。非色敗為空。此正顯色空不二也。是故聖人即萬法以見性空。以萬法本性自空。故不待宰割分析然後為空也。彼計本無者。豈不淪於斷滅耶。0339a03"
        ],
        [
          13,
          "是以寢疾有不真之談。超日有即虗之稱。然則三藏殊文。統之者一也。",
          "此引二經以證色空不二之義也。淨名云。菩薩病者。非真非有。超日明三昧經云。不有受。不保命。四大虗也。非但二經明色性空義。即三藏殊文。皆顯色空不二之旨。故曰統之者一也。0339a11"
        ],
        [
          14,
          "故放光云。第一真諦。無成無得。世俗諦故。便有成有得。",
          "次明真俗不二也。先引經約成得以定二諦。以真諦離緣。故無成得。俗諦緣生。故有成得。0339a17"
        ],
        [
          15,
          "夫有得即是無得之偽號。無得即是有得之真名。",
          "此約真偽以分真俗。以真俗諦緣生故假。故曰偽號。從無住本立一切法。故無得是有得真名。0339a20"
        ],
        [
          16,
          "真名故。雖真而非有。偽號故。雖偽而非無。",
          "此下約雙非以明不二。先出所以。良由有依真立。故有而非有。真自隨緣。故無而不無。0339a23"
        ],
        [
          17,
          "是以言真未嘗有。(以物即真。故未嘗有)言偽未嘗無。(隨緣建立故不無)二言未始一。二理未始殊。(言異而旨一)故經云。真諦俗諦謂有異耶。答曰無異也。(正顯不二)此經直辯真諦以明非有。俗諦以明非無。豈以諦二而二於物哉。",
          "放光已下。通明真俗不二之旨也。物。指中道理。古德云。二諦並非雙。言單未曾各。宗門謂一雙孤鴈。搏地高飛。一對鴛鴦。池邊獨立。曹洞賓主五位。正偏兼帶。照用同時。雖發明向上。實顯理事混融。真俗不二之旨。苟悟即真。自然得大機用矣。0339b05"
        ],
        [
          18,
          "然則萬物果有其所以不有。有其所以不無。",
          "此下三辨有無不二也。此以二語徵起。果。實也。謂萬物果有其不有。果有其不無耶。且徵定。下四句釋也。0339b11"
        ],
        [
          19,
          "有其所以不有。故雖有而非有。有其所以不無。故雖無而非無。",
          "釋不有不無義也。謂果有真空。則幻有是假。故雖有而不有。果有妙有。則無非斷滅。故雖無不無。故下成正義。0339b16"
        ],
        [
          20,
          "雖無而非無。無者不絕虗。(非豁達斷空)雖有而非有。有者非真有。(謂是緣生假有。故非實有)若有不即真。(謂不實有)無不夷跡。然則有無稱異。其致一也。",
          "此結成有無。總顯不二之義也。謂若有不是實有。當即有以觀無。則無非實無。不必芟夷其跡。然後為無也。若芟夷其跡。則為析色。若絕無。則墮斷滅。以真諦之理。本非有無。故稱異而致一也。上顯真俗不二。下引經斥迷。以攝歸真。0339b22"
        ],
        [
          21,
          "故童子歎曰。說法不有亦不無。以因緣故諸法生。",
          "引經證成。攝歸真諦非有非無也。楞嚴云。真性有為空。緣生故如幻。無為無起滅。不實如空華。以從因緣。故非有無。0339c04"
        ],
        [
          22,
          "瓔珞經云。轉法輪者。亦非有轉。亦非無轉。是謂轉無所轉。此乃眾經之微言也。",
          "良以說法非有非無。故法輪轉無所轉。諸大乘經唯明此理。而人不達。妄執定有定無。故下斥破。0339c09"
        ],
        [
          23,
          "何者。謂物無耶。則邪見非惑。謂物有耶。則常見為得。",
          "將斥迷謬。先縱顯俱非也。謂法果實無。則執斷之邪見非惑矣。若法果實有。則執常者為得矣。0339c12"
        ],
        [
          24,
          "以物非無。故邪見為惑。(此正破本無心無二宗)以物非有。故常見不得。(此破即色一宗)然則非有非無者。信真諦之談也。",
          "斥破迷謬。以攝歸真諦也。上約三種不二。反覆覈論非有非無。以祛迷執。苟契雙非。不墮二邊。則真諦自顯矣。0339c16"
        ],
        [
          25,
          "故道行云。心亦不有亦不無。中觀云。物從因緣故不有。緣起故不無。尋理即其然矣。",
          "此下至顯於茲矣一段。正顯不真空義。初引道行立義。次引中觀。約緣生無性以明不真。論云。因緣所生法。我說即是空。亦名為假名。亦名中道義。以從緣生是假。故不有。既從緣起。則本不有而今有之。故云不無。由假故不真。為空。以緣起故不實無。故不是真空。0339c21"
        ],
        [
          26,
          "所以然者。(此下辨非有無)夫有若真(實也)有。有自(一向)常有。豈待緣(會聚)而後有哉。譬彼真無。無自常無。豈待緣而後無也。若有不自有。待緣而後有者。故知有非真(實也)有。有非真(實也)有。雖有不可謂之有矣。(上釋非有)不無者。夫無則湛(凝也)然不動。(變也)可(許也)謂之無。萬物若無。則不應起。起則非無。以明緣起故不無也。",
          "此約因緣以明非有非無也。謂若有是實有。則一向自有。不待緣會而後有矣。譬彼真無亦不待緣。今既待緣生。則非實有矣。若無則湛然不動。可謂之無。湛然者。以始教相宗。不許真如隨緣。謂凝然不變。故論主出此文以破執無之見。意謂真如既已隨緣成一切法。則非凝然不變矣。以真如有不變隨緣。隨緣不變二義。下引論證成。0340a09"
        ],
        [
          27,
          "故摩訶衍論云。一切諸法。一切因緣故應有。一切諸法。一切因緣故不應有。一切無法。一切因緣故應有。一切有法。一切因緣故不應有。(下斥異見)尋此有無之言。豈直反論而已哉。",
          "此引大論。重釋因緣義也。謂諸法既屬因緣。則本非有無。是知無屬因緣。則非斷無。有屬因緣。則非實有。尋思此言。豈但相反之論而已哉。其意特顯諸法非有非無義也。良以佛說因緣二字。破盡外道斷常之疑。故論宗此以斥異見。0340a20"
        ],
        [
          28,
          "若應有。即是有。不應言無。若應無。即是無。不應言有。",
          "此言申相反意。謂法應是實有。則不當言無。若應是實無。則不當言有。今言非有非無者。正以假而非真。故言非有非無耳。下釋異同。0340b02"
        ],
        [
          29,
          "言有。是為假有以明非無。借無以辨非有。此事一稱二。其文有似不同。苟領其所同。則無異而不同。",
          "此釋異同以明不二也。今言有無者。但是假借有無。以明非無非有耳。非實有有無作實法也。其實一體。但稱說似有不同。苟能領會一真之理。則萬法唯真。無異而不同也。下顯不真空義。0340b07"
        ],
        [
          30,
          "然則萬法果有其所以不有。不可得而有。有其所以不無。不可得而無。",
          "此辨雙非以顯不真空義也。謂萬法實不有。豈可強執為有耶。諸法果不無。豈可強執為無耶。故不可定執為有為無也。0340b13"
        ],
        [
          31,
          "何則。(徵釋雙非)欲言其有。有非真(實也)生。欲言其無。事象既形。象形不即無。非真非實有。然則不真空義。顯於茲矣。",
          "此顯雙非。結歸不真空義。以呈觀體也。若言實有。則緣會而生。本自無生。故非真實生也。若言實無。則緣起即形。隨緣成事。則非實無也。二者皆非真實。故題稱曰不真空。義顯於茲。良以不真故空。故非實有絕無也。前約緣性無生以明不真竟。下約名實無當以明不真。0340b19"
        ],
        [
          32,
          "故放光云。諸法假號不真。譬如幻化人。非無幻化人。幻化人。非真人也。",
          "此引經證成不真義也。彼經二十七云。須菩提。名字者不真。假號為名。以假故不真。謂但非實有。非絕無也。故如幻化人。非無幻化人。但非真人耳。0340c03"
        ],
        [
          33,
          "夫以名求物。物無當名之實。以物求名。名無得物之功。",
          "此以假名釋非有非無也。以名求物。如呼木賊地龍等物。豈有真賊真龍以當其名耶。以物求名。如召火呼冰。豈實有寒熱以及齒頰耶。足知名實無當。0340c08"
        ],
        [
          34,
          "物無當名之實。非物也。名無得物之功。非名也。是以名不當實。實不當名。名實無當。萬物安在。",
          "名實無當。則名相元虗。求物而不可得。則妄想不有。此心境兩空。真俗不立。中道之旨。於是乎顯矣。下斥迷返悟。0340c14"
        ],
        [
          35,
          "故中觀云。物無彼此。而人以此為此。以彼為彼。彼亦以此為彼。以彼為此。",
          "中論第四云。諸法實相。無有彼此。意顯法本一真。元無彼此。由人妄執。故起是非。三祖云。良由取捨。所以不如。0340c19"
        ],
        [
          36,
          "此彼莫定乎一名。而惑者懷必然之志。然則彼此初非有。惑者初非無。",
          "此出迷者雙執也。如兩人東西對立。同觀一標。東者謂在西。而西者謂在東。然標實無東西。迷人妄執為必然。此惑之甚也。故彼此未始有。惑者未始無。由是觀之。諸法本無。而迷者妄執為定有定無。正此意也。0340c24"
        ],
        [
          37,
          "既悟彼此之非有。有何物(彼此)而可有(執也)哉。故知萬物非真。假號久矣。",
          "此言悟則是非兩忘。自離有無之執也。既悟物無彼此。則知法非有無。但有假名。元無實義。0341a07"
        ],
        [
          38,
          "是以成具立強名之文。園林託指馬之況。如此。則深遠之言。於何而不在。",
          "此引內外微言。以結屬忘言之妙也。成具云。諸法無所有。強為其名。園林。即漆園。莊周嘗為此吏。故以地指人也。指馬之喻。齊物論云。以指喻指之非指。不若以非指喻指之非指。以馬喻馬之非馬。不若以非馬喻馬之非馬。天地一指也。萬物一馬也。意謂物論之不齊者。蓋由人之各執是非之見也。以指喻指等者。謂人以己之初指。喻彼之次指。為非同己之指以為必然。若易而觀之。則彼之執次指者。又以己之初指為非矣。馬即雙陸之馬。戲籌也。意亦如指。意謂指馬本無是非。而人妄執彼此為必然。豈非惑耶。以譬諸法實相。豈有自他。而人迷執為有無。亦猶是也。苟能忘言契理。則彼此情忘。是非齊泯。有何法可當情乎。成具則妄想元空。園林則是非無主。故曰深遠之言。於何而不在。0341a11"
        ],
        [
          39,
          "是以聖人乘千化而不變。履萬惑而常通者。以其即萬物之自虗。不假虗而虗物也。故經云。甚奇世尊。不動真際為諸法立處。非離真而立處。立處即真也。",
          "此結歸中道第一義諦也。以聖人證窮真諦。故異類分身而不動真際。故千化不變。入眾生界而不被煩惱所礙。故萬惑常通。以其萬法即真。故不假分析而後為虗也。故引經證成。由不動真際而建立諸法。故立處即真。0341b04"
        ],
        [
          40,
          "然則道遠乎哉。觸事而真。聖遠乎哉。體之即神。",
          "此結歸一心。以明聖人之實證也。初云目對真而不覺。以道在目前。故不遠。以不覺。則迷之為凡。悟則為聖。是知了悟實相常住。則頓超生死。永證無為。故曰體之即神。不假外也。0341b10"
        ]
      ],
      "tag": "憨"
    },
    "文": {
      "col": 0,
      "desc": "T1860 肇論新疏，元·文才",
      "name": "T1860_001",
      "notes": [
        [
          624,
          "不真空論第二",
          "一切諸法無自性生。資緣而起。起而非真。如幻如夢當體空也。故下云。待緣而有。有非真有。又云萬物非真假號久矣。皆明不真也。又云。即萬物之自虛色即是空。皆明空也。又云。寢疾有不真之談。超日有即虛之稱。雙示不真空也。緣起故有非無也。從緣故空非有也。中道之旨於斯玄會。故宗云。不有不無也。若約二諦明空有者。俗諦故非無。真諦故非有。為第一真也。下皆有文。恐繁不引。0208a09"
        ],
        [
          625,
          "夫至虛無生者。蓋是般若玄鑒之妙趣(向也)有物之宗極者也",
          "初句依經標牒。次句約心顯妙。後句萬物宗體。勝義無上曰至。有無一異等俱離曰虛。無生者。謂緣集諸法非自非他。非共。亦非無因。亦非作者。無生而生非無也。雖生不生非有也。若此萬象森羅無非中道。下論云。第一真諦也。又云。觸物而一。般若下明。此勝義非識能識。但是聖智玄鑒所向之境。亦為緣有萬物所宗至極之性也。0208a19"
        ],
        [
          626,
          "自非聖明特(猶獨也)達。何能契神(智也)於有無之間(中也)哉",
          "反顯也。順明云。唯聖人明智獨了可契此中道也。0208a28"
        ],
        [
          627,
          "是以至人通神心於無窮。所不能滯。極耳目於視聽聲色所。不能制者",
          "果極因滿曰至。示化人流曰人。謂無上士也。初二句實智內通。神心智也。出分別故無窮理也。絕邊量故。窮所等者。謂悉覺真諦不滯於寂。後二句權智外應。目極視而色不膠。耳洞聽而聲弗制。則遍應諸緣不縛於有如斯不滯不制何耶。0208b02"
        ],
        [
          628,
          "豈不以其即萬物之自虛。故物不能累其神明者也",
          "雙出所以也。萬物謂聲色等諸相。從緣無性故云虛也。累謂負累。神明即上神心。意云。即物之虛證之不能滯。應之不能制。抑何累於神明哉。此上依境辯心似二智殊照。既即物之虛而一源。則自真之權而無異。0208b09"
        ],
        [
          629,
          "是以聖人乘真心而理順。則無滯而不通。審一氣以觀化。故所遇而順適",
          "復釋前文也。前云通神心等。云何通耶。故此云乘真心而理順等。乘憑也真心即理智也。理屬性空之理。不逆物故名順。正理於順。順法即虛。不須析破。析破則逆法。何能通於無窮邪。若此則無一滯碍之法不虛而通也。準此滯含二義。一不滯寂。二不滯物也。前文云極耳目等。云何極耶。故此云審一氣等。一氣語借道家喻一性也。觀謂觀照即量智也。化謂萬化即一切事相也。遇謂對遇。適者。契合也。意云。諦審一氣之性以觀萬化。則凡所對遇無不順性而契合。如此雖極目觀色。無非實相。縱耳聆音反聞自性。豈惑聲色而為制哉。前文雙出所以。但明不滯不制之相。此文乃釋內通外應之由。所以為異也。然了境由心依心照境。境則真俗不二第一真也。心則理量齊鑑中道智也。次下明之。0208b15"
        ],
        [
          630,
          "無滯而不通。故能混(融也)雜致(得也)淳。所遇而順適故則觸物而一(中也)躡前會歸中道也",
          "淳雜者。以二諦言之。俗諦故雜。真諦故淳。以中道言之。二諦相待亦雜也。中道無二故淳也。今文是此則二諦融會。二而不二之中也。觸謂心所對觸。即緣生諸法也。以從緣非有緣起不無。故觸物皆一。一即第一真諦也。清涼云。觸物皆中居然交徹。此皆論於中者論之所宗故。又只可觀察世俗而入第一真諦。不應觀察第一真諦而入世俗也。故涅槃云。世諦者。即第一義諦。如清涼鈔具敘。0208c04"
        ],
        [
          631,
          "如此則萬象雖殊而不能自異。不能自異故知象非真象。象非真象故。則雖象而非象",
          "如此者。屬前混雜致淳等。既淳既一。豈云異乎。正義至此略周。結歸本題也。初四句結不真。後二句結空可知。雲庵本中失後二句。但有不真之理。缺於空義。今從古本。0208c15"
        ],
        [
          632,
          "然則物我同根是非一氣(體也)潛微隱幽殆(將也)非群情之所盡",
          "將破三家謬計。故復舉甚深之理。難解難入致令所見未徹也。物即真俗融通之境。我則權實雙融之心。同根者。心境相收無異故。是非者。真俗也。亦相即故一氣也。生公云。是非相待故有真俗名生。苟一諦為真。四言成權矣。潛微下理深曰潛。難見曰隱。群情容解。但不能盡之。如三家者。0208c21"
        ],
        [
          633,
          "故頃爾(近也)談論。至於虛宗每有不同。夫以不同而適同。有何物而可同哉。故眾論競作而性莫同焉",
          "初句舉時謬之輩。由正理幽隱。所以近來云云。次二句見異。次二句執異背同。後二句依見述論。唐光瑤禪師疏有七宗。此論略出三家。故云眾也。見既有異性理隨殊。0208c29"
        ],
        [
          634,
          "何則(通徵)心無者無心於萬物。萬物未嘗無",
          "據梁傳。晉僧道恒述心無論。汰公遠公俱破此說。初句牒。次句謂心無諸法。後句執法實有。0209a07"
        ],
        [
          635,
          "此得在於神靜。失在於物虛",
          "由心無法故得於神靜。不了物空故失虛也。亦心外有境。0209a11"
        ],
        [
          636,
          "即色者明色不自色。故雖色而非色也",
          "東晉支道林作即色遊玄論。初句牒。次二句敘彼所計。彼謂青黃等相非色自能。人名為青黃等。心若不計青黃等皆空。以釋經中色即是空。0209a13"
        ],
        [
          637,
          "夫言色者。但當色即色。豈侍色(計也)色而後為色哉",
          "齊此論主破辭。此且先出正理。初句牒名。次句示依他。謂凡是質礙之色。緣會而生者心雖不計。亦色法也。受想等法亦應例同。意云。豈待人心計彼謂青黃等。然後作青等色耶。以青黃亦緣生故。0209a18"
        ],
        [
          638,
          "此直(但也)語色不自色。未領(解也)色之非色也",
          "初句明所待。後句顯所失。未達緣起性空。然緣起之法亦心之相分。能見之心隨相而轉。取相立名名青黃等。名屬遍計相即依他。支公已了名假。未了相空。名相俱空圓成顯現。由未了此。所以被破。0209a24"
        ],
        [
          639,
          "本無者情尚於無。多觸言以賓(伏也)無。故非有有即無。非無無即無",
          "亦東晉竺法汰作本無論。初二句明其尚無。中心崇尚於無。故凡所發言皆賓伏於無也。次四句出彼解相。以經論有雙非之句。汰公解云。非有者。非斥了有。非無者。和無亦無。却則淪於太無爾。0209b01"
        ],
        [
          640,
          "尋夫立文之本旨者。直(正也)以非有非真有。非無非真無爾",
          "論主與示雙非正理。然後破之。經論成立非有非無之本意者。正以諸法賴緣而有。非真實有故云非有。以諸法緣起故有。非一向無故云非無。圭峰略鈔之義如此。下論亦多請無疑慮。0209b07"
        ],
        [
          641,
          "何必非有無此有。非無無彼無。此直好無之談。豈謂順通事(物也)實(性也)即物之情(解也)哉",
          "初二句斥彼謬計義不異前。何必者責彼之辭。後二句直破其非尚無如此。豈是順物達性即物見中之解耶。今詳破此三家。前二家許其所得。破其所失。汰師尚無。一向破斥者。亦以著空之見難治故也。非特撥無因果。亦恐惡取斷空。如智論說食鹽之喻也。據梁傳。支汰二師皆出類離群世間之英者。正由道源初浸。又經論未廣。明師罕遇。致有此弊。不可見破便輕前修自下正述論文。大科有三初。理絕名相謂。欲寄名依相顯示。先示名相本虛真諦超出。令悟了法不在言。善入無言際也。二寄詮顯實。以名相雖虛亦可假詮以顯實理。即無離文字說解脫也。三至論末引放光等示妄顯真。謂雖依詮顯實。若著名相妄想是生。何能悟入第一之真。若悟名相本虛。即名相而如智顯現。不在捨於文也。故我說。法如筏喻者。文字性空即是解脫。十二分教無非如也。一論大旨妙在于斯。但血脈沈隱故具出之。0209b13"
        ],
        [
          642,
          "夫以(依也)物物(名)於物。則所物而可物",
          "若依相立名隨名取物。則凡是所名之物皆可為物。此謂妄心所計名相俱有。0209c05"
        ],
        [
          643,
          "以物(名)物(相)非物。故雖物(名)而非物(名)",
          "初句相空。後句名空。以二法皆事故。通名為物。意以所名之物。但依他起元無自性。況名依相有。豈有實體也。故密嚴云。世間眾色法但相無有餘。唯依相立名。是名無實事。0209c08"
        ],
        [
          644,
          "是以物不即名而就實。名不即物而履(行)真(實)",
          "釋此有二。一通。二局。通者。名相二法該盡俗諦。然性各異。互推無在顯兩虛也。初句物不在於名中。以名非物故召火不燒其口。次句名不在於物中。以物非名故。見物不知其名。應知因物立名以名名物。俗假施設竟不相到。故不能互顯其真實。如火以熱為實等。局者。但屬此論。名謂名教。相謂義相。所以空者。方便安立各無自性能所詮異故不即。就論意雖通其旨實局。以下云真諦獨靜於名教之外。故為此釋。0209c13"
        ],
        [
          645,
          "然則真然諦獨靜於名教之外。豈曰文言之能辨哉",
          "真諦第一義也。非名言可說。非義相可示。直以名相本空故也然不能杜默。聊復厝(置)言以擬之。試論之曰　理須言顯。亦不能閉口默然也。擬謂比擬。意云。但依言彷彿比擬真諦。而論量也。0209c24"
        ],
        [
          646,
          "摩訶衍論云。諸法亦非有相亦非無相。中觀云。諸法不有不無者。第一真諦也",
          "初引智論。後第二十七中一句。又義引中論轉釋。云即第一真諦。引此二論以為宗依。下論廣釋。皆云諸法者。則統貫一切也。以是義宗故引通名。總辨即中之理。次下依宗開示。或約空色乃至言說心行等。一一別顯。末後引中觀等二論。約因緣生法以辨之。乃復總攝一切。非真空色等也。始末依此詳考。方知論旨成立之妙。第一者。真俗非二故。非真俗之二故。0210a01"
        ],
        [
          647,
          "尋夫不有不無者。豈謂滌除萬物杜塞視聽。寂寥虛豁。然後為真諦者乎",
          "二論皆云。不有又不無者。非撥喪萬物閉目塞聰。絕色滅聲。取虛豁混茫之空。是真諦也。0210a12"
        ],
        [
          648,
          "誠以即物順通故。物莫之逆。即偽即真故。性莫之易",
          "就物順通。非杜塞視聽故。不逆其物。即俗偽而顯真。何待虛豁。故不易其性也。0210a16"
        ],
        [
          649,
          "性莫之易故。雖無而有。物莫之逆故。雖有而無。雖有而無所謂非有。雖無而有所謂非無",
          "初四句躡前釋成。以理事相即故。互存相奪故互亡也。後四句躡前釋成。非有非無之中也。此中真諦故無。俗諦故有。相奪兩非第一真也。0210a19"
        ],
        [
          650,
          "如此則非無物也。物非真物。物非真物故。於何而可物",
          "即物示真性。真物假名相皆不立也。密嚴云。二合生分別名量亦非有。非真即題中不真。於何可物。即題中空字。自下依宗廣釋。皆初引教。後依教釋義。文雖各殊義旨無異。今依論中會釋。或約空色。或依二諦等。一一隨次明之。大要皆約諸法。以明不異第一之真也。0210a25"
        ],
        [
          651,
          "故經云。色之性空非色敗空",
          "初依色空以釋中也。淨名經文。然諸經多有。0210b04"
        ],
        [
          652,
          "以明夫聖人之於物也。即萬物之自虛。豈待宰割以求通哉",
          "空非色外色即是空。空色非一亦非異也。宰割析滅豈是即空。故二乘析色斷見未祛。亂意迷空即真未了。0210b06"
        ],
        [
          653,
          "是以寢疾有不真之談。超日有即虛之稱",
          "雙引二經。皆證前義。初淨名問疾品略云。菩薩病者非真非有等。二超日明三昧經。彼云。不有受不保命四大虛也。四大色法法即空故。0210b10"
        ],
        [
          654,
          "然則三藏殊文統之者一也",
          "文則殊說旨歸一揆。0210b15"
        ],
        [
          655,
          "故放光云。第一真諦無成無得。世俗諦故便有成有得",
          "二依成得以示也。放光第八云。世俗之事有逮有得。最第一者無有逮無有得。0210b17"
        ],
        [
          656,
          "夫有得即是無得之偽號。無得即是有得之真名。真名故雖真而非有。偽號故雖偽而非無",
          "初二句辨得相真偽。住俗有得而非得故偽也。依真無得而乃得故真也。如下玄得中廣示。後四句躡釋前名。0210b21"
        ],
        [
          657,
          "是以言真未嘗有。言偽未嘗無。二言未始一。二理未始殊也",
          "勝義故非有俗諦故非無。有無二言非一。中道之妙非二。0210b26"
        ],
        [
          658,
          "故經云。真諦俗諦謂有異耶。答曰。無異也",
          "義引大品也。前雖有二諦但依成得辨之。今直約二諦以釋也。0210b29"
        ],
        [
          659,
          "此經直辨真諦。以明非有。俗諦以明非無。豈以諦二而二於物哉",
          "二諦之義真俗宛分。二諦之體一物非異。0210c03"
        ],
        [
          660,
          "然則萬物果有其所以。不有有其所以不無。有其所以不有。故雖有而非有。有其所以不無故。雖無而非無。雖無而非無。無者不絕虛。雖有而非有。有者非真有。若有不即真。無不夷(平)跡(相)",
          "初二句明萬物皆具非有非無。次四句躡示兩非。以入中道次四句亦躡前。如次不落斷常。後二句但成前四句。以非真有故。若有不即真。以非虛絕故。若無不夷跡。若字貫此。謂非宰割事跡。然後是無。夷者。亦芟夷也。0210c06"
        ],
        [
          661,
          "然則有無稱異其致一也",
          "真俗是體有無是義。依體辨義。義亦一也。古人云。二諦並非雙。恒乖未曾各。0210c16"
        ],
        [
          662,
          "故童子歎曰。說法不有亦不無。以因緣故諸法生。瓔珞經云。轉法輪者亦非有轉。亦非無轉。是謂轉無所轉",
          "連引二經。依言說相。以顯中道。初即淨名經長者子寶積歎佛偈也。初句歎如來說法。與實相相應故。有說無說皆雙絕也。後句意云。有無既絕。何故現一切言說。答云。以俗諦因緣故諸法生也。後經即彼第十一卷中文。初句牒說。次二句亦有無雙絕。後句明說即無說。二經義同。非轉而轉。三百餘會不捨穿針。轉而不轉。四十九年不說一字。豈謂舌覆三千即成有說。身默丈室便謂無談。0210c19"
        ],
        [
          663,
          "此乃眾經之微言也",
          "雖引二經義同眾典故。云眾經等。0211a02"
        ],
        [
          664,
          "何者。謂物無耶。則邪見非惑。謂物有耶。則常見為得",
          "文通二對反覈以明。皆上句明著下句覈破。邪見斷見也。若計物是無。外道斷見應非是惑。下對例知。物雖通諸且目法輪。0211a04"
        ],
        [
          665,
          "以物非無故。邪見為惑。以物非有故。常見不得",
          "順顯可知。0211a08"
        ],
        [
          666,
          "然則非有非無者。信真諦之談也",
          "真諦第一也。以說法非有非無。方是真諦之轉也。0211a10"
        ],
        [
          667,
          "故道行云。心亦不有亦不無",
          "即彼經初品中文。心為諸法之本。然通真妄。真謂如來藏心亦非有無。如無名論引釋。妄即妄想識心。從緣生者亦非有無。此中辯之。以經義含有二法故不可局。0211a12"
        ],
        [
          668,
          "故中觀云。物從因緣故不有。緣起故不無",
          "義引中論亦轉釋前經也。從緣不有謂真也。緣起不無謂俗也。0211a17"
        ],
        [
          669,
          "尋理即其然矣",
          "推尋論旨法非有無。實乃如是。此以教如繩正理亦衡直。0211a20"
        ],
        [
          670,
          "所以然者。夫有若真有。有自常有。豈待緣而後有哉。譬彼真無。無自常無。豈待緣而後無",
          "初句含二意。一徵辭。二牒不有等。反推諸法正顯從緣。謂法若實有。緣前亦合有。不待緣集然後方有。後三句例明真無二說。一太虛。二真空。此二元空不待緣離然後空也。異喻顯法理亦極成。0211a22"
        ],
        [
          671,
          "若有不能自有。待緣而後有者。故知有非真有。有非真有。雖有不可謂之有矣",
          "初二句順牒前文。明法待緣非真。後二句相躡以顯非有也。0211a29"
        ],
        [
          672,
          "不無者。夫無則湛然不動可謂之無。萬物若無則不應起。起則非無。以明緣起故不無也",
          "初句牒論。次二句舉例。以示如前二空皆凝湛不動。可謂者。堪可許其是無。次二句承例反明。次一句順顯。後二句成前不無也。0211b04"
        ],
        [
          673,
          "故摩訶衍論云。一切諸法一切因緣故應有。一切諸法一切因緣故不應有。一切無法一切因緣故應有。一切有法一切因緣故不應有",
          "大論前後有斯義而無斯文。通成二對。初對中明法從緣故不有不無。初句緣起故不無。後句從緣故不有。後對約有無二法。對辨以明不有不無。一切無法等者。大論三十一。以過未法為無。現在法為有。涅槃三十四云。一切世間有四種無。一未生名無。二滅已名無。三各異互無。四畢竟名無。皆因緣有此四無。後句可知。皆云一切等者。法乃萬殊緣亦無數。0211b09"
        ],
        [
          674,
          "尋此有無之言。豈直反論而已哉。若應有即是有。不應言無。若應無即是無。不應言有",
          "初句收前四句。以前論不出有無故。次句反謂相反。猶云豈但是有無相反之說耶。後通有六句。出論中有無相反之相。前三句中若應有者。收前初三二句。即是有者。定應唯有。不應言無者。收前二四兩句。如何却言無耶。後三句中。若應無者。收前二四兩句。即是無者。定應唯無。不應言有者。收前初三兩句。如何却言有耶。已上辯定相反。下顯緣法有無皆具。謂若有若無俱有其理。非相反也。0211b21"
        ],
        [
          675,
          "言有是為假。有以明非無。借無以辯非有。此事一稱二。其文有似不同。苟領其所同。則無異而不同",
          "初二句論云應有。明緣起故假有也。次一句論云不應有。明從緣故非有也。事一下緣生事一有無名二。四句之文似乖。若解其不有不無之同。豈有無之異能違。0211c03"
        ],
        [
          676,
          "然則萬法果有其所以不有。不可得而有。有其所以不無。不可得而無",
          "義承前起。故云然則。前約二諦已出此文。展轉引釋至此義周。故復舉此以結。不可等者。物性本空孰能強之令有。緣起既形。孰能排之令無。0211c09"
        ],
        [
          677,
          "何則欲言其有有非真生。欲言其無事象既形。象形不即無。非真非實有。然則不真空義顯於茲矣",
          "初有四句。明於諸法不可定執是有是無。皆上句舉執。下句推破。欲謂將欲。言謂意言。將謂諸法定有。邪有非實生。但假緣故如何定有。欲待謂無事象已起。如何定無。次有二句。初句躡前緣起之事。次句結成即假即空。非真假有也。非實真空也。後有二句。正結論名。首建此名以標宗致。逐節引教。隨教會釋。顯理已周中道實相可令悟入。最後結歸不出題示。故云爾也。問論周至此後說何為。答前已通敘其意可了。義若未盡何此結之。可細推繹。0211c14"
        ],
        [
          678,
          "故放光云。諸法假號不真。譬如幻化人。非無幻化人。幻化人非真人也",
          "彼經二十七云。佛告須菩提。名字者不真。假號為名。引此之意已見前文。初法說謂諸法不真。名亦假也。後三句喻明。於中初句經文。次二句義釋也。謂幻成一人似非無也。似豈為真。故云非真。0211c27"
        ],
        [
          679,
          "夫以名求物。物無當名之實。以物求名。名無得物之功。物無當名之實非物也。名無得物之功非名也",
          "此與論初大旨無殊。文小變爾。名自情生好惡何定。或於一物立多名。或以一名召多物。物雖應名。亦無當名之實理。如以地龍木賊等名藥也。又名雖召物。亦無得物之實功。如談水濡唇言穢不涴口。應知名是假號物為幻化。但順世俗不入實相。0212a04"
        ],
        [
          680,
          "是以名不當實。實不當名。名實無當。萬物安在",
          "一切諸法不出名相。此二既空萬物不立。已上名相境寂。下辯妄想心虛。0212a12"
        ],
        [
          681,
          "故中觀云。物無彼此。而人以此為此。以彼為彼。彼亦以此為彼。以彼為此",
          "初句論文。彼論第四云。諸法實相無有此彼。而人下釋也。如二人相向彼此互執也。0212a15"
        ],
        [
          682,
          "此彼莫定乎一名。而惑者懷必然之志。然則彼此初非有。惑者初非無",
          "正舉妄計也。彼此互指既無定在。柰何惑者必然而執我定名此。他定名彼。妄想之心。依然取著。然則下名相元空迷夫妄執。亦可名相無暫始有。妄想無暫始無。以無暫始無之妄情。執無暫始有之名相。病眼花生病耳蟬鳴。蟬花恒無病根常執。0212a19"
        ],
        [
          683,
          "既悟彼此之非有。有何物而可有(執)哉。故知萬物非真假號久矣",
          "初句遍計性空。次句名隨相遣翳差花亡。耳聰蟬喪。後二句結成經義。此中雖帶名相而言。意顯妄執本空。況後引成具等。又唯約妄情說邪。0212a27"
        ],
        [
          684,
          "是以成具立強名之文。園林託指馬之況",
          "成具經云。是法無所有強為其名。園林即漆園也。曹州地名。莊周曾為此吏。故以目之。彼齊物云。以指喻指之非指。不若以非指喻指之非指也。以馬喻馬之非馬。不若以非馬喻馬之非馬也。指謂手指。馬謂戲籌。若今雙六之馬也。如二人相向各以己指是指。他指非指。是非互在本無實也。喻曉也。馬可例之。0212b03"
        ],
        [
          685,
          "如此則深遠之言。於何而不在(具)",
          "通指上文。內教妄想元空。外典是非無主。文亦備在。0212b11"
        ],
        [
          686,
          "是以聖人乘千化而不變。履萬惑而常通者。以其即萬物之自虛。不假虛而虛物也",
          "初句舉能證之聖。令物則之。次二句顯證悟之相。千化名相萬物也。不變者。即名相而如如故。惑妄想也。常通者。即妄想而正智故以其下出即真所以。可知。0212b13"
        ],
        [
          687,
          "故經云。甚奇世尊。不動真際為諸法立處。非離真而立處。立處即真也",
          "初引經。即同放光不動等覺建立諸法。非離下論主釋經義也。謂依理成事。事豈離真而立也。0212b19"
        ],
        [
          688,
          "然則道遠乎哉。觸事而真。聖遠乎哉。體之即神",
          "初二句明境。初句舉體而覈。道謂如如。下句指屬觸謂六觸。事即名相。事相既近。體虛即真。真豈太遠。後二句明心。亦初句舉聖而覈。聖即智也。下句屬體。謂體究神心也。即神者。即我之心為神聖矣。豈太遠乎。仁王經云。菩薩未成佛。以菩提為煩惱。菩薩成佛時。以煩惱為菩提。今詳論意。自放光已下。乃密嚴楞伽五法相翻之義。故密嚴云。名從於相生。相從依他起。此二生分別。諸法性如如。於斯善觀察。是名為正智。名為遍計性。相是依他起。名相二俱遣。是為第一義。略解云。五法者。一名。二相。三妄想。四正智。五如如。此五約迷悟配之。謂迷時即如如。以成名相。即正智以成妄想。悟時翻名相為如如。翻妄想成正智。經中初三句如次名相妄想。次三句說正智。後一偈約三性顯如如也。略示如此。論意謂依彼名相顯示論旨。苟識相等體虛。不捨一論能詮之名所詮之義。即境而會如。即解而成智。故先舉聖人證法為式。然後示以即真之理。但在文甚隱致令難求。若前後冥搜義如指掌。0212b23"
        ]
      ],
      "tag": "文"
    },
    "遵": {
      "col": 0,
      "desc": "X0870 注肇論疏，宋·遵式",
      "name": "X0870_002",
      "notes": [
        [
          344,
          "○不真空論第二",
          "不真者非實也。緣生故物性非實有緣起。故物性非實無以此。而推性非有無。故曰不真也。言空者寂也。由事相不真。以顯性本虗寂故。此則不字是能破智真字是所破執。乃即俗雙破有無也。空字是所顯中道第一義諦也。故中論云。因緣所生法我說即是空不實有也。亦名為假名不定無也。亦名中道義空寂也。又不了緣生者執有執無。或起異見迷於至理。今以不真雙破二執令。即事契理理本自寂。故曰不真空。又前物不遷立俗。即緣法不定無。今明即真顯諸法不實有。二論同時。顯中道理。理本寂滅真俗雙亡故曰空。又物不遷論雙照有無位各住。故不真二字雙遮有無緣不定。故空之一字兩亦雙非契中道故。不真之空能顯所顯故。不真空之論能詮所詮故。皆依主釋。0158a21"
        ],
        [
          345,
          "夫至虗。",
          "至極也虗寂也。理本虗寂乃真極之虗故曰至虗。即中道第一義諦理也。且虗之一言。汎通太虗及待實之虗。今真理絕待離斷滅故曰至虗。又至者到也。推窮物理。極到於寂滅故曰至虗故。諸教指此為真際曰實際曰本源等。皆以到於極故也。0158b14"
        ],
        [
          346,
          "無生。",
          "不從前際生。不向後際滅。中間亦無住故。淨名云。本自不生。今亦無滅是寂滅義。又不從有生不從無生不。即有無生不離有無生。離四句絕百非。理本如此故曰無生。0158b20"
        ],
        [
          347,
          "者。",
          "牒上所宗之理也。0158c01"
        ],
        [
          348,
          "蓋是般若玄鑒之妙趣。",
          "蓋是者指拄之辭也。般若此翻智慧也。鑒照也趣向也。至虗無生是般若照鑒趣向之處。般若為能鑒能趣至虗無生。為所鑒所趣。般若能鑒。鑒而無鑒故曰玄。鑒理為所趣。趣而無趣故曰妙趣。此標不真空論與後論理智為對也。0158c03"
        ],
        [
          349,
          "有物之宗極者也。",
          "萬有為能宗至虗無生為所宗宗之至極。故由真理隨緣有萬物。故此標即俗之真。真不離俗。顯此論與前論理事為對也。此上理智事三智為能照。即事契理為所照。一論大意不過於此。0158c09"
        ],
        [
          350,
          "自非聖明。特達何能契神於有無之間哉。",
          "自非何能者皆倒語也。聖明特達者即般若。是聖人之靈明有挺特通達之照用故。神者不測也。契不測之妙理。即於萬物有無之間自非般若。何有此能此顯至虗唯智所證非情所。及即事契理須假於智。0158c15"
        ],
        [
          351,
          "是以。",
          "承上理由智悟故。0158c21"
        ],
        [
          352,
          "至人。",
          "證極曰至果滿位極示迹人倫唯佛稱之。今寄果人說智故標至人。但能即事契真。皆得至人之智用。不可高推在聖自負己靈。0158c23"
        ],
        [
          353,
          "通神心於無窮。窮所不能滯。",
          "通者無擁也。神心者三解中即靈照心也。窮者推照也。照而無照故曰無窮。下論云。智有窮幽之鑒而無知焉。且至人不測靈照之心。通達在於無照。當照而不滯於照。故曰窮所不能滯。此上明智體下顯照用。0159a03"
        ],
        [
          354,
          "極耳目於視聽聲色。所不能制者。",
          "極耳在於聽聲極目在於視色。而聲色無一可以制礙於耳目者何也。下釋云。0159a09"
        ],
        [
          355,
          "豈不以其即萬物之自虗。故物不能累其神明者也。",
          "累者繫縛也。萬物本虗故靈智照了無一物。可以累縛於智用故。聲色不能制礙也。此乃即體之用照。即事之理。故曰不真空也。0159a12"
        ],
        [
          356,
          "是以聖人。",
          "牒上聖智即事契理也。0159a16"
        ],
        [
          357,
          "乘真心而理順。則無滯而不通。",
          "乘真心者運無照之真智。契無生之真理。理智相符故曰理順理外無事。故智無惑滯不通之處。此釋上通神心於無窮義。0159a18"
        ],
        [
          358,
          "審一氣以觀化。故所遇而順適。",
          "審者諦察也。一氣者語出道書以虗無之道曰一氣。今借語指至虗中道為一氣也。觀化者照萬物從緣而忽有也。適者造詣也聖智了至虗而觀事。則所遇之事皆順於理也。釋上極耳目於視聽。即萬物之自虗也。0159a22"
        ],
        [
          359,
          "無滯而不通。故能混雜致淳。",
          "覆釋理智義混雜淳者。皆和同義致立也。理智相順故智虗無照理虗無生。故能混雜同虗立不二淳和之理。此釋成上理智對顯體同故也。0159b04"
        ],
        [
          360,
          "所遇而順適。故則觸物而一。",
          "覆釋上理事義觸對也。事皆順理則凡觸對物皆同一理。此釋成理事對顯不二故。0159b08"
        ],
        [
          361,
          "如此則。",
          "牒上理事不二之義。0159b11"
        ],
        [
          362,
          "萬象雖殊。而不能自異。",
          "即事顯理也。事雖萬殊皆由理異離理之外事。不能自異也。如水外無波波不能自異。0159b13"
        ],
        [
          363,
          "不能自異。故知象非真象。",
          "萬象無真實由全理隨緣而有故。0159b16"
        ],
        [
          364,
          "象非真象。故則雖象而非象。",
          "事不真而理全現故。雖象而非象觀云如波相虗。令水體露現。故題云不真空理事不二。是當論之本義。0159b18"
        ],
        [
          365,
          "然則物我同根。",
          "物理也我智也。理智體同故。曰同根結上理智對。0159b22"
        ],
        [
          366,
          "是非一氣。",
          "是非者有無事法也。事皆歸理故曰一氣。此上二句述前也。顯至虗無生為般若之玄鑒。又為有物之宗極。下明生後。0159b24"
        ],
        [
          367,
          "潛微幽隱。殆非羣情之所盡。",
          "理在事內曰潛。不可思議曰微。無形無相曰幽。情解不及曰隱。殆者且也。即語詞此明真理潛微。且非羣生情見可盡。0159c04"
        ],
        [
          368,
          "故頃爾談論。",
          "由理非情盡故也。頃爾者向來也。談論者指諸宗立論之者也。0159c09"
        ],
        [
          369,
          "至於虗宗。每有不同。",
          "於此虗宗各有不同之論。0159c12"
        ],
        [
          370,
          "夫以不同而適同。有何物而可同哉。",
          "此則總斥諸宗也。以不同之見。而皆欲造適於同理。理本無異將何可同故。但除異見不必求同下責云。0159c14"
        ],
        [
          371,
          "故眾論競作。而性莫同焉。",
          "由眾論競作。遂令性義多途莫能同焉。所謂多歧則亡羊矣。0159c18"
        ],
        [
          372,
          "何則。",
          "推上何謂眾論競作性莫同耶。0159c21"
        ],
        [
          373,
          "心無者。",
          "康疏云。破晉朝支慜度心無義欲敘。而破故先標也。0159c24"
        ],
        [
          374,
          "無心於萬物。萬物未嘗無。",
          "彼謂。但無心執於萬物。故名即事契理。非謂萬物是無。0160a03"
        ],
        [
          375,
          "此得在於神靜。失在於物虗。",
          "且得心神澄靜。未達萬物本虗存境有心。心豈澄靜。此是一家異見。注云。破支慜度心無義也。0160a06"
        ],
        [
          376,
          "即色者。",
          "下注云。破支道林即色義。康疏云。晉朝支道林立。即色遊玄義此先標也。0160a10"
        ],
        [
          377,
          "明色不自色。故雖色而非色也。",
          "此語出林法師集妙觀章云也。明者指彼所明也。色不自色者。彼明色法須待緣成不是自有之色。雖有緣成之色色非實有故空。故云。雖色而非色彼欲明佛教說色。即空即事顯理也。0160a13"
        ],
        [
          378,
          "夫言色者。",
          "牒彼言色也。0160a18"
        ],
        [
          379,
          "但當色即色。",
          "緣色果色皆是色也。0160a20"
        ],
        [
          380,
          "豈待色色而後為色哉。",
          "豈待緣色合會成果色。然後方為色耶。0160a22"
        ],
        [
          381,
          "此直語色不自色。未領色之非色也。",
          "直但也。此師但說果色不自色達果色空。未領解緣色亦空也。注云。破道林即色義也。0160b01"
        ],
        [
          382,
          "本無者。",
          "下注云破竺法汰本無義亦晉朝人先標也。0160b05"
        ],
        [
          383,
          "情尚於無多。觸言以賓無。",
          "尚好也賓伏也。此師情見偏尚空無多觸對佛教談玄。唯賓伏歸無以無為當此是論主敘彼情見也。下出所見云。0160b07"
        ],
        [
          384,
          "故非有有即無。非無無即無。",
          "由彼見解偏錯。故聞教云。非有乃謂無於有故所以云。非有聞教云。非無乃謂無於無。故所以云非無。此則一向歸無也。0160b11"
        ],
        [
          385,
          "尋夫立文之本旨者。",
          "論主究諸教立非有非無之文本旨。所解不如。此者字牒本旨也。下出意示之云。0160b15"
        ],
        [
          386,
          "直以非有非真有。",
          "但以言非有者萬物緣生非實有故。0160b18"
        ],
        [
          387,
          "非無非真無耳。",
          "言非無者不壞緣相非實無故。0160b20"
        ],
        [
          388,
          "何必非有無此有。非無無彼無。",
          "何必者責詞也。此彼者但指拄之言。非謂分定彼。此何必聞非有。謂無於有聞非無。謂無於無。0160b22"
        ],
        [
          389,
          "此直好無之譚。豈謂順通事實。",
          "此師但是好尚歸無之譚論。豈是順通非有非無之言教。即事契於中道實理。下斥云。0160c02"
        ],
        [
          390,
          "即物之情哉。",
          "捨有著無皆羣物之情執耳。注云。破竺法汰本無我也。此上略明三家異見。各執一端故。使至宗無同異中熾然成異。今為正理惑異。故有論興。亦因異立同耳。理無同異何在言也。故上云。有何物而可同哉。0160c05"
        ],
        [
          391,
          "夫以物物於物。則所物而可物。",
          "以用也。物物者物之名也。於物者對物之相也。用名對相所有之物必可名之也。0160c11"
        ],
        [
          392,
          "以物物非物。故雖物而非物。",
          "以物之名向於無物。雖有物名定無物體如云。兔角有名無體。下明不相到。0160c14"
        ],
        [
          393,
          "是以物不即名而就實。",
          "釋上所物而可物顯體不到名即者是也。就實者得實名也。物不是名故物上不得名之。實詩云。見人空解笑弄物不知名蓋物上無名如嬰兒得物而不能知名。此顯物不到名。0160c17"
        ],
        [
          394,
          "名不即物而履真。",
          "履真者到物實體也。名不是物故名不能到物之真體。如人言火不熱於口。蓋名上無體也。此顯名不到物。0160c22"
        ],
        [
          395,
          "然則真諦獨靜。於名教之外。",
          "世之名物可言可見。尚不相到。況乎真諦非言思所。及獨出於名教之外。豈容言議故下云。0161a02"
        ],
        [
          396,
          "豈曰文言之能辨哉。",
          "此二段之為論主既排諸宗異說。未知正義理合如何。故今汎敘世間名相尚不相到。況出世深理無相無名非言可及下寄之於言詮者。但欲令人解正知邪非謂虗宗言解可到。0161a05"
        ],
        [
          397,
          "然不能杜默。",
          "然者牒上理。雖不可言而世多惑異故。不能杜默絕言論也。0161a10"
        ],
        [
          398,
          "聊復厝言以擬之。試論之曰。",
          "復者重前立論故厝致也。擬者未決之詞。蓋謙云聊致其言擬議試。且論之。0161a13"
        ],
        [
          399,
          "摩訶衍論。",
          "摩訶云大。衍者云乘。0161b02"
        ],
        [
          400,
          "云諸法。",
          "俗諦事法不一故云諸。0161b04"
        ],
        [
          401,
          "亦非有相。亦非無相。",
          "亦者重又之語非唯至虗之理。非有非無俗諦諸法。亦非有無故。又上云。諸法即有無法也。有而非有故云。亦非有無而非無。故云亦非無也。然真非有無者有二義。一無狀無名故非有體用真常故非無。二不可以常見而取故。非有亦不可以斷見而求故。非無今俗諦諸法。亦不有無者。仗緣而生故。非實有不壞緣相故。非實無若了緣生非實有。即知真本無名狀。故不可以常見求。若達緣相非實無即見真體具妙用。故不可以斷見取。今此正明俗諦有無不實。次引中論以顯即真。0161b06"
        ],
        [
          402,
          "中論(中觀論也)云。諸法不有不無者。",
          "牒上俗諦諸法雙非有無故即真諦者。0161b17"
        ],
        [
          403,
          "第一真諦也。",
          "此明真俗不二顯中道妙理絕諸對待不墮數量。故云第一。法鼓經云一亦不為一為。破諸數故。然相宗多明俗諦是有為。則不過有無生滅真諦屬無為。則非有無不生滅未了。即俗是真絕待第一。今此論所宗正為會權入實。所以先推俗諦。後顯真俗不二。又真故不有俗故。不無第一義諦。雙非有無。又俗諦諸法具三句。一有。二無。二亦有無。真諦當第四句非有無真俗相。即則四句同時良以對俗之真。豈越數量。若達不二永絕對待。故云第一。此論所詮不過於此。故標為義宗。0161b19"
        ],
        [
          404,
          "尋夫。",
          "以上衍論言教為量。研窮諸法因緣道理。故云尋夫。0161c08"
        ],
        [
          405,
          "不有不無者。",
          "正牒衍論也。0161c11"
        ],
        [
          406,
          "豈謂滌除萬物。",
          "豈謂者反責之辭。滌除萬物者。泯染淨名相之境也。0161c13"
        ],
        [
          407,
          "杜塞視聽。",
          "杜塞視聽者。絕耳目鑒照之心也。0161c16"
        ],
        [
          408,
          "寂寥虗豁。然後為真諦者乎。",
          "寂兮無聲寥兮無色牒上泯境也。太虗豁爾無知無用牒上泯心也。豈謂泯絕染淨心境諸法。後為不有不無。真諦之義非如此也。0161c18"
        ],
        [
          409,
          "誠以即物順通。故物莫之逆。",
          "誠實也。論之實意即萬物順通。不有不無因緣之理。物不能逆於理也。此推俗諦不有不無。0161c22"
        ],
        [
          410,
          "即偽即真。故性莫之易。",
          "偽假也。真實也。俗諦因緣故假真諦本性自實了。因緣不有不無。即真性不有無故。不待易俗為真此推。即俗之真真諦不有不無也。0162a01"
        ],
        [
          411,
          "性莫之易。故雖無而有。",
          "雖真空常寂而幻有宛然。0162a05"
        ],
        [
          412,
          "物莫之逆。故雖有而無。",
          "雖幻有森然而真空不隱。0162a07"
        ],
        [
          413,
          "雖有而無。所謂非有。",
          "幻有即真空真性湛寂。故同一非有。0162a09"
        ],
        [
          414,
          "雖無而有。所謂非無。",
          "真空不礙有真性常住。故同一非無此上明即俗之真。不有不無之義已顯。0162a11"
        ],
        [
          415,
          "如此則(隨上所推)非無物也。",
          "不壞緣相故上云亦非無也。0162a14"
        ],
        [
          416,
          "物非真物。",
          "緣生非真故。上云亦非有也。0162a16"
        ],
        [
          417,
          "物非真物。故於何而可物。",
          "但由俗諦非真以觀萬物物何可有。故前衍論。即諸法不有不無。以顯真諦之理也。0162a18"
        ],
        [
          418,
          "故經云。色之性空非色敗空。",
          "秦譯淨名云。喜見菩薩曰色。色空為二色之性。空非色滅空色性自空。今引以證成也。敗者滅也。色性緣生故空非有也。非待色滅見空。故非無也。下自釋經意云。0162a21"
        ],
        [
          419,
          "以明夫聖人之於物也。",
          "以用也明證信也之向也。用上經義證知聖人向對萬物之智也。向之如何下云。0162b02"
        ],
        [
          420,
          "即萬物之自虗。",
          "了緣生本自虗。故亦非有也釋上色之性空。0162b05"
        ],
        [
          421,
          "豈待宰割以求通哉。",
          "宰者治也制也。皆取折伏為義割截也斷也。皆去除義。他宗所說多用比觀伏惑現觀斷惑。故宰伏斷割惑妄方曰證真。今實教。即物顯理豈待如此也。既非除物見真。故亦非無也。釋上非色敗空。0162b07"
        ],
        [
          422,
          "是以寢疾。有不真之譚。",
          "寢疾者淨名示疾於毗耶離城獨寢一牀。問疾品云。眾生病非真非實有菩薩病。示非真非實有。良以眾生緣空病。豈真實大悲示現。豈真實哉。0162b12"
        ],
        [
          423,
          "超日有即虗之稱。",
          "超日明三昧經云。不保命四大虗稱者言也。亦有即四大而見虗之言。已上三經同證俗諦非實有無。0162b16"
        ],
        [
          424,
          "然則三藏殊文。統之者一也。",
          "結上引意也。經律論曰三藏。上雖略引二經三文。以明緣性非實有無實。則盡三藏之文凡言緣性皆同此理。蓋以不有不無之理。統三藏之文為一故也。0162b20"
        ],
        [
          425,
          "故放光云。第一真諦無成無得。",
          "此引放光釋上中。論所明第一義諦。真俗絕待以為第一。今引放光經以第一真諦對俗。而論者良由說。則不過二諦為門第一真諦非言所及故。前中論雖云第一真諦但就。即俗明真以顯第一真諦故。今重引經標欲推不二之深旨。無成者成菩提也。無得者得涅槃也。理智二果真諦不立故。此即真諦不有也。0162c01"
        ],
        [
          426,
          "世俗諦故。便有成有得。",
          "成正覺證真常俗諦之中二果顯然。俗諦不無也。0162c09"
        ],
        [
          427,
          "夫有得。即是無得之偽號。",
          "有得意兼有成俗諦。言有得真諦談無得。俗無自體。全真立俗。故有得是真中之假號。如即水之波波假也。0162c12"
        ],
        [
          428,
          "無得。即是有得之真名。",
          "真諦言無得。是即俗之真。真理自實故。無得是即俗之真名。如即波之水水真。0162c16"
        ],
        [
          429,
          "真名故。雖真而非有。偽號故。雖偽而非無。",
          "真定不有俗定不無。0162c19"
        ],
        [
          430,
          "是以言真未甞有言偽未甞無。",
          "述上對俗之真。故前論云諸法不有不無也。0162c21"
        ],
        [
          431,
          "二言未始一。",
          "在言說為門不同。故本不一。0162c23"
        ],
        [
          432,
          "二理未始殊。",
          "真俗不二證之。則木自不殊也。不二之理。即強名第一真諦也。所以即俗之真絕諸對待。故名第一也。0163a01"
        ],
        [
          433,
          "故經云(大品般若經)真諦俗諦謂有異耶。答曰無異也。",
          "據門間。異約理。答不異此證上二理未始殊。0163a05"
        ],
        [
          434,
          "此經直辨真諦以明非有。俗諦以明非無。",
          "此經之言意可通二。一則指前放光。又可指上大品問異也。0163a07"
        ],
        [
          435,
          "豈以諦二而二於物哉。",
          "物則理也。諦門雖二理不可二也。故經答曰無異也。0163a10"
        ],
        [
          436,
          "然則(承上之辭)萬物(俗諦事法)果有其所以不有。",
          "果決也。推萬法緣性果決有不有之義。0163a13"
        ],
        [
          437,
          "有其所以不無。",
          "緣性又亦果。決有不無之理。0163a15"
        ],
        [
          438,
          "有其所以不有。故雖有而非有。",
          "幻有非實有。0163a17"
        ],
        [
          439,
          "有其所以不無。故雖無而非無。",
          "性空非實無。0163a19"
        ],
        [
          440,
          "雖無而非無。無者不絕虗。",
          "性空之無非斷絕太虗無也。0163a21"
        ],
        [
          441,
          "雖有而非有。有者非真有。",
          "緣會之有非謂真常有也。0163a23"
        ],
        [
          442,
          "若有不即真。無不夷跡。",
          "夷者平除也。跡謂蹤迹有不常有。故不有無不除迹。故不無。0163b01"
        ],
        [
          443,
          "然則有無稱異。其致一也。",
          "說緣性有無。則似異有即不有。故無無即不無故有有無不二之理。不殊不殊之理。即第一義諦故曰不真空。0163b04"
        ],
        [
          444,
          "故童子歎曰。說法不有。亦不無。以因緣故。諸法生。",
          "淨名經寶積童子歎佛。善說諸法。由因緣生故性非有無也。此則推緣會顯性空也。0163b08"
        ],
        [
          445,
          "瓔珞經云。轉法輪者。亦非有轉。亦非無轉。",
          "彼經云。諸法如空故亦無有轉亦無無轉車輪有用轉之。則運動摧輾聖人法門有用說之。則破惑出塵故。曰轉法輪者牒也。說者受者及中間名句文義。皆從如來大悲心。及眾生善根緣上。而起緣性皆空。故非實有無也。0163b11"
        ],
        [
          446,
          "是謂轉無所轉。",
          "結也。俗諦云轉。即俗之真。則無所轉。0163b17"
        ],
        [
          447,
          "此乃眾經之微言也。",
          "此即真之義。乃為眾經言之微妙也。微妙故不可以有無得矣。0163b19"
        ],
        [
          448,
          "何者(推也)謂物無耶。則邪見非惑。",
          "此先逆說無也。邪見者正理之外起見偏滯斷滅物。若定無邪見執無。則非為迷惑。0163b22"
        ],
        [
          449,
          "謂物有耶。則常見為得。",
          "逆說有也常見者。執諸法常住起見偏滯實有物。若定有常見執有。乃得正理下順顯非有無。0163c01"
        ],
        [
          450,
          "以物非無。故邪見為惑。以物非有。故常見不得。",
          "由萬物緣性。定非有無非二見所了。故執有無者。迷惑正道也。0163c04"
        ],
        [
          451,
          "然則非有非無者。信真諦之談也。",
          "既談真實諦理。故不可以有無所議。乃曰非有非無。是謂言之微妙也。0163c07"
        ],
        [
          452,
          "故道行云。心。",
          "俗諦緣生之心。通凡聖皆靈照故。0163c16"
        ],
        [
          453,
          "亦不有亦不無。",
          "重又曰。亦非但第一義諦。非有無俗諦緣生之心。亦不有無故。又有而不有無而不無。故云亦也。然夫真心本非有無不可以因緣推釋。非今所明。今正明俗諦。聖凡緣生之心耳。聖心者隨緣而有。故不有感而常應故。不無凡心者因境而有故。不有對境。則起故不無。是知俗諦聖凡二心。皆由緣故非實有無。即顯真諦門中聖凡有無之心。俱絕。又即俗而真則聖凡不有即真而俗故。聖凡不無真俗不二。即顯第一義諦。雙絕有無也。0163c18"
        ],
        [
          454,
          "中觀云。物從因緣故不有。緣起故不無。",
          "引論推因緣以標不有無之。所以然因緣之義佛教咸宗。但隨事推求離因緣。而成未之有也。但親起者曰因。助生者為緣如穀子為因。水土人時為緣。故得禾苗成穗。聖人以大悲大願為因。眾生善根為緣。故有應化心生。眾生以無明為因。境界為緣故。有取著心生。若本覺為因。師教為緣。則有了悟心生。故俗諦中凡聖迷悟。若心若境。皆由緣有。故不真有緣起。故不定無達。此緣性了然。即真真俗既融一理斯顯故。今言物通心及境也。0164a04"
        ],
        [
          455,
          "尋理即其然矣。",
          "究尋諸法由因緣故。不有不無道理。即當如此。0164a15"
        ],
        [
          456,
          "所以然者。",
          "牒上尋理之所以也。0164a19"
        ],
        [
          457,
          "夫有若真有。有自常有。豈待緣而後有哉。",
          "心境若實決定常有何待緣會而有。0164a21"
        ],
        [
          458,
          "譬彼真無。無自常無。豈待緣而後無。",
          "真無有二。一太虗斷滅實定常無。二真心虗寂究竟凝然。此二無雖藉緣顯不假緣成。今引此實無以喻緣有之不實有也。此上法喻逆說下順明不有。0164a23"
        ],
        [
          459,
          "若有不能自有。待緣而後有者。故知有非真有。",
          "假待於緣定非實有義甚可見。0164b04"
        ],
        [
          460,
          "有非真有。雖有不可。謂之有矣。",
          "結心境有而不有之義故上曰物從因緣故不有。0164b06"
        ],
        [
          461,
          "不無者。",
          "牒上緣起故不無。0164b09"
        ],
        [
          462,
          "夫無。則湛然不動。可謂之無。",
          "湛然者水澄停貌也。動者改轉義心境。若定無則澄湛凝然。更不改轉其猶太虗。永無移易可以謂之無也。0164b11"
        ],
        [
          463,
          "萬物若無。則不應起。",
          "萬物者心境也。應當也。若決定無者不當從緣而起也。此上逆推向下順顯。0164b15"
        ],
        [
          464,
          "起則非無。",
          "心則違緣起瞋順緣起貪迷緣起癡乃至善友緣。則起善惡友緣。則起惡非無心也。境則各各從緣和合。而有故非無境。又心境互為緣起故非無。0164b18"
        ],
        [
          465,
          "以明緣起。故不無也。",
          "結無而不無義。故上云緣起故不無也。0164b22"
        ],
        [
          466,
          "故摩訶衍論云。",
          "此下有四句。前二句明緣生。故有緣假故無。後二句即無顯不無。即有明不有引證。前文大意如此。0164c01"
        ],
        [
          467,
          "一切諸法。一切因緣。故應有。",
          "從緣而生緣會應有即假有也。0164c04"
        ],
        [
          468,
          "一切諸法。一切因緣。故不應有。",
          "既由緣有故不實有即空無也。此上二句推求因緣法。幻有空無也。0164c06"
        ],
        [
          469,
          "一切無法。一切因緣。故應有。",
          "緣假之無不壞性相常有。故前云。以明緣起故不無等。此即就次句言無以明不無也。0164c09"
        ],
        [
          470,
          "一切有法。一切因緣。故不應有。",
          "緣生之有本非實有。故前云。雖有不可謂之有等。此即就初句言有以明不有。0164c12"
        ],
        [
          471,
          "尋此有無之言。豈直反論而已哉。",
          "恐謂大論但將有遣無將無遣有秪破二邊非別有理。故特釋之言。尋此有無之言者前。初句說有末句說無。第二句說無。第三說有。今推尋之非謂。但欲反其議論有無互破而已。0164c15"
        ],
        [
          472,
          "若應有。(法若定有)即是有。",
          "大論秖說第一句應有。0164c20"
        ],
        [
          473,
          "不應言無。",
          "不當說第四句不應有也。0164c22"
        ],
        [
          474,
          "若應無。(法若定無)即是無。",
          "大論秖說第二句不應有。0164c24"
        ],
        [
          475,
          "不應言有。",
          "不當說第三句應有此上逆說下順明。0165a02"
        ],
        [
          476,
          "言有是為(平呼作也)假有以明非無。",
          "第三句言有是假作。此說欲以明第二句中。無非斷無故。0165a04"
        ],
        [
          477,
          "借無以辨非有。",
          "第四句借無之言以辨。初句中有非實有。故知因緣心境有非實有無非斷無大論。故立四句也。0165a07"
        ],
        [
          478,
          "此事一。",
          "一切事法以四句不二。一義貫之皆中道也。0165a11"
        ],
        [
          479,
          "稱二(有不有無不無)其文有似不同。",
          "四句異而意不異。故云似不同。0165a13"
        ],
        [
          480,
          "苟領其所同。則無異而不同。",
          "若知萬法皆同緣性。則無有殊異而不同歸一理也。中論云。因緣所生法我說即是空亦謂是假名。亦名中道義則空假中。三不離因緣為門。故無異而不同也。0165a15"
        ],
        [
          481,
          "然則。",
          "承上所推宗義道理。0165a20"
        ],
        [
          482,
          "萬法(心境下一)果有其所以。不有不可得而有。",
          "果然由因緣有。而不實有欲謂之有必無。此理定不可得。0165a22"
        ],
        [
          483,
          "有其所以。不無不可得而無。",
          "但翻上也。緣起性相欲謂之無理亦不可得此中。但明因緣故。不有無即真之義已。在前段比校前文意多如此。故知前則意高。此則意細耳。0165b01"
        ],
        [
          484,
          "何則。",
          "推上不可得而有無。0165b06"
        ],
        [
          485,
          "欲言其有。有非真生。",
          "仗因緣故非真也。0165b08"
        ],
        [
          486,
          "欲言其無。事象既形。",
          "既形者已現也。緣起則心境事象已現也。0165b10"
        ],
        [
          487,
          "象形不即無。",
          "無而不無。0165b12"
        ],
        [
          488,
          "非真非實有。",
          "有而不有。0165b14"
        ],
        [
          489,
          "然則不真空義。顯於茲矣。",
          "由上推之則因緣性相不實有無。有無雙寂之義顯於此也。故題曰不真空然緣法。不有無。即顯性空義。若有無雙寂即顯第一義諦。乃法性實相之義。但境智未亡。故未及本無之義。0165b16"
        ],
        [
          490,
          "故放光云。諸法假號不真。",
          "俗諦諸法由住情見故。有名有體情本虗妄。故名號假立體不真實名之。與體情有理無下舉喻。0165c02"
        ],
        [
          491,
          "譬如幻化人。",
          "幻者不實而有結巾艸以為兔馬仗物假術於實起虗。蓋惑愚目耳化者。無而忽有也。人者所幻人也。幻術化成男女。則名相宛然妄情執法見有名體。則以幻術喻妄情化人。名相喻諸法名體也。0165c05"
        ],
        [
          492,
          "非無幻化人。",
          "在幻術中無而忽有名相宛然眾生。在迷諸法名體宛爾差殊。0165c10"
        ],
        [
          493,
          "幻化人非真人也。",
          "若知人由幻術而有則名相全空若悟法因迷執。而興則知名體虗假。達因緣者。即假以會真迷因緣者。執名而著相引經立義正責迷情然。此段經古科連上以為引證。義亦可通。今謂正顯名體不實理順後段故。今科歸下文為下之標義。於理甚便。0165c13"
        ],
        [
          494,
          "夫以名求物。物無當名之責。",
          "以用也當是也。用名推求於物而體上定無是名之真實。若以物體是名者。則一切物體皆同音聲文字。此則用名求見體不實矣。0165c20"
        ],
        [
          495,
          "以物求名。名無得物之功。",
          "又用物推求於名名上定無得物之功用名中。若得體一切火。名皆須炎熱。故知火名定不得火體。此用體求見名號假也。0165c24"
        ],
        [
          496,
          "物無當名之實。非物也。",
          "因求物不是名。則知物是妄執非實物也。0166a04"
        ],
        [
          497,
          "名無得物之功。非名也。",
          "又由名不是物。則知名亦虗妄非實名也。故圭山云色是虗名虗相。無纖毫之體故。即真空也。0166a06"
        ],
        [
          498,
          "是以名不當實。實不當名。名實無當。萬物安在。",
          "安何也。俗諦萬物不過名體。既不相是即知同空空。故何在以是義。故前明俗諦因緣。即真良由諸法名體。但離妄緣即如如矣。0166a10"
        ],
        [
          499,
          "故中觀云。物無彼此。",
          "恐疑者。云一切物皆可名召何謂名無得物之功耶。故今引文釋之。萬物體上本無虗名也。名有千差且舉彼此一端為。例釋之。0166a15"
        ],
        [
          500,
          "而人以此為此。以彼為彼。",
          "如東方有惑人以東。為此以西為彼。0166a19"
        ],
        [
          501,
          "彼亦以此為彼。以彼為此。",
          "彼者西方人也。却以東為彼西為此適。此今曰彼適彼今曰此也。0166a21"
        ],
        [
          502,
          "此彼莫定乎。一名而惑者。懷必然之志。",
          "由二人各執。故此彼之名不定也。在惑者所見而起必定之心。則知名由執有也。0166a24"
        ],
        [
          503,
          "然則彼此初非有。惑者初非無。",
          "初者本來義彼此之名物上本來不有。若以惑者所執。則本來不無。故知物上無名。名不是物但由情惑假立虗名惑本自空名。豈真實。故上曰名無得物之功也。0166b03"
        ],
        [
          504,
          "既悟彼此之非有。",
          "由上已達名空以為能例。0166b08"
        ],
        [
          505,
          "有何物而可有哉。",
          "例知彼此之物體離執。亦何有也。故上云。物無當名之實非物也。以彼此名體轉例萬物云。0166b10"
        ],
        [
          506,
          "故知萬物非真(體假)假號(名假)久矣。",
          "從來迷惑故。執假名虗體久矣。此結歸上放光宗義也。0166b13"
        ],
        [
          507,
          "是以成具立強名之文。",
          "彼云是法無所有強。謂其名證上名假。0166b16"
        ],
        [
          508,
          "園林託指馬之況。",
          "此借莊子意。康疏云。莊子曾為漆園吏故曰園林。指馬之。況者齊物篇云。以指喻指之非指不。若以非指喻指之非指以馬喻。馬之非馬不。若以非馬喻馬之非馬。音義云。指百體之一體馬。萬物之一物。則且各舉一以言之。且夫是非彼。此百體萬物一一有之。莊子。唯明齊物是則皆是非。則皆非。此蓋自然之理。故天地一指萬物。一馬今借之以況彼。此是非之體。皆由人執以證上體不真。0166b18"
        ],
        [
          509,
          "如此則深遠之言。於何而不在。",
          "結上所引經書。皆顯名體不實。此深遠言論何所不在。0166c03"
        ],
        [
          510,
          "是以聖人乘千化而不變。履萬惑而常通。",
          "通達名體即事證真故曰聖人也乘運也。悲願身土雖運化千端即事之真而真常不變履踐也。惑者癡昧之心。心事不一故言萬惑聖人。雖居處履踐於塵事。而常通達於玄微。淨名云。若菩薩行於非道。是謂通達佛道。0166c06"
        ],
        [
          511,
          "者。",
          "牒上二句下釋所以。0166c12"
        ],
        [
          512,
          "以其即萬物之自虗。",
          "即事而真物本自虗聖人證此故。0166c14"
        ],
        [
          513,
          "不假虗而虗物也。",
          "破權小也。不能即事而真者須假觀慧推析滅事證真二乘。則灰滅身智方曰無餘。權宗則斷盡實惑。乃曰涅槃。今正簡異故。曰不假也。0166c16"
        ],
        [
          514,
          "故經云。甚奇世尊。",
          "大品經空生歎佛也。0166c21"
        ],
        [
          515,
          "不動真際。",
          "真理是萬法之源窮事見理乃為際畔。故立強名曰真際。不動者不離也。0166c23"
        ],
        [
          516,
          "為諸法立處。",
          "真理為諸法建立之處。0167a02"
        ],
        [
          517,
          "非離真而立處。立處即真也。",
          "建立萬法之處。即是真理故。處千化而不變履萬惑而常通也。上則即真而俗。此則即俗而真聖人證。此豈為名體所惑耶。0167a04"
        ],
        [
          518,
          "然則(承上立處即真)道遠乎哉。觸事而真。",
          "道者可履可向。即所照之理曰道遠乎哉。蓋言不遠也。凡觸物皆真。此結上理事不二。0167a08"
        ],
        [
          519,
          "聖遠乎哉。體之即神。",
          "聖者能證之人體者證也。神者不測之智用也。聖智亦不遠既即俗證真即不測之聖智也。此結上人法不異。又此結文通結歸前由至虗無生為有物之宗故。觸事而真至虗無生。為般若玄鑒之妙趣。故體之即神又觸事而真故。結前二論。真俗不二故。體之即神生後般若無知。已上釋不真空論竟。0167a11"
        ]
      ],
      "tag": "遵"
    }
  }
}