{
  "html": [
    "<div id=\"body0\">",
    "\t<p id=\"p18\" data-head-level=\"2\" class=\"head\">般若無知論第三</p>",
    "\t<p id=\"p19\">夫般若虛玄者，蓋是三乘之宗極也。誠真一之無差，然異端之論，紛然久矣。有天竺沙門鳩摩羅什者，少踐大方，研機斯趣。獨拔於言象之表，妙契於希夷之境；齊異學於迦夷，揚湻風於東扇。將爰燭殊方而匿糴涼土者，所以道不虛應，應必有由矣。弘始三年，歲次星紀，秦乘入國之謀，舉師以來之意也。北天之運，數其然也。</p>",
    "\t<p id=\"p19a\">大秦天王者，道契百王之端，德洽千載之下，游刃萬機，弘道終日，信季俗蒼生之所天，釋迦遺法之所仗也。時乃集義學沙門五百餘人於逍遙觀，躬執秦文，與什公參定方等。其所開拓者，豈謂當時之益，乃累劫之津梁矣。余以短乏，曾廁嘉會，以為上聞異要，始於時也。然則聖智幽微，深隱難測。無相無名，乃非言象之所得。為試罔象其懷，寄之狂言耳，豈曰聖心而可辨哉！試論之曰：</p>",
    "\t<p id=\"p20\">《放光》云：「般若無所有相，無生滅相。」《道行》云：「般若無所知、無所見。」此辨智照之用，而曰無相、無知者，何耶？果有無相之知、不知之照，明矣。何者？夫有所知，則有所不知。以聖心無知，故無所不知。不知之知，乃曰一切知。故經云：「聖心無所知，無所不知。」信矣！是以聖人虛其心而實其照，終日知而未嘗知也。故能默耀韜光虛心玄鑒，閉智塞聰而獨覺冥冥者矣。</p>",
    "\t<p id=\"p20a\">然則智有窮幽之鑒而無知焉，神有應會之用而無慮焉。神無慮，故能獨王於世表；智無知，故能玄照於事外。智雖事外，未始無事；神雖世表，終日域中。所以俯仰順化應接無窮，無幽不察而無照功。斯則無知之所知，聖神之所會也。然其為物也，實而不有、虛而不無。存而不可論者，其唯聖智乎。何者？欲言其有，無狀無名；欲言其無，聖以之靈。聖以之靈，故虛不失照；無狀無名，故照不失虛。照不失虛，故混而不渝；虛不失照，故動以接麁。是以聖智之用，未始暫廢；求之形相，未暫可得。故《寶積》曰：「以無心意而現行。」《放光》云：「不動等覺而建立諸法。」所以聖迹萬端，其致一而已矣。是以般若可虛而照，真諦可亡而知，萬動可即而靜，聖應可無而為。斯則不知而自知，不為而自為矣！復何知哉？復何為哉？</p>",
    "\t<p id=\"p21\"><s>難曰：夫聖人真心獨朗，物物斯照；應接無方，動與事會。物物斯照，故知無所遺；動與事會，故會不失機。會不失機，故必有會於可會；知無所遺，故必有知於可知。必有知於可知，故聖不虛知；必有會於可會；故聖不虛會。既知既會，而曰無知無會者。何耶？若夫忘知遺會者，則是聖人無私於知會，以成其私耳。斯可謂不自有其知，安得無知哉？</s><sup title='依《御選語錄》標記刪除，下同'>*</sup></p>",
    "\t<p id=\"p22\"><s>答曰：</s>夫聖人功高二儀而不仁，明逾日月而彌昏<s>，豈曰木石瞽其懷？其於無知而已哉</s>。<s>誠以異於人者神明，故不可以事相求之耳。子意欲令聖人不自有其知，而聖人未嘗不有知，無乃乖於聖心、失於文旨者乎！何者？經云：「真般若者，清淨如虛空，無知無見，無作無緣。」斯則知自無知矣，豈待返照然後無知哉？若有知性空而稱淨者，則不辨於惑智，三毒四倒亦皆清淨，有何獨尊於般若？若以所知美般若，所知非般若，所知自常淨，故般若未嘗淨，亦無緣致淨歎於般若。然經云「般若清淨」者，將無以般若體性真淨，本無惑取之知。本無惑取之知，不可以知名哉。豈唯無知名無知，知自無知矣！是以聖人</s>以無知之般若，照彼無相之真諦。真諦無兔馬之遺，般若無不窮之鑒，所以會而不差、當而無是。<s>寂怕、無知，而無不知者矣。</s></p>",
    "\t<p id=\"p23\"><s>難曰：夫物無以自通，故立名以通物。物雖非名，果有可名之物當於此名矣。是以即名求物，物不能隱。而論云「聖心無知」，又云「無所不知」。意謂無知未嘗知，知未嘗無知。斯則名教之所通，立言之本意也。然論者欲一於聖心，異於文旨。尋文求實，未見其當。何者？若知得於聖心，無知無所辨；若無知得於聖心，知亦無所辨；若二都無得，無所復論哉！</s></p>",
    "\t<p id=\"p24\"><s>答曰：</s>經云：「般若義者，無名無說，非有非無，非實非虛。」虛不失照，照不失虛，斯則無名之法，故非言所能言也。言雖不能言，然非言無以傳，是以聖人終日言而未嘗言也。<s>今試為子狂言辨之。</s>夫聖心者，微妙無相，不可為有；用之彌勤，不可為無。不可為無，故聖智存焉；不可為有，故名教絕焉。是以言知不為知，欲以通其鑒；不知非不知，欲以辨其相。辨相，不為無；通鑒，不為有。非有，故知而無知；非無；故無知而知。是以知即無知，無知即知。<s>無以言異而異於聖心也。</s></p>",
    "\t<p id=\"p25\"><s>難曰：夫真諦深玄，非智不測。聖智之能，在茲而顯。故經云：「不得般若，不見真諦。」真諦，則般若之緣也。以緣求智，智則知矣。</s></p>",
    "\t<p id=\"p26\"><s>答曰：以緣求智，智非知也。何者？放光云：「不緣色生識，是名不見色。」又云：「五陰清淨故，般若清淨。」般若即能知也，五陰即所知也。所知，即緣也。夫知與所知，相與而有、相與而無。相與而無，故物莫之有；相與而有，故物莫之無。物莫之無，故為緣之所起；物莫之有，故則緣所不能生。緣所不能生，故照緣而非知；為緣之所起，故知、緣相因而生。是以知與無知，生於所知矣。何者？夫智以知所知，取相故名知。真諦自無相，真智何由知？所以然者，夫所知非所知，所知生於知；所知既生知，知亦生所知。所、知既相生，相生即緣法，緣法故非真。非真，故非真諦也。故《中觀》云：「物從因緣有，故不真。不從因緣有，故即真。」今真諦曰真，真則非緣。真非緣，故無物從緣而生也。故經云：「不見有法無緣而生。」是以真智觀真諦，未嘗取所知。智不取所知，此智何由知？然智非無知，但真諦非所知，故真智亦非知。而子欲以緣求智，故以智為知。緣自非緣，於何而求知？</s></p>",
    "\t<p id=\"p27\"><s>難曰：論云「不取」者，為無知故不取？為知然後不取耶？若無知故不取，聖人則冥若夜游，不辨緇素之異耶！若知然後不取，知則異於不取矣！</s></p>",
    "\t<p id=\"p28\"><s>答曰：非無知，故不取；又非知，然後不取。知即不取，故能不取而知。</s></p>",
    "\t<p id=\"p29\"><s>難曰：論云「不取」者，誠以聖心不物於物，故無惑取也。無取則無是，無是則無當。誰當聖心，而云聖心無所不知耶？</s></p>",
    "\t<p id=\"p30\"><s>答曰：然。無是、無當者。夫無當，則物無不當；無是；則物無不是。物無不是，故是而無是；物無不當，故當而無當。故經云：「盡見諸法而無所見。」</s></p>",
    "\t<p id=\"p31\"><s>難曰：聖心非不能是，誠以無是可是。雖無是可是，故當是於無是矣。是以經云「真諦無相故般若無知」者，誠以般若無有有相之知。若以無相為無相，有何累於真諦耶？</s></p>",
    "\t<p id=\"p32\"><s>答曰：</s>聖人無無相也。何者？若以無相為無相，無相即為相。捨有而之無，譬猶逃峰而赴<span class=\"gaiji\" data-gid=\"CB05145\">壑</span>，俱不免於患矣。是以至人處有而不有，居無而不無。雖不取於有無，然亦不捨於有無。所以和光同塵<sup title=\"大正藏為「塵勞」\">*</sup>，周旋五趣，寂然而往，泊<sup title=\"大正藏為「怕」\">*</sup>爾而來，恬淡無為而無不為。</p>",
    "\t<p id=\"p33\"><s>難曰：聖心雖無知，然其應會之道不差。是以可應者應之，不可應者存之。然則聖心有時而生、有時而滅。可得然乎？</s></p>",
    "\t<p id=\"p34\"><s>答曰：生滅者，生滅心也。聖人無心，生滅焉起？</s>然非無心，但是無心心耳；又非不應，但是不應應耳。<s>是以聖人應會之道，則信若四時之質。直以虛無為體，斯不可得而生、不可得而滅也。</s></p>",
    "\t<p id=\"p35\"><s>難曰：聖智之無、惑智之無，俱無生滅。何以異之？</s></p>",
    "\t<p id=\"p36\"><s>答曰：聖智之無者，無知；惑智之無者，知無。其無雖同，所以無者，異也。何者？夫聖心虛靜，無知可無，可曰無知，非謂知無。惑智有知，故有知可無，可謂知無，非曰無知也。無知，即般若之無也；知無，即真諦之無也。</s>是以般若之與真諦，言用，即同而異；言寂，即異而同。同，故無心於彼此；異，故不失於照功。是以辨同者同於異，辨異者異於同，斯則不可得而異、不可得而同也。何者？內有獨鑒之明，外有萬法之實。萬法雖實，然非照不得。內外相與以成其照功，此則聖所不能同；用也。內雖照而無知，外雖實而無相。內外寂然，相與俱無，此則聖所不能異；寂也。是以經云「諸法不異」者，豈曰續鳧截鶴、夷嶽盈<span class=\"gaiji\" data-gid=\"CB05145\">壑</span>，然後無異哉？誠以不異於異，故雖異而不異也。故經云：「甚奇，世尊！於無異法中而說諸法異。」又云：「般若與諸法，亦不一相，亦不異相。」信矣。</p>",
    "\t<p id=\"p37\"><s>難曰：論云「言用則異，言寂則同。」未詳般若之內，則有用寂之異乎？</s><sup title='依《御選語錄》標記刪除'>*</sup></p>",
    "\t<p id=\"p38\"><s>答曰：用即寂、寂即用，用寂體一，同出而異名；更無無用之寂而主於用也。是以智彌昧，照逾明；神彌靜，應逾動。豈曰明昧動靜之異哉？故《成具》云：「不為而過為。」《寶積》曰：「無心無識，無不覺知。」斯則窮神盡智，極象外之談也。即之明文，聖心可知矣。</s></p>",
    "\t<p id=\"p39\" class=\"juan-end\">般若無知論<span class=\"doube-line-note\">終</span></p>",
    "</div>"
  ],
  "html_org": [
    [
      "<div id='body0'>",
      "<p id='p18' data-head-level=\"2\" class=\"head\">般若無知論第三</p>",
      "<p id='p19'>夫般若虛玄者，蓋是三乘之宗極也。誠真一之無差，然異端之論，紛然久矣。有天竺沙門鳩摩羅什者，少踐大方，研機斯趣。獨拔於言象之表，妙契於希夷之境；齊異學於迦夷，揚湻風於東扇。將爰燭殊方而匿糴涼土者，所以道不虛應，應必有由矣。弘始三年，歲次星紀，秦乘入國之謀，舉師以來之意也。北天之運，數其然也。大秦天王者，道契百王之端，德洽千載之下，游刃萬機，弘道終日，信季俗蒼生之所天，釋迦遺法之所仗也。時乃集義學沙門五百餘人於逍遙觀，躬執秦文，與什公參定方等。其所開拓者，豈謂當時之益，乃累劫之津梁矣。余以短乏，曾廁嘉會，以為上聞異要，始於時也。然則聖智幽微，深隱難測。無相無名，乃非言象之所得。為試罔象其懷，寄之狂言耳，豈曰聖心而可辨哉！試論之曰：</p>",
      "<p id='p20'>《放光》云：「般若無所有相，無生滅相。」《道行》云：「般若無所知、無所見。」此辨智照之用，而曰無相、無知者，何耶？果有無相之知、不知之照，明矣。何者？夫有所知，則有所不知。以聖心無知，故無所不知。不知之知，乃曰一切知。故經云：「聖心無所知，無所不知。」信矣！是以聖人虛其心而實其照，終日知而未嘗知也。故能默耀韜光虛心玄鑒，閉智塞聰而獨覺冥冥者矣。然則智有窮幽之鑒而無知焉，神有應會之用而無慮焉。神無慮，故能獨王於世表；智無知，故能玄照於事外。智雖事外，未始無事；神雖世表，終日域中。所以俯仰順化應接無窮，無幽不察而無照功。斯則無知之所知，聖神之所會也。然其為物也，實而不有、虛而不無。存而不可論者，其唯聖智乎。何者？欲言其有，無狀無名；欲言其無，聖以之靈。聖以之靈，故虛不失照；無狀無名，故照不失虛。照不失虛，故混而不渝；虛不失照，故動以接麁。是以聖智之用，未始暫廢；求之形相，未暫可得。故《寶積》曰：「以無心意而現行。」《放光》云：「不動等覺而建立諸法。」所以聖迹萬端，其致一而已矣。是以般若可虛而照，真諦可亡而知，萬動可即而靜，聖應可無而為。斯則不知而自知，不為而自為矣！復何知哉？復何為哉？</p>",
      "<p id='p21'>難曰：夫聖人真心獨朗，物物斯照；應接無方，動與事會。物物斯照，故知無所遺；動與事會，故會不失機。會不失機，故必有會於可會；知無所遺，故必有知於可知。必有知於可知，故聖不虛知；必有會於可會；故聖不虛會。既知既會，而曰無知無會者。何耶？若夫忘知遺會者，則是聖人無私於知會，以成其私耳。斯可謂不自有其知，安得無知哉？</p>",
      "<p id='p22'>答曰：夫聖人功高二儀而不仁，明逾日月而彌昏，豈曰木石瞽其懷？其於無知而已哉。誠以異於人者神明，故不可以事相求之耳。子意欲令聖人不自有其知，而聖人未嘗不有知，無乃乖於聖心、失於文旨者乎！何者？經云：「真般若者，清淨如虛空，無知無見，無作無緣。」斯則知自無知矣，豈待返照然後無知哉？若有知性空而稱淨者，則不辨於惑智，三毒四倒亦皆清淨，有何獨尊於般若？若以所知美般若，所知非般若，所知自常淨，故般若未嘗淨，亦無緣致淨歎於般若。然經云「般若清淨」者，將無以般若體性真淨，本無惑取之知。本無惑取之知，不可以知名哉。豈唯無知名無知，知自無知矣！是以聖人以無知之般若，照彼無相之真諦。真諦無兔馬之遺，般若無不窮之鑒，所以會而不差、當而無是。寂怕、無知，而無不知者矣。</p>",
      "<p id='p23'>難曰：夫物無以自通，故立名以通物。物雖非名，果有可名之物當於此名矣。是以即名求物，物不能隱。而論云「聖心無知」，又云「無所不知」。意謂無知未嘗知，知未嘗無知。斯則名教之所通，立言之本意也。然論者欲一於聖心，異於文旨。尋文求實，未見其當。何者？若知得於聖心，無知無所辨；若無知得於聖心，知亦無所辨；若二都無得，無所復論哉！</p>",
      "<p id='p24'>答曰：經云：「般若義者，無名無說，非有非無，非實非虛。」虛不失照，照不失虛，斯則無名之法，故非言所能言也。言雖不能言，然非言無以傳，是以聖人終日言而未嘗言也。今試為子狂言辨之。夫聖心者，微妙無相，不可為有；用之彌勤，不可為無。不可為無，故聖智存焉；不可為有，故名教絕焉。是以言知不為知，欲以通其鑒；不知非不知，欲以辨其相。辨相，不為無；通鑒，不為有。非有，故知而無知；非無；故無知而知。是以知即無知，無知即知。無以言異而異於聖心也。</p>",
      "<p id='p25'>難曰：夫真諦深玄，非智不測。聖智之能，在茲而顯。故經云：「不得般若，不見真諦。」真諦，則般若之緣也。以緣求智，智則知矣。</p>",
      "<p id='p26'>答曰：以緣求智，智非知也。何者？放光云：「不緣色生識，是名不見色。」又云：「五陰清淨故，般若清淨。」般若即能知也，五陰即所知也。所知，即緣也。夫知與所知，相與而有、相與而無。相與而無，故物莫之有；相與而有，故物莫之無。物莫之無，故為緣之所起；物莫之有，故則緣所不能生。緣所不能生，故照緣而非知；為緣之所起，故知、緣相因而生。是以知與無知，生於所知矣。何者？夫智以知所知，取相故名知。真諦自無相，真智何由知？所以然者，夫所知非所知，所知生於知；所知既生知，知亦生所知。所、知既相生，相生即緣法，緣法故非真。非真，故非真諦也。故《中觀》云：「物從因緣有，故不真。不從因緣有，故即真。」今真諦曰真，真則非緣。真非緣，故無物從緣而生也。故經云：「不見有法無緣而生。」是以真智觀真諦，未嘗取所知。智不取所知，此智何由知？然智非無知，但真諦非所知，故真智亦非知。而子欲以緣求智，故以智為知。緣自非緣，於何而求知？</p>",
      "<p id='p27'>難曰：論云「不取」者，為無知故不取？為知然後不取耶？若無知故不取，聖人則冥若夜游，不辨緇素之異耶！若知然後不取，知則異於不取矣！</p>",
      "<p id='p28'>答曰：非無知，故不取；又非知，然後不取。知即不取，故能不取而知。</p>",
      "<p id='p29'>難曰：論云「不取」者，誠以聖心不物於物，故無惑取也。無取則無是，無是則無當。誰當聖心，而云聖心無所不知耶？</p>",
      "<p id='p30'>答曰：然。無是、無當者。夫無當，則物無不當；無是；則物無不是。物無不是，故是而無是；物無不當，故當而無當。故經云：「盡見諸法而無所見。」</p>",
      "<p id='p31'>難曰：聖心非不能是，誠以無是可是。雖無是可是，故當是於無是矣。是以經云「真諦無相故般若無知」者，誠以般若無有有相之知。若以無相為無相，有何累於真諦耶？</p>",
      "<p id='p32'>答曰：聖人無無相也。何者？若以無相為無相，無相即為相。捨有而之無，譬猶逃峰而赴<span class=\"gaiji\" data-gid=\"CB05145\">壑</span>，俱不免於患矣。是以至人處有而不有，居無而不無。雖不取於有無，然亦不捨於有無。所以和光塵勞，周旋五趣，寂然而往，怕爾而來，恬淡無為而無不為。</p>",
      "<p id='p33'>難曰：聖心雖無知，然其應會之道不差。是以可應者應之，不可應者存之。然則聖心有時而生、有時而滅。可得然乎？</p>",
      "<p id='p34'>答曰：生滅者，生滅心也。聖人無心，生滅焉起？然非無心，但是無心心耳；又非不應，但是不應應耳。是以聖人應會之道，則信若四時之質。直以虛無為體，斯不可得而生、不可得而滅也。</p>",
      "<p id='p35'>難曰：聖智之無、惑智之無，俱無生滅。何以異之？</p>",
      "<p id='p36'>答曰：聖智之無者，無知；惑智之無者，知無。其無雖同，所以無者，異也。何者？夫聖心虛靜，無知可無，可曰無知，非謂知無。惑智有知，故有知可無，可謂知無，非曰無知也。無知，即般若之無也；知無，即真諦之無也。是以般若之與真諦，言用，即同而異；言寂，即異而同。同，故無心於彼此；異，故不失於照功。是以辨同者同於異，辨異者異於同，斯則不可得而異、不可得而同也。何者？內有獨鑒之明，外有萬法之實。萬法雖實，然非照不得。內外相與以成其照功，此則聖所不能同；用也。內雖照而無知，外雖實而無相。內外寂然，相與俱無，此則聖所不能異；寂也。是以經云「諸法不異」者，豈曰續鳧截鶴、夷嶽盈<span class=\"gaiji\" data-gid=\"CB05145\">壑</span>，然後無異哉？誠以不異於異，故雖異而不異也。故經云：「甚奇，世尊！於無異法中而說諸法異。」又云：「般若與諸法，亦不一相，亦不異相。」信矣。</p>",
      "<p id='p37'>難曰：論云「言用則異，言寂則同。」未詳般若之內，則有用寂之異乎？</p>",
      "<p id='p38'>答曰：用即寂、寂即用，用寂體一，同出而異名；更無無用之寂而主於用也。是以智彌昧，照逾明；神彌靜，應逾動。豈曰明昧動靜之異哉？故《成具》云：「不為而過為。」《寶積》曰：「無心無識，無不覺知。」斯則窮神盡智，極象外之談也。即之明文，聖心可知矣。</p>",
      "<p id='p39' class='juan-end'>般若無知論<span class='doube-line-note'>終</span></p>",
      "</div>"
    ]
  ],
  "info": {
    "caption": "般若無知論",
    "cb_ids": "T1858_001",
    "cols": 1,
    "folder": "demo",
    "id": "T1858C",
    "note_count": 23,
    "note_id": 580,
    "notes": [
      "0|憨|X0873_003|X0873 肇論略注，明·德清",
      "0|康|T1859_002|T1859 肇論疏，唐·元康",
      "0|遵|X0870_003|X0870 注肇論疏，宋·遵式",
      "0|文|T1860_002|T1860 肇論新疏，元·文才"
    ],
    "step": 2
  },
  "log": [
    "Split paragraph #p19 at 2 as result #p19a: 夫般若虛玄者，蓋是三乘之宗極也。誠真一之無差，然異端之論，紛然久矣。有天竺沙門鳩摩羅什者，少踐大方，研機斯趣。獨拔於言象之表，妙契於希夷之境；齊異學於迦夷，揚湻風於東扇。將爰燭殊方而匿糴涼土者，所以道不虛應，應必有由矣。弘始三年，歲次星紀，秦乘入國之謀，舉師以來之意也。北天之運，數其然也。@大秦天王者，道契百王之端，德洽千載之下，游刃萬機，弘道終日，信季俗蒼生之所天，釋迦遺法之所仗也。時乃集義學沙門五百餘人於逍遙觀，躬執秦文，與什公參定方等。其所開拓者，豈謂當時之益，乃累劫之津梁矣。余以短乏，曾廁嘉會，以為上聞異要，始於時也。然則聖智幽微，深隱難測。無相無名，乃非言象之所得。為試罔象其懷，寄之狂言耳，豈曰聖心而可辨哉！試論之曰：",
    "Split paragraph #p20 at 4 as result #p20a: 《放光》云：「般若無所有相，無生滅相。」《道行》云：「般若無所知、無所見。」此辨智照之用，而曰無相、無知者，何耶？果有無相之知、不知之照，明矣。何者？夫有所知，則有所不知。以聖心無知，故無所不知。不知之知，乃曰一切知。故經云：「聖心無所知，無所不知。」信矣！是以聖人虛其心而實其照，終日知而未嘗知也。故能默耀韜光虛心玄鑒，閉智塞聰而獨覺冥冥者矣。@然則智有窮幽之鑒而無知焉，神有應會之用而無慮焉。神無慮，故能獨王於世表；智無知，故能玄照於事外。智雖事外，未始無事；神雖世表，終日域中。所以俯仰順化應接無窮，無幽不察而無照功。斯則無知之所知，聖神之所會也。然其為物也，實而不有、虛而不無。存而不可論者，其唯聖智乎。何者？欲言其有，無狀無名；欲言其無，聖以之靈。聖以之靈，故虛不失照；無狀無名，故照不失虛。照不失虛，故混而不渝；虛不失照，故動以接麁。是以聖智之用，未始暫廢；求之形相，未暫可得。故《寶積》曰：「以無心意而現行。」《放光》云：「不動等覺而建立諸法。」所以聖迹萬端，其致一而已矣。是以般若可虛而照，真諦可亡而知，萬動可即而靜，聖應可無而為。斯則不知而自知，不為而自為矣！復何知哉？復何為哉？"
  ],
  "notes": {
    "康": {
      "col": 0,
      "desc": "T1859 肇論疏，唐·元康",
      "name": "T1859_002",
      "notes": [
        [
          41,
          "夫般若虛玄下",
          "此論文有三章。第一正是本論。第二劉公致問。第三肇師釋答。今初。本論之中。文有三章。第一先序般若之因由。第二正標無知之宗旨。第三問答料簡。今初序中。文有四段。第一標宗旨。第二序什師。第三歎秦王。第四明論意。今初也。般若之法。無相故虛。幽隱故玄。玄黑也。幽深難測。義如玄黑。河上注老子云。玄天也。此亦以天遠難明義。同幽黑也。蓋是三乘之宗極誠真一無差者。蓋者不定之辭也。謂是而未敢為是。故云蓋是也。三乘皆有般若。皆因般若而得成道。皆以般若為宗本。皆以般若為至極。然有深淺不同。故有大小之異。以此義故。信般若是真是一無差之法也。然異端之論紛然久矣者。般若之法。理性無差。比者學人釋有差異。以其不能明般若之性。故異說不同。即如遠法師集云。聞壹公以等智為般若。情實不甘。即其事也。何者。等智者是共有之智。上下是同。如涅槃經云。一切眾生。皆有三種等智。所謂婬欲。恐怖。飲食。小乘依此。故立等智。此是麁近。未為深妙。豈以此智而為般若乎。道一師不解。故云以此為般若耳。今肇法師亦彈此義。故云爾也。亦可常人或謂般若有知。或謂無知不能分別。今詺此為異端耳。0174c26"
        ],
        [
          42,
          "有天竺沙門下",
          "第二序什法師也。高僧傳云。什法師父。是天竺國宰相子。名鳩摩羅焰。祖父當紹位。乃避位不受。東遊龜茲。龜茲王帛伅妹。體有赤靨。法生智子。諸圀娉之。皆不肯應。乃見焰。心欲當之。王遂逼妻焰。焰遂納之。生什法師。法師出家已後。又往天竺。故云天竺法師也。而言鳩摩羅什者。本名鳩摩羅耆婆。此云童壽。其父名鳩摩羅焰。母名耆婆。今合取父母之名為字。故云爾也。至此已後。善解文什。故名為什。此梗概。略取傳意。非全文也。此是皎法師作傳云爾。餘處不見。然此語或可然。或不然也。何者。若什法師至此。善解文什。故云羅什者。高僧傳中。更有梵僧。名佛駄什。亦解文什。然後名什乎。彼既不然。此何獨然哉。以此言之。未必然也。少踐大方者。老子云大方無隅。今借此語。以喻大乘之法也。什法師七歲出家。先學小乘諸論。至年十三。從參軍王子須利耶蘇摩受學。蘇摩兄弟二人。兄名須利耶跋陀。弟名須利耶蘇摩。蘇摩才辨絕倫。兄及諸人皆從受業。蘇摩為什說阿耨達經。什聞陰界諸法皆空無相。怪而問曰。此經更有何義。而皆破壞諸法。答曰。眼等諸法。非真實有。什既執有根。彼據因成無實。於是研覈大小。往復移時。什方知理有所歸。遂專務方等。因廣求義要。受誦中百十二門等。故云少踐大方也。又大方者。謂天竺國。什雖生龜茲。早向天竺耳。研機斯趣者。機是機根也。易云。知幾(平聲)其神乎。又云。幾者動之漸。字與今別。義或可同也。或不同也。而言同者。動之漸亦是心也。言不同者。機但論心。動之微則泛論諸事耳。什法師年二十。於龜茲王宮中受戒。住於新寺。又於寺側古宮中。初得放光經。始就披讀。魔來蔽文。唯見空紙。什知魔所為。誓心逾固。魔去字顯。仍習誦之。復聞空中聲。曰汝是智人。何用讀此。什曰。汝是小魔。宜時速去。我心如地。不可轉動。今指此事。故云爾也。獨拔於言像之表者。周易有文言象辭。假文言象辭。方顯易道。王弼周易略例。明象文云。夫象者出意者也。言者明象者也。盡意莫若象。盡象莫若言。言生於象。故可尋言以觀象。象生於意。故可尋象以觀意。意以象盡。象以言著。故言者所以明象。得象而忘言。象者所以存意。得意而忘象。是故存言者。非得象者也。存象者。非得意者也。象生於意而存象焉。則所存者。乃非其象也。言生於象而存言焉。則所存者。乃非其言也。然則忘象者乃得意者也。忘言者乃得象者也。今借此語用也。易之言象。本明易道。什法師玄悟般若。不假言象也。妙契於希微之境者。有本有得字也。契謂契會也。說文云。契要也。案契刻木為要也。然契有雌雄。像於男女。雄為左契。雌為右契老子云執左契。此之謂矣。希微者。老子云。視之不見名曰夷。聽之不聞名曰希。搏之不得名曰微。此三者不可致詰。故混而為一。今借此語。以喻般若無聲無形。什法師能妙契會也。齊異學於迦夷者。齊謂齊整也。異學是外道也。迦夷是中天竺國名。此云赤澤國也。言迦夷者。意言在西國破外道。未必克在中天竺也。其事者。龜茲北界溫宿國。有一外道。神辨英秀。名振諸國。手擊王鼓而自誓曰。論勝我者。斬首謝之。什法師既至。以二義相撿。則迷悶自失。稽首歸依。今指此事也。楊淳風以東扇者。風謂般若慧風。如淳和之風也。東扇。謂扇般若之風於此東國也。其事者。什母先將什至北天竺。遇一阿羅漢。名達摩瞿沙。見而異之。謂其母曰。常當守護。此沙彌若年至三十五。不破戒者。度人無數。如憂婆毱多。若破戒者。無所能為。正可才明絕世法師而已。遂將什歸其母。後復往天竺。臨去謂什曰。方等深教。應大闡真丹。傳之東土。唯爾之力。但於自身無益。其可如何。什曰。大士之道。利彼忘軀。若必使大化流傳。能洗悟矇俗。雖後身當爐鑊苦而無恨。後遂傳法來此。故云東扇也。將爰燭殊方而匿曜涼土者。將欲也。爰於也。小爾雅云。爰易也。燭照也。涼土即涼州也。涼有五涼。前涼張軌。後涼呂光。南涼吐蕃烏孤。西涼季暠。今言涼者。沮渠蒙遜。五涼並都姑臧。前後二涼並都姑臧可知。而南涼西涼北涼亦都姑臧者。南涼初都武威西平。後徙東都。又從姑臧。又反東都也。西涼初都姑臧。後遷須泉。蒙遜初都張掖。後遷姑臧也。今言涼者。是蒙遜涼也。言什法師將欲照燭此國。所以在涼土。隱匿才智者。有所以也。其事者。前秦主符堅。建元十三年正月。太史奏。有星現於外國分野。當有大德智人。入輔中國。堅曰。吾聞西國有鳩摩羅什。襄陽有釋道安。將非此耶。即遣使求之。至十八年九月。堅遣驍騎將軍呂光。凌江將軍姜飛。率兵七萬。西伐龜茲。臨發堅餞光於建章宮。謂光曰。夫帝王應天而治。以子愛蒼生為本。豈貪其地而伐之。正以懷道之人故也。朕聞西域有鳩摩羅什。深解法相。朕甚思之。賢哲者國之大寶。若剋龜茲。可馳驛送什。光果剋龜茲。將什東返。行至涼州。聞符堅為姚萇所害。光乃竊號關外。光死。子紹襲位。光庶子纂。殺紹自立。光姪超。殺纂立其兄隆。總經十八年。呂光父子不弘正道故。蘊具深解無所宣化。今言此事也。所以道不虛應應必有由矣者。符堅死此則無由也。姚興出是謂有由也。弘始三年下。後秦姚興年號也。歲次星紀者。丑月為星紀。丑年為赤奮若。今以月名詺年。故云星紀。何者。爾雅釋名云。寅年攝提格。卯年單閼。辰年執除。已年大荒落。午年敦䍧。未年協洽。申年涒灘。酉年作㕺。戌年閹茂。亥年大淵獻。子年困頓。丑年赤奮若月也。正月析木。二月大火。三月壽星。四月鶉尾五月鶉火。六月鶉首。七月實沈。八月大梁。九月降婁。十月娵觜。十一月玄枵。十二月星紀。今弘始三年正當丑年。年屬赤奮若。今以丑月之名。以代丑年之名。故云弘始三年歲次星紀也。有人云。十二年名。十二月名。皆是次第互用無苦在。故以月名詺年也。秦乘入國之謀舉師以來之意者。諸本皆云八國者。非也。今依古本入國是也。三十國春秋云。呂隆懼南涼北涼之逼。表奏請迎。隆遷于秦。呂光之嗣於是乎絕。此乃是呂隆入秦國。非是八國也。高僧傳云。弘始三年三月。有樹連理生于廟庭。逍遙園。葱變為薤。以為美瑞。謂至人應入國。至五月。興遣隴西公碩德。西伐呂隆。隆軍大敗。至九月隆上表歸降。方得迎什入關。故云入國之謀也。師者兵眾也。舉兵以取什法師來耳。意者北天竺之運數其然矣者。文選魯靈光殿賦序云。自西京未央。皆見墮壞。而靈光巋然獨存。意者。豈非神明扶持。以保漢室。今効此語也。明符堅舉兵法。往取什法師。未至而卒。今姚興舉兵往取。乃得歸來者。此是北天之運。運數應爾也。而言北天者。大品經云。般若於佛滅後。至南方。次至西方。後至北方。北方大興盛。大智論釋云。北方謂北天竺也。今謂北天竺。運數展轉。方至東國。故云爾耳。0175a21"
        ],
        [
          43,
          "大秦天王者",
          "第三歎秦王姚興也。興初承父之後。僭稱皇帝。後之皇帝。號自稱秦王。百官皆隆號。改年弘始。今不稱天子。此云天王耳。道契百王之端下。道居前王之表。故云百王之端。德潤洽於未來之世。故云千載之下。遊刃萬機者。智刃也。莊子內篇養生章云。庖丁為文惠君解牛。手之所觸。肩之所倚。足之所履。膝之所踦砉(呼歷反)然響然。奏刀騞然。莫不中音。合於桑林之舞。乃中經首之會。文惠君曰。嘻善哉伎。蓋至於是乎。庖丁釋刀對曰。臣之所好者道也。進乎伎矣乎始臣解牛之時。所見無非牛者。三年之後。未嘗見全牛也方今之時。臣以神遇而不以目視。良庖歲更刀而割也。族庖月更刀而折也。今臣之刀。十九年矣。所解數千牛矣。而刀刃若新發於硎。彼節者有聞。而刀刃者無厚。以無厚入有間。恢恢乎。其於游刃必有餘地矣。萬機者。尚書咎繇謨曰。兢兢業業一日二日萬機。孔注云。幾微也。言當戒懼萬事之微。今作機字。仍是單機字也。言秦王者。外能遊智刃斷割國務。內能終日弘通佛道也。信季俗蒼生之所天下。信言信是也。季者。孟仲季。季末也。信秦王是季俗蒼生所仰如天。釋迦遺法之所憑如杖。亦杖託之杖也。遺法杖之而得興盛也。而言蒼生者。蒼是天色。莊子逍遙篇云。天之蒼蒼。其正色耶。今云天生。故云蒼生。所謂眾生也。時乃集義學沙門下。于時集諸僧也。義學謂學義者也。秦時有逍遙園。園中有觀。故云逍遙觀也。叡師云。逍遙園西明閣。閣亦觀也。逍遙園在西京故城之北。臨渭水也。躬執秦文與什參定方等者。什法師弘始三年十二月二十日至長安。弘始五年四月二十三日。於逍遙園中。出大品經。秦王躬覽舊經。驗其得失。今言其事也。其所開託者下。明秦王所請譯經。開託法門者。非但取益當時。乃為末代津梁也。累劫者。意云當來久遠利益也。0176c08"
        ],
        [
          44,
          "余以短乏下",
          "第四序論意也。短謂短學。乏謂乏才。曾謂曾經也。廁謂間廁也。嘉善也。謂經預間在五百人數會耳。以為上聞異要始于時也者。我以此時初聞異法要法耳。然聖智幽微下。前且明曾聞般若。今明般若難解。不可言說也。為試罔像其懷下。懷抱罔像。然似如有解。寄狂言以說之也。而言罔像者。莊子外篇北遊章云。黃帝遊赤水之北。登乎崑崙之丘。南望而遺其玄珠。使智索之而不得。使離誰朱索之而不得。使契詬索之而不得。乃使罔象。罔象得之。黃帝曰。異哉罔象。乃可以得之乎。郭注云。明得真者。非用心也。罔象焉即真。今用此語也。字雖少異。本出莊子文。0177a16"
        ],
        [
          45,
          "放光云般若無所有相下",
          "第二正標無知論之宗旨。以為論體也。文有五段。第一標宗。第二辨相。第三融會。第四明體。第五總結。今初。文中有三。初正標宗。次解釋。後引證。今初引兩經標立無知宗旨也。此辨智照之用而曰無相無知者。此亦是釋。但未正釋也。此句如問。既云般若。正明智用。應是有知。乃云無相無知。何故然耶。果有無相之知不知之照明矣者。此句如答也。果者決定也。定有無相之知。則無取相之知。以無取相之知。以無取相之知。明是無知也。0177b01"
        ],
        [
          46,
          "何者夫有所知即有所不知下",
          "第二解釋也。有所知者。取相知也。若有取相知。則無無相知也。又取相此即忘彼。知事即迷理。故知有所知者。則有所不知也。以聖心無知無所不知者。無此取相知。則有無相知也。又取相既有所不知。即不取相則無所不知。理數然矣。不知之知乃曰一切知者。無心取相而能知萬物者。乃是聖人一切智之所知也。0177b12"
        ],
        [
          47,
          "經云聖心無知下",
          "第三引證也。0177b20"
        ],
        [
          48,
          "是以聖人虛其心而實其照下",
          "第二辨相也。所言相者。非有相之相。乃是無相之相耳。老子云。虛其心。實其腹。弱其志。強其骨。今借此語也。虛其心。謂不取相也。實其照。遍知萬法也。故能默曜韜光者。以不取相。故能潛照萬法也。鞱光者。謂藏匿智光。而不取相也。虛心者。謂心無執著也。玄覽者。謂幽鑒也。閉智者。謂不分別也。塞聽者。不聽納也。又不曜而曜名為默曜無光而光名為韜光。無心而心謂之虛心。不覽而覽名為玄覽。不知而知謂之閉智。無聽而聽謂之塞聽。雖復閉智塞聽。而獨悟空空之理。故云獨覺冥冥也。然冥冥語。出莊子。莊子云。照照生於冥冥。有倫生於無形。今借此語。以喻空空也。0177b21"
        ],
        [
          49,
          "然則智有窮幽之鑒而無知焉下",
          "第二融會也。聖智窮盡幽微而不取相。故曰無知。聖神應會機緣而不動念。故曰無慮也。神無慮故下。此故字。或屬上。或屬下。皆得也。以聖神無慮。故能自在於世間之表。即是自在義也。以聖智無知。故能玄悟於事像之外也。智雖事外下。雖云聖智玄照事外。即色知空也。非謂離色有空也。雖云聖神自在於世間之表。非謂不化眾生。終日在域中應化也。所以俯仰順化下。俯謂低。仰謂舉。應見大者。為現無邊之身。是謂仰也。應見小者。為現三尺之體。是謂俯也。應化接誘眾生。無有窮已也。無幽不察而無照功者。無幽微而不察。謂皆察也。自亡其照功也。謂無知也。斯則無知之所知下。此是無知之知。聖人神智之所應會也。0177c07"
        ],
        [
          50,
          "然其為物下",
          "第四明體也。文中有三。初正明體。次解釋。後引兩經證成。今初。言其者。聖智也。物者。謂此聖智之為物性也。此乃非物名為物耳。實而不有虛而不無者。知法皆空。謂之實也。雖言是實。而體性非物。故言不有。體性非物。即名為虛。無所不知。故云不無。亦可言以無知。故言不有。無所不知。故言不無耳。存而不可論者其唯聖智乎者。不無此智。故言存也。不可論其相貌定有定無。故言不可論也。唯獨聖智如此。故云唯也。0177c22"
        ],
        [
          51,
          "何者欲言其有無狀無名下",
          "第二解釋也。無狀者。無狀貌也。無名者。無名字也。聖以之靈者。以用也。聖人用此靈通無所不知也。聖以之虛故虛不失照者。雖虛而不失照鑒之用也。無狀無名故照不失虛者。雖照知而不取相也。混而不渝者。混雜也。渝變也。出杜預注春秋。雖混同萬法。而各各差別。不渝變也。動以接麁者。有所動作。應接機緣。故云接麁也。是以聖智之用下。常有用未嘗暫廢。只自求其形相。不可暫得也。0178a03"
        ],
        [
          52,
          "故寶積曰下",
          "第三引兩經證成也。是維摩經中。長者子寶積說偈文也。舊經云爾。今經云。以無心意無受行也。不動等覺而建立諸法。等覺即般若也。謂聖智不動而無所不為。故云建立眾生於實際也。所以聖迹萬端其致一而已矣者。種種變現。故云萬端。同是般若一致之所為作。故云一耳。0178a13"
        ],
        [
          53,
          "是以般若可虛而照下",
          "第五總結也。般若之智雖無知。而能鑒照真諦之理。雖忘相而可見知。然此忘字義。應是亡失之亡。諸本皆作忘遺字。良以真諦不可取相。故云忘耳。萬動可即而靜下。萬物起動。即動無動。聖應無為。無所不為也。斯即不知而自知下。不作有相知。自是無相知。不同有心為。自是無心為也。復何知哉下。不知而知。即無定知。故云復何知。不為而為。即無定為。故云復何為也。0178a20"
        ],
        [
          54,
          "問曰夫聖人真心獨朗下",
          "第三問答料簡也。文有九番。然有四難。第一有一番能所難。第二有一番名體難。第三有四番境智難。第四有三番生滅難。前三難皆難無知。後一難直難生滅。今初。問即難也。前論文云。智有窮幽之鑒而無知焉。神有應會之用而無慮焉。無知即無智也。無慮即無會也。今難此語耳。意云。有能知能會。有可知可會。即是有知有會。何得言無知耶。文中有二。前躡前難。後玄搆難。雖有兩意。通難一義。合為一難也。而言真心獨朗者。朗明也。謂般若之心。獨自朗悟。無物無知。故云物物斯照也。應接無方下。有緣皆應皆接。無有齊限。故曰無方。有所云為。皆與機緣應會。故云動與事會也。物物斯照故知無所遺者。皆知。故無遺漏也。有本作智字。義意雖同。望下不然也。動與事會故會不失機者。有機則會。故不失也。會不失機故有會於可會者。可會即眾生也。知無所遺故有知於可知者。有本云。必亦有知於可知。煩長也。義雖無失。不如省要也。可知即所知之理也。有知於可知下。覆疏上句也。既知既會下。聖不虛知。即是有知。聖不虛會。即是有會。故曰既知既會。既有知會。何故言智有窮幽之鑒而無知焉。神有應會之用而無慮焉耶。若夫忘知遺會下。第二玄搆難也。有本言若云。亦得也。若以聖人雖有知會。而不言我能有知我能有會也。即是聖人無私於知會以成其私者。此是聖人之心。不私作知會解。息忘其知會。非謂無知無會也。而言以成其私者。莊子外篇天道章云。孔子舉仁義。以說老聃。聃曰。何謂仁義。孔子曰。忠心勿愷悌。兼愛無私。是謂仁之情也。老聃曰。無私焉乃私。郭注云。世所謂無私者。釋已而愛人。夫愛人者。亦欲人之愛已。此乃其私。非亡公而公者也。今借此語。明聖人雖無心取知會。乃是知會。如無私乃成私耳。斯可謂不自有其知安得無知哉者。若云自忘知會者。此乃自不謂有知會。然知會之體非無。何得言無知會乎。答曰夫聖人功高二義而不仁下。答也。前難中雖有兩意。同難知會。今更不分別。合作一答也。文中有三。第一序本宗。第二述難意。第三結答。今初。功高二儀而不仁者。二儀謂天地也。不仁者。老子云。天地不仁。以萬物為芻狗。聖人不仁。以百姓為芻狗。今借此語也。聖人功高天地。是即仁矣。而不自矜其能。是謂不仁也。般若智明過於日月。是即明矣。而忘其知。故曰彌昏。小爾雅云。彌益也。彌久也。今取益義耳。豈曰木石鼓其懷其於無知者。意云。聖人無知者。懷抱豈同木石。名此為無知乎。固不然也。誠以異於人者神明下。人者神明。法有取相。是即知矣。聖人神明不取法相。故曰無知。以無知故。不可作事相取也。子意欲令下。第二述難意也。文中有二。前躡前難意。後玄搆難意。令初也。前難末云。聖人無私於知會。故名無知者非也。不自有其知者。自不以知會為有也。而未嘗不有知者。有知在也。無乃乖於聖心下。無乃乃也。如爾雅云。無定定也。無寧寧也。不顯顯也。不承承也。言乃乖聖心。失文旨也。何者經云下。釋經意。明所以乖聖心失文旨也。無知無見者。一往為知。明了為見。亦可一往為見。明了為知也。無作無緣者。作謂起作。緣謂攀緣也。斯知自無知矣。豈待反照然後無知哉者。聖心無所取相。故名無知。非是實有知自忘其知。名為無知也。若有知性空而稱淨下。第二玄搆難意也。若以聖人實有般若之知。但以其體性是空故曰無知者。非今無知之本意也。即不辨於惑智者。般若亦空。惑智亦空。二俱是空。同是無知。是則無別也。三毒四倒下。不但惑智。乃至三毒等皆爾。亦以性空為淨。與般若何異。何故獨稱般若無知乎。若以所知美般若下。若以真諦所知之境無相故。歎美能知之智為無知者。亦非也。所知自常淨般若未嘗淨者。真諦自空。般若非空也。亦無緣致淨下。真諦自空。不關般若。何緣令般若同真諦之空。而言無知乎。然經云下。釋經中明般若無知本意也。將無以般若體性真淨本無惑取之知者。將無以者。意言以也。如世說云將無同意言同也。以般若體性不取著於真諦。無惑取之知。故曰無知耳。無惑取之知不可以知名哉者。從然經云至此。文勢乃盡耳。以無有惑取之知。故言無知耳。豈唯無知名無知者。又答前忘知遺會也。非是自忘其知會。然後言無知。只此知性自無知矣。不待忘也。是以聖人下。第三結答也。真諦無兔馬之遺下。經說象馬兔三獸度河。淺深有異。象盡河底而無遺。兔馬未盡故有遺。今明般若觀真諦。真諦無遺。不如兔馬。故云無兔馬之遺。般若之智鑒照窮盡。故云無窮之鑒也。所以會而不差下。會機緣不差失。當道理無取著。寂然泊然無知。而遍知諸法也。0178b01"
        ],
        [
          55,
          "難曰夫物無以自通下",
          "第二有一番名體難也。難中有二。先且泛序名體相召。然後正致難。今初。言物無以自通者。物不能自呼召得物體。故須立名以詺物。名能召物體。故名為通也。物雖非名下。物雖非是名。而有物當名。名詺得物體也。是以即名求物下。即以物名取物體。則物體可取。不能隱避也。而論云聖心無知下。第二正致難也。意謂無知未甞知下。明兩名別也。斯即名教之所通下。立知無知兩名。本詺知無知兩體也。然論者欲一於聖心下。論主云。知無知只是一聖心。而知無知兩名別也。尋文求實下。以知無知兩名。求其兩實。不相當也。何者下。釋所以不當之意也。若聖心是知。即非是無知。故云無所知無所辦。下句反此。若二俱無得無所得復論者。若知無知俱不得聖心。即兩名皆不當實。故不須復論也。答曰經云下。答文中有二。先且序般若絕言之意。後正答其所難。今初也。斯無名之法下。般若如此。乃是無名之法。故不可以名言言之也。言雖不能言下。雖不可言。假言方通。非言不傳也。是以聖人終日。智無知者。非實無知也。欲明聖智無所取著。故言無知耳。辨相不為無通鑒不為有者。若依前釋。以辨聖智。能通知諸法。故非無知也。以通聖智無有執著。故非有知也。若依後釋以辨相。故言聖智無知。其實非無知也。以通鑒故言聖智有知。其實非有知也。非有故知而無知下。覆上也。以非有故。有知即無知。以非無故。無知即有知也。是以知即無知下。結也。無以言異而異於聖心者。莫以知無知兩言有異。謂聖心有有無之別也。0179b06"
        ],
        [
          56,
          "難曰夫真諦境智深玄下",
          "第三有四番境智難也。四番連環更不分別。今初番也。真諦謂無生真境。非般若妙智。不能測知也。聖智之能在茲而顯者。般若有知。真諦之功能也。真諦即般若之緣也者。般若所緣緣於真諦也。以緣求智智即知矣者。既有所知之緣。即有能知之智。所知之緣既有法。能知之智應有知也。答曰。以緣求智智非知也下。答文有三。第一直釋答第二相形答。第三總結答。今初。先標。後釋。今言不得以緣求智。令智有知也。何者下。釋所以也。放光云不緣色生識者。凡人皆緣色生識。所以有見。有見即有知。聖人不緣色而生識。即是無見。無見即無知也。又云五陰清淨下。五陰無相。故云清淨。般若無知。故云清淨也。般若即能知也。五陰即所知也。般若是能知之智。五陰是所知之境也。所知即緣也。即是所緣之法也。夫知與所知相與而有下。第二相形答也。雙辨真俗二諦。惑解兩智。與者共也。相與而有。謂惑智惑境也相與而無。謂真智真境也。以俗諦有相。故惑智有知。故云相與而有。以真諦無相。故真智無知。故云相與而無也。相與而無故物莫之有者。以真諦無相故真智無知。人莫能令其有知也。相與而有故物莫之無者。以俗諦有相故。惑智有知。人莫能令其無知也。物莫之無故為緣之所起者。以人莫能令其無知故。即相因而起也。物莫之有故緣所不能生者。以人莫能令其有知故。即不相因而起也。緣所不能生故照緣而非知者。謂真智也。雖照真諦。不為真諦所生也。為緣之所起故知緣相因以生者。謂惑智也。境智相因而得生也。是以知與無知生於所知矣者。雙結惑解兩知兩境也。何者夫智以知所知取相故名知者。此謂惑智惑境也。真諦自無相真智何由知者。此謂真智真境也。所以然者下。覆前兩義。今從此下至不從因緣有故。即直明惑境惑智也。而言所知非所知所知生於知者。所知不自得所知名。以因能知。故得所知名也。所知既生知知亦生所知者。所知既因能知而得名。能知亦因所知而得名也。知所知既相生相生即緣法者。彼此迴互相因而生。即是因緣所生法也。緣法故非真者。以從緣生則非真也。非真故非真諦者。既從緣生即是俗諦也。故中觀曰下。引中論意。非全文。此意明俗諦。言勢隨及真耳。今言真諦曰真下。從叱至不見有法無緣而生。明真智真諦也。真諦既名真。真故即不從因緣而生也。故經曰不見有法無緣而生者。有法皆從緣生。無有有法而非緣生。則明非緣生者。是真諦也。涅槃經云。是諸外道。無有一法不從緣生。諸經之中。通有此意。今泛引也。是以真智觀真諦下。第三總結答也。智不取所知此智何所知者。以不取所知故。名無知也。智然非無知但真諦非故知所真智亦非知者。不同木石之無知。故云然非無知也。但以真諦非是有相之所知故。真智不取相。名為無知耳。而子欲以緣求智下。子者男子之通稱也。子以真諦所緣之法是有。而令般若有知也。緣緣自非緣於何求知者。真諦之緣自無其相。真智之法。何得有知耶。難曰論云不取者下。第二番也。執前不取之言。以為難耳。為無知故不取下。為無所知故言不取。為先知然後忘取。故言不取耶。冥若夜遊者。無所知則同夜行。不辨黑白。知則異於不取者。知與不取異。則當知之時有取。然後忘知。始是不取耳。答曰非無知故不取者。雙排兩難也。當知之時。即不取相。故言無知耳。難曰論云不取者下。第三番也。不物於物者。不以物為有物也。若以物為有物。則是惑取。不以物為有物。則無惑取也。無取則無是下。既無所取。何物是物。何物當聖人之心耶。既不當聖心。云何聖人無所不知乎。答曰然無是無當者。按成此語。實無可是。實無可當也。夫無當則物無不當者。無當乃當真理。無是乃是真理也。物無不是則是而無是者。是真理雖是無所是。當真理雖當無所當也。盡見諸法而無見者。盡見諸法。則有當有是。而無見者。則無當無是也。難曰聖心非不能是下。第四番也。非不能以萬物為是物。然以無物可是物故。聖人不以物為有物耳。雖是不是是故當是於無是矣者。物非是有故當是無。不以物為有物。應以物為無物也。誠以般若無有有相之知者。不同惑智有相知也。若以無相為無相又何異累於真諦者。不作有相知。但作無相知也。又不有有相知。但有無相知。如此有何患累耶。答曰聖人無相者。聖人以無相為心也。既以無相為心。不但無於有相。亦乃無於無相也。若以無相為無相下。若謂聖人以無相為相。有此無相之知。此則無相乃成相。無知乃是知也。捨有而之無譬猶逃峯而赴壑者。之適也。峯謂山。壑謂水。避山而赴水。俱有害身之患也。處有不有下。處有不取有相。居無不取無相也。然亦不捨於有無者。即有為不有。非謂離有為不有。即無為不無。非謂離無為不無也。和光塵勞者。老子云。和者和其光。同其塵。今借此語。以明聖人和光同塵。在有同有。在無同無。同有。不取有。同無不取無也。周旋者。往來也。寂然而往下。寂泊俱是靜也。往即寂往。往無往矣。來即泊來。來無來矣。恬淡無為者。恬然淡然。無所施為。雖無所為。而無所不為也。淡音去聲也。莊子外篇天道章云。夫虛靜恬淡寂漠無為者。天地之本。道德之至也。0179c08"
        ],
        [
          57,
          "難曰聖心雖無知下",
          "第四有三番生滅難也。三番即為三。今初番也。應接機緣不失機會。故云應會不差耳。存之者。存而不應也。可乎者。有本云何乎。有本云可乎。皆得言聖心可得生滅乎。答曰生滅者生滅心也者。謂凡言生者生於心。滅者滅於心也。聖人無心生滅焉起者。既無有心。無可生滅也。然非無心下。非是木石之無心。但是無知之無心。故曰無心心。應亦如是也。是以應會則信若四時之質者。小雅云。質信也。家語云。明王之治百姓。其化可守。其言可復(伏音)。其迹可履。故其信如四時也。呂氏春秋云。天地之大。四時化常。其信至也。春秋感精符云。人主與日月同明。四時合信也。今以聖人應物。事如四時春秋冬夏。至時必應也。直以虛無為體者。有本上句無之字。則應云信若四時質直。此句則云以虛無為體。今依前釋直字向下也。直者但也。獨也。但以聖心虛無。故不可取。既不可取。是則無相。無相故無生無滅也。0180c24"
        ]
      ],
      "tag": "康"
    },
    "憨": {
      "col": 0,
      "desc": "X0873 肇論略注，明·德清",
      "name": "X0873_003",
      "notes": [
        [
          1,
          "般若無知論第三",
          "般若者。此云智慧。乃諸佛妙契法身之實智也。經云。諸佛智慧。甚深無量。即此名為根本智。法界幽玄。非此莫鑒。故稱本智。然三乘同乘此智為因。但心有大小不同。故唯佛為極。以前不遷不真二論。以顯真俗不二之真諦。為所觀之境。今此般若為能觀之智。謂以無知之般若。照不二之中道。以此為因。將證不生不滅之涅槃為果。故次來也。然般若唯一。其用有三。一實相般若。以般若乃諸法之實相故。二觀照般若。即中道妙心之實智。照中道之妙理。理智冥一。平等如一。故理事雙彰。權實並顯。是為因心果德。故名二智。三文字般若。以諸佛言教。乃般若所流。故一一文字能顯總持。要即文字以明般若。此般若義也。無知者有二義。一離妄。謂本無惑取之知。二顯真。有三義。一本覺離念。靈知獨照。知即無知。二始覺無知。謂窮幽亡鑒。撫會無慮。故無對待之知。三文字性空。非知不知。然雖三義。蓋以真諦無相。亡知絕鑒。照體獨立。正無知義也。什師初譯大品。論主宗之以造此論。以呈什師。師曰。吾解不謝子。文當相揖耳。後傳至匡山。劉遺民以呈遠公。公歎曰未曾有也。當時見者。靡不服膺。0341b23"
        ],
        [
          2,
          "夫般若虗玄者。蓋是三乘之宗極也。誠真一之無差。",
          "此標宗極也。虗玄。正顯無知。以幽靈絕待。故謂之虗。亡知絕照。故謂之玄。三乘同稟此智。但以取不取。知無知之差。所謂心有大小耳。其實所宗。以此為極。所謂不二真心。故曰真一無差。0341c21"
        ],
        [
          3,
          "然異端之論。紛然久矣。",
          "此述造論之本意也。語曰。予豈好辯哉。不得已也。故造論之意。本為摧伏邪見。以正智未明。不得不為之論耳。0342a02"
        ],
        [
          4,
          "有天竺沙門鳩摩羅什者。少踐大方。研機斯趣。獨拔於言象之表。妙契於希夷之境。",
          "此出師承有本也。梵語鳩摩羅什。此云童壽。以童年而有耆德。故有此名。師本龜茲國王之甥。以其父鳩摩羅炎。本天竺人。今從本稱。天竺。亦云身毒。亦名印土。有五。乃婆羅門所居。佛出其中。大方指般若。什師學本生知。年方二十。即為國王講般若經論。故云少踐大方。妙悟玄猷。故曰研機斯趣。以般若離言。故拔言象之表。離相離名。非見聞所及。故曰妙契希夷之境。希夷二字。出老子。言妙悟超卓。今翻譯大品。論主親承稟受。妙契玄旨。故造斯論。0342a07"
        ],
        [
          5,
          "齊異學於迦夷。",
          "齊。集也。猶齊物之齊。迦夷。亦名迦維。乃佛生之國。佛滅度後。異學紛然。什師名播五天。彼多宗仰。故云集也。0342a18"
        ],
        [
          6,
          "揚湻風於東扇。將爰燭殊方而匿耀涼土者。所以道不虗應。應必有由矣。",
          "此敘什師入中國之由也。此時道安法師。名震當代。秦主符堅。以師尊之。稱為聖人。安曰。貧道非聖。聞龜茲國有羅什者。真聖人也。堅聞之。欣慕不已。乃遣大將軍呂光。率鐵甲兵十萬伐龜茲。以迎師。光將兵至國。圍其都城。王致辭曰。下國與大秦遼遠。俗不相及。何以見伐。光曰。大秦天王。所以命師伐王之國者。非為土地之利也。因聞王國有聖人鳩摩什。將迎歸供奉耳。非別有所圖也。王曰。什乃予國之寶也。安肯棄之。餘則唯命是聽。遂堅壁。光圍久之。王城益急。什請曰。豈以貧道一人之故。而舉國受困。非利也。願請以行。王不聽。什曰會當歸耳。王無已。遂遣師同光行。是謂揚湻風於東扇也。光至涼。聞姚萇弒堅自立。國號後秦。光亦據涼自王。國號西凉。時什師未及入秦。遂居於凉。光無良。多困辱師。無以自見。故曰將爰燭殊方而未顯。留滯於凉。故曰匿耀凉土。以既來而致困。其道不行。故曰道不虗應。應必有由矣。0342a23"
        ],
        [
          7,
          "弘始三年。歲次星紀。秦乘入國之謀。舉師以來之意也。北天之運。數其然也。",
          "此敘什師得時行道之由也。姚萇弒堅。在位八年。而什師亦被困於凉。偶堅領鬼兵入宮。刺萇中陰出血石餘而崩。子興嗣立。降帝號而稱天王。意蓋宗尊周制也。改元弘始。丑月為星紀。以月紀年也。什師在凉十一年矣。時因殿庭生連理樹。逍遙園葱變成芷。咸謂智人入國之瑞。知師在凉。秦主乃遣姚碩德伐凉。光已薨。其子呂隆嗣立。兵至大敗之。隆即降。遂表奉師至。秦主深禮重焉。故曰秦乘入國之謀。舉師以來之。大品云。般若於佛滅後。先至南方。次至西方。次至北方。大盛於震旦。震旦在天竺東北。故曰北天之運。數其然也。謂法運時數。當其然耳。0342b18"
        ],
        [
          8,
          "大秦天王者。道契百王之端。德洽千載之下。游刃萬機。弘道終日。信季俗蒼生之所天。釋迦遺法之所仗也。",
          "此敘明時什師行道之會也。天王乃興自稱。故時並尊之。百王。指堯舜以下。端。謂百王首。以無為為治也。洽。霑潤也。意稱弘法之德。流潤千載之下也。游刃。語出莊子。庖丁解牛。游刃其間。恢恢乎有餘地。此稱秦主才智有餘。雖萬機叢錯。迎刃而解。恢有餘地。故不妨弘道終日也。謂此聖主。信為末法蒼生之所天。蒼生。猶言赤子。天。稱父母為天。謂養育羣生如一子也。佛臨滅時。將佛法付囑國王大臣。非仗大力外護。法難久住。故為遺法之所仗也。上敘弘法之主。下敘弘法之事。0342c09"
        ],
        [
          9,
          "時乃集義學沙門五百餘人於逍遙觀。躬執秦文。與什公參定方等。其所開拓者。豈謂當時之益。乃累劫之津梁矣。",
          "此敘秦主弘法之事也。逍遙觀。乃秦主游宴之所。什師至國。遂延於此中以譯諸經。後因秦主賜什宮人。乃別搆草堂以居之。即今之草堂寺。什師宣梵。秦主親執文對譯。方等諸經。乃所譯也。開拓。如開疆拓土。以佛法初開荒邈。不唯以益當時。實為累劫之津梁也。0342c22"
        ],
        [
          10,
          "余以短乏。曾廁嘉會。以為上聞異要。始於時也。",
          "此論主自敘聞法之時也。短乏。謙辭。謂才短德乏。濫廁嘉會。上聞船若玄旨。異常心要。始於此時也。上敘來義。下顯正宗。0343a05"
        ],
        [
          11,
          "然則聖智幽微。深隱難測。無相無名。乃非言象之所得。為試罔象其懷。寄之狂言耳。豈曰聖心而可辨哉。試論之曰。",
          "正宗之初。據理出意。將欲制論。先示般若玄旨。非言論可及也。經云。諸佛智慧甚深無量。其智慧門難解難入。一切聲聞辟支佛所不能知。不退菩薩亦不能測。故曰聖智幽微。深隱難測。般若之體。離相離名。豈言象之所得哉。今欲論之。試罔象其懷。寄之狂言耳。罔象語出莊子。黃帝遺其玄殊。使智索之而不得。使罔象索而得之。謂虗無其懷。乃可與智相應也。狂言亦出莊子。謂大而無當之言。蓋謙辭也。意謂試以狂言擬之。非敢謂聖心可辨也。0343a11"
        ],
        [
          12,
          "放光云。般若無所有相。無生滅相。道行云。般若無所知。無所見。",
          "此引二經以定宗也。放光。即大品也。兩譯文異。二十卷云。般若無所有相。第十五云。般若波羅蜜。不生不滅相。道行第一云。般若當從何說。菩薩都不可得見。亦不可知。此約義引也。以般若體絕諸相。故云無所有相。寂滅湛然。故云無生滅相。真知獨照。故無所知。絕諸對待。故無所見。般若如此。豈名言之可到哉。下依宗辨用。0343a22"
        ],
        [
          13,
          "此辨智照之用。而曰無相無知者何耶。果有無相之知。不知之照明矣。",
          "此徵顯般若實相之體。以為發論之端也。此者指上引二經。乃辨智照之用。既有智有用。則應有相有知可也。而云無相無知者何耶。由是觀之。實有離相之知。亡知之照。明矣。但非心識思量可及也。0343b07"
        ],
        [
          14,
          "何者。(微顯上義)夫有所知。則有所不知。(此凡情也)以聖心無知。故無所不知。不知之知。乃曰一切知。故經云。聖心無所知。無所不知。信矣。",
          "此徵明無知之義也。約理而推。夫有所知之境。則滯於一緣。則有不知之地。此心境未泯。對待未忘。乃凡情也。擬之聖心則不然。以聖心虗靈絕待。境智雙忘。能所俱絕。是為無知。以無知之知。光明徧照。故無所不知。以不知之知。故曰一切知。故思益經云。聖心無所知。無所不知。信矣。由無所知。故無所不知耳。豈有心之知而可及哉。0343b14"
        ],
        [
          15,
          "是以聖人虗其心而實其照。終日知而未嘗知也。故能默耀韜光。虗心玄鑒。閉智塞聰。而獨覺冥冥者矣。",
          "此釋聖心無知之所以也。以聖人惑無不盡。故虗其心。真無不窮。故實其照。此實智內證也。由內證之實。故權智外應。則終日知而未嘗有其知也。由其體用雙彰。權實並運。故能默耀韜光。不用其知。虗心玄鑒。故無幽不燭。所以外應羣動。則忘知泯照。閉智塞聦。不有其知。而內與理冥。真知獨照。故曰獨覺冥冥。此所謂無知無所不知也。0343b23"
        ],
        [
          16,
          "然則智有窮幽之鑒。而無知焉。(實智內證)神有應會之用。而無慮焉。(權智外應)神無慮。故能獨王於世表。智無知。故能玄照於事外。",
          "此分別觀照以顯權實二智也。實智照理。故有窮幽之鑒。照體獨立。心境兩忘。故無知焉。神。權智也。俯順羣機。故有應會之用。無思而應。故無慮焉。無思而應。則物不能累。故獨王於世表。智無知。則境與心會。觸事而真。故能照於事外。是以不住無為。不捨有為。權實雙彰。齊觀並照。此聖人之心也。0343c09"
        ],
        [
          17,
          "智雖事外。未始無事。神雖世表。終日域中。所以俯仰順化。應接無窮。無幽不察。而無照功。斯則無知之所知。聖神之所會也。",
          "此釋成二智並運之所以也。以觸事而真。故智雖事外。而未始無事。以神雖世表。不捨度生。故終日域中。由夫二智齊觀。所以聖人俯仰順化。故權智應接無窮而不累。實智無幽不察而無照功。此其所以為聖智無知之所知。乃聖智神心之所冥會也。以此而觀聖心。則般若之旨昭然矣。0343c18"
        ],
        [
          18,
          "然其為物(體也)也。實而不有。虗而不無。存而不可論者。其唯聖智乎。",
          "此申明般若體絕有無也。般若本有真實之體。但無相而不可見。故云實而不有。虗靈湛寂而照用常然。故云虗而不無。存而不可論者。義引莊子。六合之外聖人存而不論。以明般若非常情知見之境。故但當存之而不可論。以非言可及也。0344a02"
        ],
        [
          19,
          "何者。(微也)欲言其有。無狀無名。欲言其無。聖以之靈。",
          "此明般若不屬有無也。欲言是有。則無相狀。而不可以名貌。欲言其無。而聖人玄鑒萬機。應用不缺。故不可以有無名也。0344a08"
        ],
        [
          20,
          "聖以之靈。故虗不失照。無狀無名。故照不失虗。",
          "此下明般若寂照一源。體用雙彰。權實並顯也。虗不失照。則寂而常照。故體不離用。照不失虗。則照而常寂。用不離體。0344a12"
        ],
        [
          21,
          "照不失虗。故混而不渝。虗不失照。故動以接麤。",
          "此正明權實並著也。由照不失虗。故權智外應。混融萬物。而其體湛然而不變。渝。變也。由虗不失照。故實智內證。而不捨度生。麤謂現身三界。隨類而應。是以照彌深。用彌廣。0344a16"
        ],
        [
          22,
          "是以聖智之用。未始暫廢。求之形相。未暫可得。",
          "此結成寂照同時之義也。由其權實不二。故聖人彌綸萬有。潛歷四生。未曾一念捨眾生界。其實求其智用之跡而不可得。0344a21"
        ],
        [
          23,
          "故寶積曰。以無心意而現行。放光云。不動等覺而建立諸法。所以聖迹萬端。其致一而已矣。",
          "此引二經結成寂照一源之義也。若聖人有心作為。則有形相而可得。由無心意而現行。故現身如水月。說法如谷響。雖可見可聞。其實求之而不可得。由不動等覺而建立諸法。故不離當處而法界彌綸。所以聖迹萬端。皆法身彌布。故云其致一而已矣。0344b02"
        ],
        [
          24,
          "是以般若可虗而照。真諦可亡而知。萬動可即而靜。聖應可無而為。斯則不知而自知。不為而自為矣。復何知哉。復何為哉。",
          "此總結般若寂照不二。存泯互融也。由上論聖心如此體用雙彰。故般若體雖至虗。可以即虗而照。亡。絕也。真諦之境雖絕相。可以即絕相而知。萬動雖紛。可以即動而靜。聖應雖無為。可以即無為而為。如此。則聖智不知而自知。不為而自為矣。由其存泯互融。故體用不二也。上顯雙存。下顯雙泯。復何知哉。復何為哉。其實無知無為也。上本論竟。下問答決疑。有十八段。0344b11"
        ],
        [
          25,
          "難曰。(一有知不矜難。由前云智有窮幽之鑒而無知焉。神有應會之用而無慮焉。故躡此二句以興難。意謂既有知有會。豈可言無知無會也。但聖人有知而不矜耳)夫聖人真心獨朗。物物斯照。應接無方。動與事會。物物斯照。故知無所遺。(萬境齊觀)動與事會。故會不失機。(有感即赴。上領旨也。下敘計)會不失機故。必有會於可會。(謂必定有機可會)知無所遺故。必有知於可知。(謂必有能知之心。知於可知之境)必有知於可知。故聖不虗知。必有會於可會。故聖不虗會。(謂既有知有會。必有可知可會之境。此則知不虗知。會非虗會矣。下正難)既知既會。而曰無知無會者。何耶。(此正申難也。既有知有會。而曰無者。豈不謬耶。下敘救)若夫忘知遺會者。則是聖人無私於知會。以成其私耳。(此敘救也。謂若以忘知遺會為救者。則是聖人雖有知會。而不自矜恃為己能。返以成其知會之名耳。無私成私。語出老子。後其身而身先。外其身而身存。不自貴愛其身而身返存。謂聖人但以不矜其知會為己私。故人以知會歸之。其實非無知會也)斯可謂不自有其知。安得無知哉。(此轉破也。謂如所救云。聖人不矜恃知會為己長。斯可謂不自有其知。豈得謂無知哉○下約知無知相答)答曰。(約真諦可亡而知以答。先立理)夫聖人功高二儀(仁也)而不仁。(大仁不仁)明逾日月而彌昏。(功高。謂權智應物。明逾等。謂實智證真。無為而應。故不仁。不慮而知。故彌昏)豈曰木石瞽其懷。其於無知而已哉。(此揀異無情也。若謂無知。不同於木石)誠以異於人者神明。故不可以事相求之耳。(此揀異有情也。若謂有知。不同凡夫)子意欲令聖人不自(矜恃)有其知。而聖人未嘗不有知。(此牒審難意。若以此為得者)無乃乖於聖心。失於文旨者乎。(總責不但不知聖心。抑且失於文旨)何者。(徵釋通難)經云。真般若者。清淨如虗空。無知無見。無作無緣。斯則知自無知矣。豈待返照。(絕無)然後無知哉。(此引經證成般若。但無惑取之知。非絕無真知也。義引大品等文。言真般若者。意在離妄。以體絕纖塵。故清淨如空。以無惑取。故無知無見。以非有為。故無作無緣。以此而觀。則般若真知獨照。知自無知耳。豈待泯絕靈明。然後為無知哉)若有知性空而稱淨者。(此牒轉救也。謂若以般若實實有知。但以性空而稱淨者)則不辨於惑智。(此返責也。謂若以般若性空為淨者。則不辨於惑智。以煩惱亦性空。豈稱般若哉)三毒四倒亦皆清淨。有何獨尊於般若。(若謂般若以性空為清淨者。則三毒四倒亦皆性空。如此則真妄不分。有何獨尊於般若哉)若以所知(真諦)美般若。(此敘轉救也。謂若以所知之真諦清淨。以此美般若為清淨者)所知(真諦)非般若。(真諦為所觀之境。般若為能觀之心。心境不一。故非般若)所知自常淨。故般若未嘗淨。(謂若以真諦清淨美般若者。然在真諦體固常淨。今為所觀。則對待未忘。是般若未嘗淨。則是真諦返累於般若)亦無緣(因也)致淨歎於般若。(若真諦有累於般若。則亦無因以淨致歎於般若。下正釋)然經云般若清淨者。將無(豈非)以般若體性真淨。本無惑取之知。本無惑取之知。不可以知名哉。(此正釋經義也。經云般若清淨者。豈非以般若性淨。本無惑取之知。既無惑取之知。是不可以真知名哉。但無妄知。非無真知也。如此)豈唯無知名無知。知自無知矣。(何獨以絕然無知為無知。良以真知自無妄知耳)是以聖人以無知之般若。照彼無相之真諦。真諦無兔馬之遺。般若無不窮之鑒。所以會而不差。當而無是。寂怕無知。而無不知者矣。",
          "此結答問意也。謂能觀之智無知。所觀之理無相。以無知之智。照無相之理。故心境如如。一道齊平。所以理絕三乘之跡。兔馬。三乘淺深之喻也。而般若照徹無餘。故無不窮之鑒。如此。所以權智應會羣機而不差。觸事當理而無是。實智則寂然不動。怕然無為。故無知而無不知矣。聖智如此。豈以不矜其知為無知。又豈絕然無知為無知哉。0345a11"
        ]
      ],
      "tag": "憨"
    },
    "文": {
      "col": 0,
      "desc": "T1860 肇論新疏，元·文才",
      "name": "T1860_002",
      "notes": [
        [
          361,
          "般若無知論第三",
          "釋茲分二。初明般若。後解無知。初有二種。一本覺般若。即眾生等有智慧是也。大論四十三中翻為智慧。故華嚴出現說。一切眾生皆具如來智慧等。二始覺般若。即六度之一。然通淺深。淺則生空般若。深則法空般若。此復有二。一因修。謂歷位漸得故。二果證。謂覺至究竟故。然始本平等唯一覺也。又有三種。一實相般若。大論指般若是一切諸法實相故。二觀照般若。照理照事故。三文字般若。能顯總持故。而此論中具攝前理。至文隨示。後言無知者。據下論文。總有二義。一揀妄。下云。本無惑取之知等。二顯真有三。一本覺離念。知即非知。故下云。果有無相之知等。二始覺無知。謂窮幽亡鑑撫會無慮故。實相觀照可以例知。三文字無知。謂言說即如文字性空非知非不知。仍曰無知。修文字者不著不離。是名修諸佛智母。應知甚深般若總持一切之功德。出生無盡之法門。破裂煩籠優游正覺也。據梁傳。什公初譯大品。論主宗之以作此論。竟以呈什。什歎曰。吾解不謝子。辭當相揖。論者。謂假文字般若。問答析理。顯示實相等。0212c24"
        ],
        [
          362,
          "夫般若虛玄者。蓋是三乘之宗極也",
          "非知非見曰虛。不有不無曰玄。又四句不攝曰虛。靈鑒亡照曰玄。此牒經也。極至也。三乘之人皆宗尚於般若。各各修學。但機有小大成自乘菩提。故大品聞持品云。善男子欲得阿羅漢果。當習行般若波羅蜜等。0213a17"
        ],
        [
          363,
          "誠真一之無差。然異端之論紛然久矣",
          "正理唯一至當不差。人學般若隨見成殊。各興異論。紛然亂轍久矣。0213a23"
        ],
        [
          364,
          "有天竺沙門鳩摩羅什者。少踐大方研(磨)機(心)斯趣(旨)獨拔(出)於言象之表。妙契於希夷之境",
          "天竺或曰印土身毒。即五印婆羅門國。什公生龜茲。以父鳩摩羅炎本南天竺人。今從本稱。盛德如傳。言象出易經略例。言生於象象生於意。今以言喻能詮。象喻所詮。希夷出老氏。彼云。聽之不聞名曰希。視之不見名曰夷。今喻般若。離名曰希。離相曰夷。按什公本傳。幼學小乘。因悟蘇摩說阿耨達經。復學大方研心此趣。孤出於言象之外。妙合於實相之境。0213a26"
        ],
        [
          365,
          "集異學於迦夷",
          "異學即西域外道。迦夷即佛生之國。亦通指諸國。集猶正也。師在天竺。破邪顯正非一。0213b08"
        ],
        [
          366,
          "揚淳(粹)風(教)於東扇。將爰(語辭)燭(照)殊方。而匿(隱)耀(光)涼土者。所以道不虛應。應必有由矣",
          "殊方謂他國。涼土今西涼也。意謂什公將欲舉揚教風東傳漢地。值符堅失國姚萇僣逆。品光父子心不存法。師蘊其深解無所宣化。在涼十有三年。機緣未會隨世浮沈。是知佛法流行。亦待時節因緣。苟非其時道不虛行。0213b11"
        ],
        [
          367,
          "弘始三年歲次星紀。秦乘入國之謀。舉師(眾)以來之意也",
          "萇子興即位歲號弘始。星紀者。瑤疏云。丑月星紀。今以月紀年也。秦乘下。梁傳云。弘始三年廟庭木生連理。逍遙觀葱變成茞。以為美瑞。謂智人應入。五月秦遣隴西公碩德伐之。隆軍大破。九月品隆上表歸降。故云入國之謀。至十二月末。師至長安。亦可師即什公。西伐之意舉師令來。0213b18"
        ],
        [
          368,
          "北天之運數其然矣",
          "大品云。般若於佛滅後先至南方。次至西方。次至北方大盛。震旦在天竺東北。今什公道通應斯懸記。0213b26"
        ],
        [
          369,
          "大秦天王者。道契百王之端(首)德洽(沾)千載之下。游刃萬機(事)弘道終日。信季(末)俗蒼生之所天。釋迦遺法之所仗也",
          "王謙故不稱皇帝。但比跡三王。以春秋尊周為天王。故百王但汎舉前代帝王。游刃出莊子。庖丁解牛運刃熟妙。故曰游刃。彼云。其於游刃必有餘地矣。謂秦王日親萬事。判決合宜如游刃爾。又復終日弘闡佛法。蒼生即眾生也。謂蒼蒼然而生。亦可蒼者天也。自天生故。蓋隨俗說所天者。王德配天物蒙其廕。昔金河顧命令王臣弘護。今王遵行法門依仗。0213b29"
        ],
        [
          370,
          "時乃集義學沙門五百餘人於逍遙觀。躬(親)執秦文。與什公參正方等",
          "義學即僧史十科中義解。逍遙觀即今秦中草堂寺。本姚置層觀。於此什公入關。遂施為寺。準晉書載紀。王雅信佛法。請師宣譯。師執梵本王執秦文。更互參正譯出諸經(云云)方等者方正平等。即方廣分。0213c11"
        ],
        [
          371,
          "其所開拓者。豈唯當時之益。乃累劫之津梁矣",
          "拓手承物也。亦拓開戶也。謂所譯經論開化一切。非直益於彼時。實為積劫迷津之橋梁。今藏海琅函數越五千。師所出經世多弘讚。0213c18"
        ],
        [
          372,
          "予以短乏。曾(則)廁(預)嘉會。以為上聞。異要始於時(此)也",
          "論主謙云。我以才短智乏。則預什公嘉善之會。殊異要妙之義始於此時。聞自什公故云上聞。0213c23"
        ],
        [
          373,
          "然則聖智幽微深隱難測。無相無名。乃非言象之所得。為試罔象其懷。寄之狂言爾。豈曰聖心而可辯哉。試論之曰",
          "聖智為般若之體離諸分別故云幽微。無相故非義象可思。無名故非言詮可議。故云難測。為試下意云。般若雖非名相可及。將欲悟物。亦當內亡其象。外寄其言以辯之。非言欲言故云狂也。莊子云。使罔象求而得之。舊本作惘字誤。豈曰下理非言辯。但寄言顯之　自下先引經定宗。後九次問答。決擇宗中之意。令無餘惑。0213c27"
        ],
        [
          374,
          "放光云。般若無所有相無生滅相。道行云。般若無所知無所見",
          "略引二經。以示此論之所宗。放光即大品也。但兩譯成異。二十卷云。般若無所有相。第十五云。須菩提般若波羅蜜不生不滅相。道行第一云。般若波羅蜜當何從說。菩薩都不可得見亦不可知。無所有相者。謂有無知見等相皆離故。無生滅相者。非因緣所生故。亦四相不遷三際莫易。餘如下釋。0214a08"
        ],
        [
          375,
          "此辯智照之用。而曰無相無知者何邪。果有無相之知不知之照明矣",
          "初二句反覈。未了之者云。二經正明智用。乃云無知無相。何故後二句略標。若斯之理果然而有(云云)謂真心靈鑒知非知相。無知而知。0214a17"
        ],
        [
          376,
          "何者(徵)夫有所知。則有所不知。以聖心無知故。無所不知。不知之知乃曰一切知",
          "初二句舉妄。謂妄識取境能所昭然。故曰有知。妄見不周故。曰有所不知。何者。且丈夫心主秖臨器身。常侍末那唯持見分。謀臣之識徒知有漏之鄉。五將之能但擊塵囂之境。各有分量知亦何真。故云爾爾。後四句示真。聖心不然。非能所取。故云無知。本覺靈明無法不照。故曰遍知。良以即智之體宛爾無涯。即體之智亦擴充無外。此以諸法本居智內。豈有智內之法而不知邪。佛性論云。以如如智稱如如境(云云)況法依心現無法非心。以即法之心。知即心之法尤遍知也。0214a22"
        ],
        [
          377,
          "故經云。聖心無所知。無所不知信矣",
          "思益經第一云。以無所知故知。0214b06"
        ],
        [
          378,
          "是以聖人虛其心而實其照。終日知而未甞(曾)知也。故能默獨韜光虛心玄(妙)鑒。閉智塞聰而獨覺冥冥(深遠)者矣",
          "文似老書。義意實殊。虛心者。無知相故。實照者。有照用故。終日下知即無知故。默耀下正顯無相。但般若之體了非分別。義言韜默非故藏匿。閉智下智及聰屬能證之智。冥冥屬所證之理。以智證理返照歸寂。亦義言閉塞。獨覺者。智無二故。金光明說。佛果功德唯如如及如如智獨存。如如深窅故曰冥冥。慈恩大師云。性質杳冥。義正同此。上乃權實不分。寂用雙融。實相般若該於一切。自下約二諦以明二智。不二而二。二而不二。即開實相為觀照也。以演宗中悲智相導。一念之力權慧具矣。0214b08"
        ],
        [
          379,
          "然則智有窮(極)幽(深)之鑒。而無知焉。神有應會之用而無慮焉",
          "幽屬於理智。謂真智照無不極。故云窮幽。真諦非相故云無知。神謂俗智。應用難測。故名曰神。應會(者)感之必應不失其會。然水澄月現無心於化。故曰無慮。問大悲大願豈非知邪。答無緣之悲無相之願。皆亡知照也。故金剛三昧經云。若化眾生無生於化。不生無化其化大焉。問觀機審化寧非知邪。答據論本意。但由機感。雖應萬類神亦無思。教合根宜謂言觀審。一論上下此理昭然。0214b22"
        ],
        [
          380,
          "神無慮故。能獨王於世表。智無知故能玄(深妙)照於事外",
          "神用涉有。由無思慮有不能縛。故云世表。王榮也。正智契真由非知故。事不為礙。故云事外。如清涼釋離世間。疏云。處世無染即是離也。0214c04"
        ],
        [
          381,
          "智雖事外未始無事。神雖世表終日域中(世間)",
          "恐人聞實智事外。謂有外證空。故云未始無事。言即事見真。起信云以一切法悉皆真故。又聞權智世表謂不化物。故云爾也。謂處世不染即是世表。0214c09"
        ],
        [
          382,
          "所以俯仰順化應接無窮。無幽不察而無照功。斯則無知之所知。聖神之所會",
          "初二句權用順機。或俯或仰根熟即應。應無窮極正由無思方能如是。俯謂俯就。即隨他意語。如人天小乘等。仰謂企仰。即隨自意語。如實教一乘等。次二句實智覺法法無不盡。非知非見故無照功。後二句雙結正由非知非會。然後能知能會。豈但知而無知等邪。權智亦合云非會之所會。上論二智知即非知非知而知等。下通論智體非有非無。0214c14"
        ],
        [
          383,
          "然其為物(體)也。實而非有虛而不無。存而不可論者。其唯聖智乎",
          "欲揀前義故。再起文勢云然其等。實而非有者。雖真照炳然亦非有相。若取為有則著常見。虛而不無者。雖妙湛杳然。亦非無心。若取為無則落斷見。故般若妙存所以能聖。若無般若亦無聖人。但不可作有無等思議。其唯下結屬。0214c24"
        ],
        [
          384,
          "何者(徵釋)欲言其有無狀無名。欲言其無聖以之靈",
          "無狀等者。名依相立相自緣生。有為法也。且即心覺照不從緣生。何有名相。聖以之靈者。聖人諸法盡覺萬緣普應。正由般若力通難思。何為無邪。0215a02"
        ],
        [
          385,
          "聖以之靈故虛不失照。無狀無名故照不失虛。照不失虛故混而不渝(變)虛不失照故動以接麁(俗事)",
          "虛寂也。正由非有故寂立。非無故照存。正寂而常照。正照而常寂。展轉躡跡釋成前義。混而不渝者。謂正漚和時長在般若。故入生界不染不縛動。以等者。謂正般若時恒漚和故。義利流行。接引凡夫之麁也。0215a07"
        ],
        [
          386,
          "是以聖智之用未始暫廢。求之形相未暫可得",
          "始初萌也。靈智妙存。如何暫時可廢。有無兩非。如何形相可得。言暫者少選不可。況久廢久得邪。非直有無諸相等不得。而智亦無得。言語道斷心行處滅。0215a14"
        ],
        [
          387,
          "故寶積曰。以無心意而現行。放光云。不動等覺而建立諸法。所以聖跡萬端其致(旨)一而已矣",
          "寶積即淨名經。長者子寶積歎佛偈言。佛心意已滅寂也。而現行照也。放光二十九云。不動真際為諸法立處。聖跡教也。屬上二經。古譯句為跡。尋跡得兔如尋句得義。下論直云教跡。致一者。謂在文有異於旨無殊。0215a19"
        ],
        [
          388,
          "是以般若可虛而照(心)真諦可亡而知(境)萬動可即而靜(境)聖應可無而為(心)",
          "以所觀真諦妙絕諸相。但可非知而知故般若照時亡能亡所。唯虛而照。仁王云。正住觀察而無照相。萬動等者。以所應俗諦緣生性空即動而靜。亦令能應權智無為而為。心境前後互舉者。以心由境以境即心皆可。亦順文便不以辭害志。0215a26"
        ],
        [
          389,
          "斯則不知而自知(實)不為而自為(權)復何知哉。復何為哉",
          "前二句結成知為。復何下恐聞知為心復住著。此又遣之。般若菩薩少有所住。便落妄想。著我人相即非菩薩。是故有得無得皆無所得。逈然無寄真智現前。然燈記別而得菩提　自下大段九重問答。決擇前義。前依宗致麁述大綱。今賓主往復令人精曉。故遺民云。此辯遂通。則般若眾流殆不言而會。良有以也。0215b05"
        ],
        [
          390,
          "難曰。夫聖人真心獨朗物物斯照。應接無方動與事會。物物斯照故知無所遺。動與事會故會不失機。會不失機故必有會於可會。知無所遺故必有知於可知。必有知於可知故。聖無虛知。必有會於可會故。聖不虛會",
          "難曰。下至會不失機。謂真智盡諸法之實。權智應萬物之感。皆不失也。會不下四句雲庵達公云。必有能會之智。應可會之機。亦有能知之智。知可知之理。必有下四句言實有知會。0215b14"
        ],
        [
          391,
          "既知既會。而曰無知無會者何邪",
          "正難可知。0215b24"
        ],
        [
          392,
          "能夫忘知遺會者。則是聖人無私於知會。以成其私耳",
          "初句敘救後皆明意。此同老氏。以前文難定有知有會。恐救云。聖人雖有知會。以其不矜不恃。知如不知會如不會。故云忘知遺會。若爾此則但是聖人不以知會自長取為己私。然由虛心不自長。故為物推載。返以知會歸於聖人。是聖人不能迯其知會之長。竟成己私爾。如老氏云。後其身而身先。非以其無私邪。故能成其私。彼意云。後其身不欲私己也。然己讓人。人必讓己。本欲在後而返在前。是成其私耳。0215b26"
        ],
        [
          393,
          "斯可謂(說)不自有其知。安(豈)得無知哉",
          "據上所救。但是聖人不以知會自取為長。豈一向無知會。非無之太甚邪。0215c08"
        ],
        [
          394,
          "答曰。夫聖人功高二儀而不仁(權)明逾(越)日月而彌(益)昏(實)",
          "二儀天地容儀。不仁文出老氏。取義不同。彼云。天地不仁以萬物為芻狗。意云。天地無私。雖以仁恩生成萬物。於物不望其報。如人縛芻為狗亦不責於吠守。此老氏意也。論意云。大權普度功高天地。然無緣之慈化而無化不住化相。故云不仁。如金剛般若云。四生九類我皆度之。功高也。而無有一眾生實滅度者。不仁也。明逾等者。謂實智照理明也。都無分別昏也。又明逾日月遍知也。彌昏無知也。唐光瑤和尚意同。0215c11"
        ],
        [
          395,
          "誠以異於人者神明故。不可以事相求之耳",
          "神妙靈明謂般若也。事相謂人之情見。蓋前所難者。於知不恃於會不矜。但人之情識虛心容物比無相般若。相去邈然。莫認不矜便為般若。顏子虛懷。孟反不伐。未聞入理。0215c24"
        ],
        [
          396,
          "子意欲令聖人不自有其知。而聖人未甞不有知",
          "復審前難。以前云此可謂聖人不自有其知。安得無知哉。故先審定下。責云。0215c29"
        ],
        [
          397,
          "無(不)乃(助辭)乖於聖心。失於文旨者乎",
          "無乃文簡。具云豈不乃也。如外典云。無乃為佞乎。若定有知。豈不乖心違教。0216a03"
        ],
        [
          398,
          "何者。經云。真般若者。清淨如虛空。無知無見無作無緣",
          "大品含受品云。摩訶衍如虛空。無見無聞無知無識。三假品云。般若於諸法無所見等。真揀惑取。清淨者。絕相之義。無知下釋成清淨。作者。造也。謂無師自然之智。非因所作非緣所生。仁王云。無行無緣義同。0216a06"
        ],
        [
          399,
          "斯則知自無知矣。豈待返照然後無知哉",
          "斯者。指所引經。既云般若即是知體。復云無知無見。據斯經意。知即無知。豈待反收其照閉目塞聰。絕聖去智冥如木石。謂無知邪。0216a12"
        ],
        [
          400,
          "若有知性空而稱淨者",
          "假牒彼救也。恐難者別會經意救云。經稱般若清淨者。非謂無知故清淨。約知見性空故云清淨。若云爾者下反詰云。0216a16"
        ],
        [
          401,
          "則不辨於惑智。三毒四倒皆亦清淨。有何獨尊淨於般若",
          "若云。般若有知有見但性空故。經說清淨者。則與惑智不相殊畏。何者。夫三毒四倒皆亦性空。亦應清淨。據此而知不約性空。但約無知無見。惑智即三毒等分別名智。如下云惑智之無。起信六麁智相是惑故。0216a20"
        ],
        [
          402,
          "若以所知美般若",
          "所知者。即真諦。恐難者再救云。經稱清淨。非約能知般若無知無見。但約所知真諦清淨。故美般若云。清淨者。0216a27"
        ],
        [
          403,
          "所知非般若。所知自常淨。故般若未嘗(曾)淨。亦無緣(因)致(得)淨歎於般若",
          "能所宛然。豈所知淨故令能知亦淨。而歎美之。0216b01"
        ],
        [
          404,
          "然經云。般若清淨者。將無以般若體性真淨。本無惑取之知。本無惑取之知。不可以知名哉。豈唯無知名無知。知自無知矣",
          "會經正意。將無者。豈非也。既不約性空及所知。云清淨。然經言清淨。有二意。一智體真淨非知見故。二本無惑取之知故。既本無矣。難以知名。豈唯下恐疑者聞前云。性淨無知。謂兀然絕照。故今遣云。以知無知相故。本無惑取故。知即無知也。0216b04"
        ],
        [
          405,
          "是以聖人以無知之般若。照彼無相之真諦。真諦無兔馬之遺(跡)般若無不窮之鑒",
          "前二句明以智證理。後二句證理之相。兔馬者。即經中所說象馬兔同渡一河。河自無殊得有淺深。以喻三乘同入法性淺深三異。今意云。以所證真諦本無兔馬淺深之跡以軌般若。般若亦無差別無窮之鑒照也。0216b13"
        ],
        [
          406,
          "所以會而不差當而無是(權)寂怕(靜)無知而無不知者矣(實)",
          "不差者。應不失機即前無不為也。無是者。由感而應。本非我故。寂怕下可知。此但決擇前宗中真諦可亡而知等。0216b20"
        ],
        [
          407,
          "難曰。夫物無以自通。故立名以通物。物雖非名果有可名之物。當於此名矣。是以即名求物。物不能隱",
          "此難知及無知二名互違。今且立理文亦易通。意云。名能召物名正則物順。此依世諦名可得物。如召火時不以水應。而論云。聖心無知。又云。無所不知。二名互違也。難實例權。0216b24"
        ],
        [
          408,
          "意謂無知未嘗知。知未嘗無知。斯則名教之所通。立言(名)之本意也",
          "例如寒暖相反得失互非。言教詮量太通之理。立名本意自有定體。0216c02"
        ],
        [
          409,
          "然論者欲一於聖心。異於文旨。尋文(名)求實(心)未見其當",
          "知即無知是一其心。然二名互非。心豈成一哉。0216c06"
        ],
        [
          410,
          "何者。若知得於聖心。無知無所辨。若無知得於聖心。知亦無所辨。若二都無得。無所復論哉",
          "此言若聖心有知。宜置無知。若聖心無知。宜置有知。若聖心雙非。更不復說二名。二名既成互非三義。皆為不可。0216c09"
        ],
        [
          411,
          "答曰。經云。般若義者。無名無說非有。非無非實非虛。虛不失照。照不失虛。斯則無名之法。故非言所能言也",
          "亦義引放光等經。由難者。依名求實二名既違。謂聖心亦異。不知般若非名非相。故引經以遮令忘名會旨。經約遮詮可知。斯則下論辭略釋無名無說。以起下文。0216c14"
        ],
        [
          412,
          "言雖不能言。然非言無以傳。是以聖人終日言而未嘗言也。今試為子狂言辨之",
          "大方便佛報恩經初卷云。法無言說。如來以妙方便。能以無名相法作名相說。0216c21"
        ],
        [
          413,
          "夫聖心者。微妙無相不可為有。用之彌勒不可為無。不可為無。故聖智存焉。不可為有。故名教絕焉",
          "微妙等者。謂聖心離知見作緣等相。非有也。用之下聖心靈妙照理達事。用無怠息非無也。亦擬老氏。既云。妙無諸相。名教詮之不及以通。前難即名求物。物不能隱。今般若非物名依何立。欲以有知無知定名聖心邪。大論三十七云。一切世間著有無二見等。0216c25"
        ],
        [
          414,
          "是以言知不為知。欲以通其鑒。不知非不知。欲以辨其相",
          "言知下若說有知。但欲令人通曉其鑒照之用。豈有知相可取。不知下若說無知。但欲令人知無惑取之相。豈謂一向無知。0217a05"
        ],
        [
          415,
          "辨相不為無通鑒不為有。非有故知而無知。非無故無知而知",
          "謂般若之體無知無見。亦非是無。有鑒有靈。亦非是有。非有下但躡前。釋成知與無知非一非異。方詺中道之心。0217a10"
        ],
        [
          416,
          "是以知即無知無知即知。無以言(名)異而異於聖心也",
          "無以者。戒止之辭。0217a15"
        ],
        [
          417,
          "難曰。夫真諦深玄非智不測。聖智之能在茲而顯",
          "法性深廣玄妙難思。唯般若能證。故此智證真功能顯著。0217a17"
        ],
        [
          418,
          "故經云。不得般若不見真諦",
          "反明也。亦義引般若。智論十八云。解脫涅槃道皆從般若得。0217a20"
        ],
        [
          419,
          "真諦則般若之緣也。以緣求智智則知矣",
          "意云。境為心緣。真即所證之境。智即能證之心。當證理時寧不知邪。0217a23"
        ],
        [
          420,
          "答曰。以緣求智智非知也",
          "上句順難縱之。下句總斷非知。此但斷定非知。下釋不知之所以云。0217a26"
        ],
        [
          421,
          "何者。放光云。不緣色生識。是名不見色。又云。五陰清淨故般若清淨",
          "文即大品義同放光。十六云。不以五陰因緣起識者。是為不見五陰。又云。下即放光第十四文。謂不以五陰為緣。而生般若知識。是名不見者。成無知也。以色即空故智無所得。0217a29"
        ],
        [
          422,
          "般若即能知也。五陰即所知也。所知即緣也",
          "但釋後文。前亦例解。經雖云色意在色空。空與清淨義非異也。欲明真諦無相故。非是般若發知之緣。今且對前問以所知為緣。然後真妄對辨。究竟即顯真諦非緣真智非知。委細開示令人深悟。善巧方便其在于斯。遺民云。宛轉窮盡極於精巧。可謂知言矣。0217b06"
        ],
        [
          423,
          "夫知(心)與所知(境)相與(待)而有相與而無",
          "初句通標。次句妄心妄境相待而起。後句真心真境相待而無。廣如下釋。0217b13"
        ],
        [
          424,
          "相與而無故物莫之有(真)相與而有故物莫之無(妄)物莫之無。故為緣之所起(妄)物莫之有故。則緣所不能生(真)物者通屬真妄心境",
          "初二句躡前。相因顯真心真境寂然無相。後物莫之有下躡前無相。以明真心真境互非緣互非起。以第一義諦空慧雙融本非心境。要人悟入一體義分。空即寂也。境也。慧即照也。心也。涅槃云。第一義空名為智慧。故法爾寂照湛然心境互現。性出自古實非緣生。今亦云緣者。且例妄說義言緣也。次二句躡前。相因顯妄法相待心境昭然。後物莫之無下躡前有相。以明妄心妄境互成緣互成起也。0217b16"
        ],
        [
          425,
          "緣所不能生故。照緣而非知(真)為緣之所起故。知緣相因而生(妄)",
          "真非緣起故。照境之時了無分別。妄自緣生故。能所歷然。外託塵境內生分別故。云知緣等。0217b28"
        ],
        [
          426,
          "是以知(妄)與無知(真)生於所知矣",
          "所知者。通屬真妄二境。妄知因境而生故云生於等。無知亦言生者。實無生相。但因真諦無相。軌則真智成無分別。生者。因也成也。0217c03"
        ],
        [
          427,
          "何者(通徵真妄)夫智以知所知取相故名知(妄)真諦自無相真智何由知(真)",
          "成前相與而有相與而無。妄智以能分別所知之境。一一於境取相。相既妄起心亦妄生。真則反此。故曰無知。對妄辨真義意昭然　自下但廣釋前義。問何故真妄相因非因為緣非緣有知無知邪。0217c07"
        ],
        [
          428,
          "所以然者(通牒)夫所知非所知。所知生於知。所知既生知。知亦生所知",
          "妄心妄境相因相待互各生起。心境迢然有能所知。非所知者。境未對心之時亦未為境。生於知者。由現前境牽起內心。此即因境生心。心故能知。故起信云。復次境界為緣。故生六種相。即六麁事識分別取著。是名知也。知亦生所知者。謂因心生境也。由心分別境亦隨生。知者。分別也。古德云。未有無心境曾無無境心。0217c13"
        ],
        [
          429,
          "所知既相生。相生即緣法。緣法故非真。非真故。非真諦也",
          "初句躡前。文簡。具云。知與所知等。緣法者。若心若境皆因緣所生法也。非真者。緣集故有緣離故無。自無主宰故成空假。中論云。因緣所生法我說即是空等。0217c22"
        ],
        [
          430,
          "故中觀云。物從因緣有故不真。不從因緣有故即真",
          "亦義引彼論破因緣品中之義。但前句證前後句證後。0217c27"
        ],
        [
          431,
          "今真諦曰真。真則非緣。真非緣故。無物從緣而生也",
          "初二句明真諦非緣集之境。後二句承前以明非緣。文亦或脫。應云無物從非緣而生也。下引證中可見。0218a01"
        ],
        [
          432,
          "故經云。不見有法無緣而生",
          "大品云。亦諸經通義。未曾見有一法從非緣而生。無者。非也。如水土是生穀之緣。火石則非。今真諦如空有知如芽種。空不生芽空非緣故。緣真不生知真非緣故。中論云。不從非緣生。亦可無者有無之無。謂但見諸法賴緣而起。未有一法無緣而生。今真諦無緣性。亦不能生般若之知。中論初卷云。如諸佛所說真實微妙法。於此無緣法。云何有緣緣。0218a05"
        ],
        [
          433,
          "是以真智觀真諦。未嘗取所知。智不取所知。此智何由知",
          "初二句明不取。後二句顯非知。真智觀真。若取所知豈成真智。故永嘉大師云。若以知知寂此非無緣知。如手執如意。非無如意手。若此則能所宛然。不唯不成於真智。亦不能證寂。問若竟無知何名般若。亦應不名見道答。0218a14"
        ],
        [
          434,
          "然智非無知。但真諦非所知。故真智亦非知",
          "有所則有能。今所觀真諦離心緣相。故能照般若都無知相。誰謂般若絕於靈照。0218a21"
        ],
        [
          435,
          "而子欲以緣求智。故以智為知(舉難)緣自非緣。於(向)何而求知哉(反責)",
          "已上唯約實智照真。真既非緣智亦非知。中吳集云。上三重問答通辨論旨。下之六重皆次第躡跡而生。0218a24"
        ],
        [
          436,
          "難曰。論云不取者。為無知故不取。為知然後不取邪",
          "設爾何失。0218a28"
        ],
        [
          437,
          "若無知故不取。聖人則冥。若夜遊不辨緇素之異。若知然後不取。知則異於不取矣",
          "二俱有過也。此躡前為難。謂不取順於無知。應合聖心冥暗。如人夜行不辨黑白。有取與知相順。焉有知而不取。以難前云未嘗取所知。又云智非無如。0218b01"
        ],
        [
          438,
          "答曰。非無知故不取。又非知然後不取",
          "雙非。0218b07"
        ],
        [
          439,
          "知即不取故。能不取而知",
          "了了妙存。故曰知。分別已亡故。曰不取。故能下正由遍計久空無明永盡。無能取相也。知由不取取則不知。故云不取而知。若此尚非自知。況取境邪。如永嘉云。若以自知知亦非無緣知。如手自作拳。非是不拳手。0218b09"
        ],
        [
          440,
          "難曰。論云不取者。誠以聖心不物(取)於物。故無惑取也",
          "不取之中含有二難。前約知與不取兩違。此約不取斷滅故二難成異。不取於物者。謂了物本空無我無法。無惑取者。謂二執二障永已斷滅。0218b15"
        ],
        [
          441,
          "無取則無是。無是則無當。誰當聖心。而云聖心無所不知邪",
          "是者。印可於物不謬之稱。當者。印物不謬有主質之。謂若心有取。則定有是物之懷。有是物之懷。則有當物主質之心。今既不取。應無印可之是。當物之主。體用頓絕空空如也。故云誰當等。0218b20"
        ],
        [
          442,
          "答曰。然無是無當者。夫無當則物無不當。無是則物無不是。物無不是故。是而無是。物無不當故。當而無當",
          "有當有是則屬惑取。求當求是。終不得其真是真當。今般若之照。由無惑取是當之情。故能無物不印。印無不是是無不當。豈云一向無是淪其心用。一向無當喪其心主乎。物無不是下謂正是當時。復無是當之相少法當懷。此亦無知即知。知即無知中。一分之義矣。0218b26"
        ],
        [
          443,
          "故經云。盡見諸法而無所見",
          "義引放光等文。彼第十云。菩薩行般若波羅蜜。盡知一切眾生之意等。第三又云。行般若波羅蜜。於諸法無所見等。0218c06"
        ],
        [
          444,
          "難曰。聖心非不能是。誠以無是可是",
          "非不下心能了境。無是下境相既空。是念亦寂。0218c10"
        ],
        [
          445,
          "雖無是可是(縱成)故當(應)是於無是矣",
          "境空心寂不可有是有當。無是無當應可住乎。0218c12"
        ],
        [
          446,
          "是以經云。真諦無相故般若無知者。誠以般若無有有相之知。若以無相為無相。又何累(去聲)於真諦邪",
          "因前決擇。已捨有知之念。故云無有有相之知。復取無相為是。故云。若以無相為無相等。為者。取著之相。累謂負累。亦罪也。意云。真諦無相般若無知心境俱無。住此無中如何。0218c14"
        ],
        [
          447,
          "答曰。聖人無無相也",
          "舉聖總遣。0218c21"
        ],
        [
          448,
          "何者(徵)若以無相為無相。無相即為相",
          "無相雖無。若心有所住即為相矣。焉成無相。智論二十六云。若無相中取相非是無相。學般若者。住有為有火燒。住無為無水沈。水火雖殊滅身無異。若有無俱捨中道不存。是謂住於無所住矣。0218c22"
        ],
        [
          449,
          "捨有而之(往)無。譬猶迯峯而赴壑。俱不免於患矣",
          "避有住無。猶如一人患危峯險峻。翻身赴於溝壑。不知溝壑墜墮亦可傷身。故中論云。大聖說空法為離諸見故。若復見有空諸佛所不化。以著有之見易除。著空之見難治。如火出水中病因藥起。0218c28"
        ],
        [
          450,
          "是以至人處有不有居無不無。雖不取於有無。然亦不捨於有無",
          "處有下二句謂常居有無了無所住。亦不起有無之見。雖不下二句縱成前後不取不離。真無住之般若也。0219a05"
        ],
        [
          451,
          "所以和光塵勞周旋五趣。寂然而往怕爾而來。恬淡無為而無所不為",
          "此約悲智相導。以顯無住。初句文同老氏。彼云。和其光同其塵。今借彼文以明權智涉有化生。周旋者。謂周遍迴旋也。往者。往五趣故即靜而動也。來者。復涅槃故即動而靜也。謂不出生死恒復涅槃。了知生涅無二際故。寂然怕爾恬淡義皆相似意云以。悲導智而往五趣。周遍化生無所不為。然正方便時。智即導悲。見生界空度無所度。故言怕爾而來恬淡無為。此如宗中悲智相導一念之力。權慧兩具處說。0219a09"
        ],
        [
          452,
          "難曰。聖心雖無知。然其應會之道不差。是以可應者應之。不可應者存之",
          "此難權智生滅。先立理也。因前辨析已許二智不住有無。然其下權智應機之時。大小無差。機熟為可應。未熟者與作得度之緣。故云存之。0219a20"
        ],
        [
          453,
          "然則聖心有時而生。有時而滅。可得然乎",
          "正難也。謂應時新生感謝息滅。許如此不。0219a25"
        ],
        [
          454,
          "答曰。生滅者。生滅心也。聖人無心生滅焉起",
          "前二句明妄。謂諸心心所實託緣生。從因緣故墮在生滅。聖心反此。謂三際已破四相兼亡。剎那不萌。何容生滅邪。問若爾應無心邪。下通云。0219a27"
        ],
        [
          455,
          "然非無心。但是無心心耳。又非不應。但是不應應耳",
          "華嚴明佛智廣大。金光談如智獨存。豈曰默然如空無知無照。無心心者。一非妄有故。二寂而能照故。問無心之心應不應機邪。答又非不應等。後得無私但隨感而現。現無現相故云爾爾。即前云。功高不仁等。亦可即寂故。不應即照故應。以今不應之應。顯上無心之心。上體此用。0219b03"
        ],
        [
          456,
          "是以聖人應會之道。信若四時之質(實)直以虛無為體。斯不可得而生。不可得而滅也",
          "大權利物。是唯無感感之必應。信若四時也。直者。正也。虛無者語借老氏。謂般若之體妙湛絕相曰虛。永盡惑取曰無。斯不下結成。賢首大師云。非生非滅四相之所不遷。謂既以至虛為性。則感來非生感謝非滅故云不可得等。0219b11"
        ],
        [
          457,
          "難曰。聖智之無惑智之無。俱無生滅。何以異之",
          "此辨真妄宛殊。而云俱無。俱無則同無生滅。智惑何分。0219b19"
        ],
        [
          458,
          "答曰。聖智之無者無知。惑智之無者知無。其無雖同。所以無者異也",
          "聖心無知無惑取知見等相。故惑智知無。謂妄知緣生其性本空故。其名雖同其義實異。亦猶真俗皆諦。諦義元殊。0219b22"
        ],
        [
          459,
          "何者。夫聖心虛靜。無知可無可曰無知。非謂知無。惑智有知。故有知可無。可謂知無。非曰無知也",
          "謂聖心遍計已斷識相亦滅。更無妄知之體可令無之。但可稱云無知遮也。非謂知無者表也。故永嘉云。其性了然故不同於木石。謂覺照炳然光遍法界。豈曰知無。故荷澤云。知之一字眾妙之門。華嚴十首問佛境界智佛境界知。清涼釋云。知即心體智即心用。此論智知體用雙舍爾。惑智下反前可思。0219b27"
        ],
        [
          460,
          "無知即般若之無也。知無即真諦之無也",
          "若妄知對於妄境。妄知亦心。今以般若照之。妄知性空即是真諦之境。如前云。五陰清淨是也。一心一境二相歷然。如何但認空同。不觀心境各異。0219c08"
        ],
        [
          461,
          "是以般若之與真諦。言用即同而異(初句)言寂即異而同(次句)同故無心於彼此(釋)異故不失於照功",
          "釋前初句。0219c13"
        ],
        [
          462,
          "是以辨同者同於異。辨異者異於同(三俱句)斯則不可得而異。不可得而同也(四非句)",
          "此中具有四句。但文隱難見。今具出之令無餘惑。初句承前雙標心境。為寂用同異所依之法體。心境法也。寂用義也。同異但料簡寂用爾。言心境者。即智而如境也。即如而智心也。不二而二體用恒殊。二而不二心境一觀。華嚴迴向說。未有如外智能證於如。未有智外如為智所證。今論中言寂即如也。言用即智也。正由如智同源體用一致。故得同異自在。四句全現體用。非異曰同。非一曰異。已知大義。言用下第一句即同而異者。謂即體起用用與體殊。下躡釋云。異故不失於照功。言寂下第二句即異而同者。謂攝用歸體體與用一。下躡釋云。同故無心於彼此。彼此目心境也。是以下第三俱句。雙攬前二成此第三爾。是以辨同者。牒前同句。具云。是以辨異而同者。以其但同於異故。云異而同。蓋即異而同也。辨異者。牒初異句。可準前說。亦即同而異也。二句同時。斯則下第四非句承前第三而成。以同於異故非同。異於同故非異具。云不。可得乎異而同同。而異也下。寂用各辨中但敘前二句以。後二句從前生故。0219c16"
        ],
        [
          463,
          "何者。內有獨鑑之明。外有萬法之實。萬法雖實然非照不得。內外相與以成其照功。此則聖所不能同用也",
          "釋前第一句。以心為內。以境為外。獨鑑者。無二之照故。萬法之實者。實謂真實。諸法實相故。又空亦名實。緣生性空故。前云。實相性空緣會一義等。上列心境。萬法下明智證。理唯甚深。般若能照蘊等皆空也。內外下謂如如之境待般若以證。亦由證境成般若之功。此則下結成異句。0220a10"
        ],
        [
          464,
          "內雖照而無知。外雖實而無相。內外寂然相與俱無。此則聖所不能異寂也",
          "釋前第二句。此中內外俱無如智雙泯。寂亦不立。假彼寂同以遣其異。異既遣矣。沒同果海唯證相應。非思非議。文義可解。0220a19"
        ],
        [
          465,
          "是以經云。諸法不異者。豈曰續鳧截鶴。夷(平)岳(山)盈(滿)壑。然後無異哉。誠以不異於異故。雖異而不異也",
          "初句牒經。大品遍學品云。諸法無相非一相。非異相。若修無相是修般若等。此中略引一句也。豈曰下引事會釋。鳧雁屬脛短者。鶴脛長者。意云。諸法差別。如鳧短鶴長等。然性無不空。空故不異。不待續截夷盈然後平等。亦文借莊子。彼云鳧脛雖短續之則憂。鶴脛雖長斷之則悲。誠以下不以諸相為不異。但以性空平等故不異也。0220a24"
        ],
        [
          466,
          "故經云。甚奇世尊。於無異法中而說諸法異。又云。般若與諸法亦不一相。亦不異相信矣",
          "大品六喻品云。世尊云何無異法中。而分別說異相。又云下大品照明遍學品云。諸法無相非一相非異相。合亦無所合。初段不分心境。即同而異。後段心境相對。非一非異。雙證前文。信受者。聖教為定量故量故亦見法無疑故。0220b05"
        ],
        [
          467,
          "難曰。論云。言用則異言寂則同",
          "舉前文為疑起之因。0220b13"
        ],
        [
          468,
          "未詳。般若之內則有用寂之異乎",
          "疑聖心唯一。如何復有寂照之二。二則非一。一則非二。故成相違。0220b15"
        ],
        [
          469,
          "答曰。用即寂。寂即用。用寂體一同出而異名。更無無用之寂而主於用也",
          "初二句相即顯一。次二句釋成非異。正因相即所以非異。同出下語借老氏。亦非寂用復有同出之源。但論主巧用彼。又不可隨文取義。後二句謂即用之寂與用為體。豈有用外單寂而來主於用。邪主猶體也。亦合云又無無寂之用。以賓於寂。約體用重輕假分賓主。0220b18"
        ],
        [
          470,
          "是以智彌昧照逾明(實)神彌靜應逾動(權)豈曰明昧動靜之異哉",
          "心用之外了無寂境故。此但屬般若。成立本論也。謂二智皆即寂而照。正照而寂。豈曰下會歸一致。前約寂用非二。答成一體。此約權實一心寂照雙含。實相般若該心境融真妄。總萬法括二乘。未有一法非實相也。0220b26"
        ],
        [
          471,
          "故成具云不為而過為(權)寶積曰無心無識無不覺知(實)",
          "成具即經正文。0220c04"
        ],
        [
          472,
          "斯則窮神(權)盡智(實)極象外之談也即(就)之明文聖心可知矣",
          "通結上文。謂窮二智之玄理。盡物外之清談也。明文者。謂前所引聖教。依教出理。般若之道可知悟也。然上九翻問答皆決擇前宗。但初翻揀彼儒老不矜不恃遠非般若。中間七次或權實雙明。或二智殊辨。或境智合說。或同異料簡。至於第九。寂用同源歸般若之極致爾。0220c06"
        ]
      ],
      "tag": "文"
    },
    "遵": {
      "col": 0,
      "desc": "X0870 注肇論疏，宋·遵式",
      "name": "X0870_003",
      "notes": [
        [
          91,
          "○般若無知論第三",
          "般若是梵語。此翻曰智。即用也。通權及實。或曰根本後得。如理如量。真智俗智名異義同。或曰在因名慧。在果名智。或曰實則名智。權則名慧。今因果權實通得智名。謂下論中竝不名慧故。知但以一用分二故。今通翻曰智。又前宗本篇中有漚和之名。文云。權慧具矣。今無漚和。則知智通權實。實智照理。權智照事。義分二照。用乃相融。此中實智照前不真空。權智照前物不遷。前既真俗相即。此亦權實互具。言無知者。即體也。體是本覺真心。心性寂滅。本無知覺。故起信云。所言覺義者。謂心體離念。即是如來平等法身。說名本覺。離念本覺。即今無知。為權實體故。六祖以無念為宗。神秀以離念為宗。雖分頓漸。皆明智體無知。所謂如珠發光。光還自照。本覺起照。還契本覺。即理智不二之義。華嚴云。無有智外如為智所證。亦無如外智能證。於如般若無知之旨。良在斯矣。若對上五名一義者。本無實相。法性體上起智用。權則達緣會。實則照性空。權實不二。還照本無等理。為一義也。般若即無知。持業釋。般若無知之論。依主釋。0167b17"
        ],
        [
          92,
          "夫般若(雙標權實)虗玄。",
          "一心真理。虗寂玄微。為權實體。不可以識識智知。故曰無知。0167c14"
        ],
        [
          93,
          "者。",
          "牒上所標。0167c17"
        ],
        [
          94,
          "蓋是三乘之宗極也。",
          "法華云。於一佛乘。分別說三。故一乘法。是彼三乘所宗之至極也。彼一佛乘者。乃今即理之智。為此論所宗。故權實不異。理乃曰般若虗玄。所謂佛之知見故也。故涅槃云。佛性名第一義空。第一義空名為智慧。0167c19"
        ],
        [
          95,
          "誠真一之無差。",
          "誠實也。智體真一。故無差別。經云。唯有一乘法。無二亦無三也。此上標宗。下陳惑。0168a01"
        ],
        [
          96,
          "然異端之論。紛然久矣。",
          "異端者。語出論語。今謂人隨情見解別言差。正明權宗迷實故。異論各興。紛然不一。自佛滅度。權多亂實。故曰久矣。蓋彼境智不談一心為源。故使異論紛紜迷之久矣。0168a04"
        ],
        [
          97,
          "有天竺沙門鳩摩羅什者。",
          "法理無舛。解惑在人。既有異端。何以正之。故今先標其人。人能弘道。道在於人。故對彼惑者。有此正師。故標牒之也。天竺是梵音。正云印特迦。此云月邦。天竺有五。僧傳云此師祖是南天竺之國相。什生於龜茲。出家後往天竺傳道。故稱天竺沙門。言鳩摩羅什。是梵名。具云鳩摩羅者婆。義翻云童壽。高行勝業。備載本傳。此即論主受法之師也。0168a10"
        ],
        [
          98,
          "少踐大方。研幾斯趣。",
          "賤履也。大方語出道經。云大方無隅。今借語以目真理無際故。少年乃心詣至理也。研覈也。幾心也。研覈自心。以般若為趣故。此上歎其所得。下釋其深契。0168a18"
        ],
        [
          99,
          "獨拔於言象之表。",
          "拔出也。言象之表者。易所謂言生於象。象生於意。得象而忘言。得意而忘象。今美什師得智之深意。故出言象之表也。0168a23"
        ],
        [
          100,
          "妙契於希夷之境。",
          "契合也。雖以智合理。理外無智。故契而無契。曰妙契。希夷者。老子云。視之不見。曰夷。聽之不聞。曰希。真理無聲色也。羅什師契理於聲色之外。故上曰少踐大方也。此上序得理智。下明利用。0168b03"
        ],
        [
          101,
          "齊異學於迦夷。",
          "齊者平也伏也。異學者外道也。迦夷者是梵音。具曰迦維羅衛。是天竺一國之名。康疏云。此云赤澤。什師在彼。曾以智慧屈伏外道。又溫宿國中。亦曾摧伏外道。備在本傳。今且舉迦夷之一國。以歎其能耳。0168b08"
        ],
        [
          102,
          "揚淳風以東扇。",
          "淳風者春風也。以其和而發物。而况聖法能隨根起智。言東扇者。彼望此為東。傳風曰扇。此歎什師傳法東流智用之能事。0168b14"
        ],
        [
          103,
          "將爰燭殊方。而匿耀涼土。",
          "爰欲也。燭照也。殊方者彼土來此。是異方故。匿耀者掩智用也。涼土者五涼。當後涼都姑臧。什法師本因此土。前秦符主。諱堅。建元十三年。有德星現。至十八年。遣驍騎將軍呂光。率兵七萬。四伐龜茲。呂光果克龜茲。與什同回。至涼州聞本主。為姚萇所害。光乃竊號關外。遂稱後涼。父子承襲。三主一十八年。什師亦在後涼。一十八載。匿耀韜光餘如傳述。0168b18"
        ],
        [
          104,
          "所以道不虗。應必有由矣。",
          "聖道埀應。必待時至。根熟方可傳通。今十八年。匿耀之所以。蓋欲待時候機故也。0168c03"
        ],
        [
          105,
          "弘始三年歲次星紀。",
          "姚萇崩。子諱興立位。歲號弘始。言星紀者。爾雅曰。丑月曰星紀。丑年曰赤奮。今避文拙。故以月名號年歲。星次在丑位故也。0168c06"
        ],
        [
          106,
          "秦乘入國之謀。舉師以來之。",
          "康引三十國春秋云。後涼呂隆懼南涼北涼所逼。表奏。秦請迎羅什至。五月。秦遣隴西公石德。伐呂隆。隆至。九月歸降。方得迎羅什師入關。謀計也。舉用也。師者眾即兵也。秦王乘呂。有入國之計。故用兵伐涼。迎什來之也。0168c10"
        ],
        [
          107,
          "意也北天之運。數其然矣。",
          "意也者。牒上索意也。前秦取什。後秦次主方來。而上云道不虗應其意。何也。今牒而釋之。大品云。般若於佛滅後。先至南方。次西至北。北方大盛。智論釋云。北方謂北天竺也。今謂北天。般若運數。轉興東國。待時而至。使其然矣。此上序弘始三年為發教之時。下明秦王為待熟之機也。0168c16"
        ],
        [
          108,
          "大秦天王者。",
          "天王者。法天而治。使民歸往故。0168c24"
        ],
        [
          109,
          "道契百王之端。德洽千載之下。",
          "無為而治。不言而自信。不化而自行。蓋王者之道德。今歎秦王道德充實。故契合百王之端。洽潤千載之下。0169a02"
        ],
        [
          110,
          "遊刃萬機。弘道終日。信季俗蒼生之所天。釋迦遺法之所仗也。",
          "王者遊智刃。日應萬機。萬機之暇。弘佛道。於終日季末也。蒼生者。指萬民也。既日應萬機。下民仰之如天。由弘道終日。故使如來遺法倚仗流通也。0169a07"
        ],
        [
          111,
          "時乃集義學沙門五百餘人於逍遙觀。躬執秦文。與什公參定方等。",
          "集聚也。義學者。學習譯場義理之人。逍遙觀者。逍遙園中有觀也。躬親也。秦文者。新舊譯出之經。方等者。大乘般若教也。羅什入關。既重譯諸經。故秦王親執新舊二文。與什公參。竝詳定方等至教之深旨也。0169a13"
        ],
        [
          112,
          "其所開拓者。豈唯當時之益。乃累劫之津梁矣。",
          "秦王與什師。如是開拓於聖道。不獨一時之益。乃累劫為迷津之梁道也。故知般若真旨。自羅什東來。秦王參定。義方明正矣。0169a19"
        ],
        [
          113,
          "余以短乏。曾廁嘉會。以為上聞(句)異要。始於時也。",
          "短乏者謙也。廁預也。嘉會者。譯場也。上聞者。聞般若上義也。昔因異端殊執正理無憑。今預譯場。聞此上義一乘異要甚深之旨。始於時而領悟。0169a23"
        ],
        [
          114,
          "然則。",
          "牒上。雖因羅什。秦王護此聞悟。下云。0169b04"
        ],
        [
          115,
          "聖智幽微。深隱難測。",
          "般若體用幽微。量超數表。故曰深隱。由此故難測度也。0169b06"
        ],
        [
          116,
          "無相無名。乃非言象之所得。",
          "釋上體量難測。無相故不可以象思。無名故不可以言議。0169b09"
        ],
        [
          117,
          "為試惘象其懷。寄之狂言耳。",
          "今論者欲剖聞悟。以示未來。而口不能言。心不能測也。為試者且用也。惘象者語出莊子。但取無心之義。狂言者。蓋無定語也。且用無心之心無言之言。而議論之。以息異端耳。0169b12"
        ],
        [
          118,
          "豈曰聖心而可辨哉。試論之曰。",
          "非謂般若言可詮辨。且論之耳。0169b17"
        ],
        [
          119,
          "放光云。般若(標能觀智)無所有相。無生滅相。",
          "出體也。言所有相者。即現在所有差別相。始自色心。終乎種智。世出世間相。生滅相者。過未相。然般若體性。過去非新生。未來不滅壞。現在無住。異三際常平等。等同虗寂。故曰無相。又中間不住異。故非有前後無生滅。故非無體超四相。量絕百非。故曰無相。譬如虗空。雖畢竟湛寂。而前際無生。後際無滅。般若實體。當知亦然。故心經云。不生不滅。不垢不淨。不增不減。0169b20"
        ],
        [
          120,
          "道行云。般若無所知。無所見。",
          "成立上義。然相則就體而論。知見帶用而辨。辨用歸體。體本自寂。故無知無見也。言所知所見者。所有之知見耳。靈知正見。言用則有。言體則無。今既明體。故曰無知無見也。然由體無知見。故能知見。如鏡無像。故能照物。又有知曰無明。有見曰妄想。智體無。無明亦無。於妄想由離迷妄。故無知見也。又體無相故非色。無知見故非受想行識。出世智體非蘊聚法故也。0169c05"
        ],
        [
          121,
          "此辨智照之用。而曰無相無知者何耶。",
          "辨明也。何耶是疑辭。此論正明能照之智必有知用。而放光曰無相。道行曰無知。見者何所辨耶。0169c14"
        ],
        [
          122,
          "果有無相之知。不知之照明矣。",
          "言果有決定。有此義也。無相之知者。據放光答用也。般若真體。雖三際無相。即體之用。了了常知。不知之照者。據道行答用也。不知者。牒上無知也。雖體無知。見湛然寂滅。而全體之用。靈靈常照。圭山云。正念者。無念而知。若總無知。何名正念。明矣者體必具用。義可見故也。此則據理而答。以實教言體則必具用。談用必全體。如水與波。不相捨離。極成之。理明矣。0169c18"
        ],
        [
          123,
          "何者。",
          "推也。何以無相不知果有知照之義。0170a03"
        ],
        [
          124,
          "夫有所知。則有所不知。",
          "反釋也。夫若有知之體。而起於知用者。必有所不知矣。此則妄心逐事。不能契真。二乘證真。不能達事。皆有知故。有所不知。下順釋。0170a05"
        ],
        [
          125,
          "以聖心無知。故無所不知。",
          "全無知而起用。故用無不知也。然此義猶暗。若謂以無知為體。而起於知用者。則尚惑矣。當了即無知而知。全體為用。方真達般若體用之旨。但言不頓說。理實同時。如全金成像。思之。0170a09"
        ],
        [
          126,
          "不知之知。乃曰一切知。",
          "一切知者。理事雙照。真俗竝觀也。但全體之用。鑒照照用。自然融通。即佛正徧知義也。所以知照之義。在乎無相無知也。0170a14"
        ],
        [
          127,
          "故經云。聖心無所知。無所不知信矣。",
          "信體用不二也。0170a18"
        ],
        [
          128,
          "是以聖人。",
          "般若體用不二得之者曰聖人。0170a20"
        ],
        [
          129,
          "虗其心而實其照。",
          "虗寂心體必具權實照用。0170a22"
        ],
        [
          130,
          "終日知而未甞知也。",
          "終日照理達事。未甞有知也。此述上體用同時。下會歸于體。0170a24"
        ],
        [
          131,
          "故能默耀韜光。虗心玄鑒。",
          "無照而照。曰默。耀韜韞也。藏也。照而無照。曰韜。光心而無心。曰虗心。無鑒而鑒。曰玄鑒。此則默韜虗玄皆體也。耀光心鑒皆用也。此四二而不二者。其唯聖人乎。0170b03"
        ],
        [
          132,
          "閉智塞聰。而獨覺冥冥者矣。",
          "閉塞者。泯絕也。聰者。聽之明也。冥冥者。寂之又寂。故雖體用常俱。而體外無用。若全用歸體。則閉泯智照。杜塞聰明。唯本來覺性冥冥寂寂者矣。故起信云。遠離微細念。故得見心性。心即常住。名究竟覺。即般若無知之義。0170b08"
        ],
        [
          133,
          "然則(承上之辭)智有窮幽之鑒。而無知焉。",
          "上明全體智用。今開用為二。一能窮理曰實。二能應物曰權。權用名神。實用名智。但由所照理事不二而二故。能照智用權實有殊。而其兩用未始抗行。故下論中。多影略言一。學者必須互知。今此先明實智也。窮者。照之極也。幽者。理之深也。實智雖有窮理之鑒能照之體。寂而無知。0170b15"
        ],
        [
          134,
          "神有應會之用。而無慮焉。",
          "次明權用也。神者。不測之義也。應化之心不可知之故。應會者。感屬機。應屬聖。應與感合。曰會。慮則思念也。無知無慮。文別理同。神有感應。合機之用。能應智體。本無念慮。是知照理應機。二用雖殊。無知無慮體一。故曰般若無知也。0170b22"
        ],
        [
          135,
          "神無慮。故能獨王於世表。智無知。故能玄照於事外。",
          "獨王者。唯一故自在也。世表者。處世不滯於世也。無慮而應應。無所滯故。自在不染也。玄照者。照而無照也。事外者。不滯事也。無知而照故。即事而真故。不滯事也。0170c04"
        ],
        [
          136,
          "智雖事外。未始無事。",
          "實智窮理。理不異事。0170c09"
        ],
        [
          137,
          "神雖世表。終日域中。",
          "權雖無慮。終日化生。0170c11"
        ],
        [
          138,
          "所以俯仰順化。應接無窮。",
          "俯下也。仰望也。俯就仰望。隨順應化。接之無窮。蓋權智之用也。0170c13"
        ],
        [
          139,
          "無幽不察。",
          "實理幽深。智無不察。蓋實智之用也。0170c16"
        ],
        [
          140,
          "而無照功。",
          "實體無照。權體無功。二用即體。體無照功也。0170c18"
        ],
        [
          141,
          "然其為物也。",
          "此標牒之辭。上所論般若。體用有無無定。未知照理照事。是何物也。故今牒而指之。0170c23"
        ],
        [
          142,
          "實而不有。虗而不無。",
          "用即體。故實而不有。體即用。故虗而不無。0171a02"
        ],
        [
          143,
          "存而不可論者。其唯聖智乎。",
          "存在也。般若體用。常在乎不二。而不可以有無議者。其唯聖智如是也。0171a04"
        ],
        [
          144,
          "何者。",
          "推之。何故不可以有無論耶。0171a07"
        ],
        [
          145,
          "欲言其有。無狀無名。",
          "體無形狀。離心緣相。體絕言說。離名字相。故不可言。其定有。此釋上實而不有。0171a09"
        ],
        [
          146,
          "欲言其無。聖以之靈。",
          "聖人用此照理達事。未甞間息。故不可言其定無。此釋上虗而不無。0171a12"
        ],
        [
          147,
          "聖以之靈。故虗不失照(全體具用)無狀無名。故照不失虗(全用是體)照不失虗。故混而不渝。",
          "混融也。渝變也。用即體。則混融常虗。虗而不改。此明不變之體終古不忒也。0171a16"
        ],
        [
          148,
          "虗不失照。故動以接麤。",
          "麤者對細之假相也。對上理體細妙故。指今事用麤著也。體即用。則運動接照而無窮。此明隨緣之用不失也。0171a19"
        ],
        [
          149,
          "是以聖智之用。未始暫廢。求之形相。未暫可得。",
          "言體則無知無慮。言用則照理照事。此二者言異而義同。故體用存而不可以有無論者。聖智之謂也。0171a23"
        ],
        [
          150,
          "故寶積曰。以無心意而現行。",
          "淨名經長者偈讚集起曰。心分別名意。唯第八賴耶。集諸種子。起現行。故獨得心名。第七緣內前六緣外。皆分別故。俱受意名。八識竝妄。真智離妄。故無心意也。又無心即無知也。無意即無慮也。而現行者常行照鑒故。0171b03"
        ],
        [
          151,
          "放光云。不動等覺而建立諸法。",
          "平等本覺之體。動則曰無明。不動曰究竟覺。覺體雖寂。而能建立境智諸法。此上二經竝證體用不二也。0171b09"
        ],
        [
          152,
          "所以聖迹萬端。其致一而已矣。",
          "聖智之迹。雖有知無知。有應無應。言量萬端。不二之理。本一如。言水則靜。言波則動。波水動靜。本乎一致。此則起信真如生滅二門不二。本乎一心也。又依真如門修止。即今實智。依生滅門修觀即今權智。止觀依一心而起。即今無知無慮。為權實所依也。今會用歸體。故曰致一也。0171b13"
        ],
        [
          153,
          "是以般若可虗而照。",
          "實智無知而知也。0171b21"
        ],
        [
          154,
          "真諦可亡而知。",
          "真境無相。故實智亡相而知也。此結實智對不真空論也。0171b23"
        ],
        [
          155,
          "萬動可即而靜。",
          "事用不一。故曰萬動。各不失緣生此相。故即動而靜。0171c02"
        ],
        [
          156,
          "聖應可無而為。",
          "權智無應而應也。此結權智。對上物不遷論。所以能照之體雖一。由對二境。發所有二。既真俗二境相即。故權實二智亦融。0171c05"
        ],
        [
          157,
          "斯則不知而自知。不為而自為矣。",
          "先指上所結曰斯。則權實相本無知無為。全體具用。法爾曰靈。知妙應故。分權實耳。0171c09"
        ],
        [
          158,
          "復何知哉。復何為哉。",
          "知照為作。但由體具。非謂體有。故曰般若無知也。0171c12"
        ],
        [
          159,
          "難曰。夫聖人(約人辨智)真心獨朗。物物斯照。",
          "實智靈照真心。用常獨朗。不因境有。故觸事而真。故曰物物斯照。0171c24"
        ],
        [
          160,
          "應接無方。動與事會。",
          "權智應感。無定動用。皆與俗諦事相合宜也。0172a03"
        ],
        [
          161,
          "物物斯照。故知無所遺。動與事會。故會不失機。",
          "無遺者。順理也。實智能知。知必順理。權智能會。會必合機。0172a05"
        ],
        [
          162,
          "會不失機。故必有會於可會。",
          "必有能會之智。可以應會。0172a08"
        ],
        [
          163,
          "知無所遺故。必有知於可知。",
          "定有能知之智。可以鑒知。0172a10"
        ],
        [
          164,
          "必有知於可知。故聖不虗知。必有會於可會。故聖不虗會。",
          "不虗者。定有也。0172a13"
        ],
        [
          165,
          "既知既會。而曰無知無會者。何耶。",
          "無會者。即前無慮。據上所釋。定有知會。而前所謂無知無會。其義何耶。0172a15"
        ],
        [
          166,
          "若夫忘知遺會者。",
          "牒所解也。忘捨也。遺棄也。意謂實智有知。權智有會。但捨棄知會之心。故曰無知無會者。0172a19"
        ],
        [
          167,
          "則是聖人無私於知會。",
          "私己也。自取知會之巧。曰私。聖人無此。故知而曰無知。會而曰無會。此上縱。下奪云。0172a22"
        ],
        [
          168,
          "以成其私耳。",
          "若以無知無會為聖。智者雖不取知會之功歸己。返欲取無知會之功歸己也。下難。0172b01"
        ],
        [
          169,
          "斯可謂不自有其知。安得無知哉。",
          "聖智若此。權實定有知會。但可謂之。不自取知會耳。何得無知會耶。0172b04"
        ],
        [
          170,
          "答曰。夫聖人功高二儀(前曰神有應會之用)而不仁。",
          "前曰而無慮焉。功者業用也。高者勝過也。不仁者。老子云。天地不仁。以萬物為芻狗。王𢏺云。仁者必造立。施化有恩。有為天地。任自然無為無造。故不仁也。今聖人權智化生。令獲出世之益。故其功勝過二儀。而能應之。體本無思慮。故同天地之不仁。此答上權智即應而無慮也。0172b08"
        ],
        [
          171,
          "明逾日月(前云智有窮幽之鑒)而彌昏(前云而無知焉)。",
          "逾過也。彌極也。日月唯明於世事。而聖人實智。能契出世真理。故有過日月之明。而能照之。體本自無知。極同於昏昧。此答上實智即知而無知也。此上竝答以全用之體。0172b15"
        ],
        [
          172,
          "豈曰木石瞽其懷。其於無知而已哉。",
          "此責執無之見。木石者。無靈覺之物。瞽者盲也。前云無知無慮。豈同此之無知也。0172b20"
        ],
        [
          173,
          "誠以異於人者神明。故不可以事相求之耳。",
          "此責執者之見。誠實也。人者。心多妄計。前云有知有應。異於人之妄想也。者字再牒上也。未詳般若有知之義。如何下云神明故。則不測靈明之智。不可實以知。會事相而推求之也。此責前難者。以有難無。乃謂般若有同。人心無同。木石豈知體用同時不二之旨也。0172b23"
        ],
        [
          174,
          "子意欲令聖人不自有其知。而聖人未甞不有知。",
          "子意者。彼難者之意解也。欲令者。解心使之故。未甞不有知者。語反。順合云定有知也。般若本無此理。蓋難者意解。謂令聖人雖不自取知會之功。而謂聖心定有知應也。此即牒上問者邪解也。據此文倒。順合云子意謂聖人定有知而不自有其知也。0172c06"
        ],
        [
          175,
          "無乃乖於聖心。失於文旨者乎。",
          "無乃者斥辭。乖迷也。一迷聖心量。二失聖教量。故責也。0172c13"
        ],
        [
          176,
          "何者。",
          "徵也。求上二量也。0172c16"
        ],
        [
          177,
          "經云。真般若者。清淨如虗空。無知無見。無作無緣。",
          "此引大品經。出聖教為量也。真般若者。牒二智實體也。清淨者。體性寂滅也。如虗空者。舉喻也。智體猶如太虗。無生滅染淨故。無知等者。釋上清淨義。靈知真見。實用則有。體性則無。作為緣慮。權用則有。體性亦無。既明真體清淨。故知本無此四也。0172c18"
        ],
        [
          178,
          "斯則知自無知矣。",
          "此顯理量也。據斯經義。則知權實知會之體。本自無知。此理極成。論中多單明實智會而無會。文影略耳。下皆類此。0172c24"
        ],
        [
          179,
          "豈待返照。然後無知哉。",
          "結非前解也。豈謂聖智實有。知會返照。不欲取之。而說無知無慮耶。0173a04"
        ],
        [
          180,
          "若有知性空而稱淨者。",
          "疑者因見上經云真般若者清淨如虗空等文。乃疑云。般若必有知。但為智性本空故。稱清淨無知等也。故今牒之。0173a11"
        ],
        [
          181,
          "則不辨於惑智。",
          "無明心能知名義。曰惑智。此智定是有。知因境而有。離境則無。性本自空。聖智同此。何以辨別。0173a15"
        ],
        [
          182,
          "三毒(貪瞋癡)四倒(無常樂我淨而計有者也)皆亦清淨。",
          "皆者總也。三毒四倒七種顛倒。皆從妄想心生。既屬有知。性空亦可同般若清淨之義。0173a18"
        ],
        [
          183,
          "有何獨尊淨於般若。",
          "尊崇也。若惑倒同聖智者。何故經中唯推崇清淨無知。在於真般若也。故知聖教獨崇之智非同惑妄。有知性空也。0173a21"
        ],
        [
          184,
          "若以所知美般若。",
          "疑者又云。聖智雖非性空。而定屬有知。但由照真境。時所知無相。故美歎智。曰無知矣。故今先牒之。0173b01"
        ],
        [
          185,
          "所知非般若。",
          "此句定宗。所知曰境。般若曰智。境智定不同。故曰非也。0173b05"
        ],
        [
          186,
          "所知自常淨。故般若未嘗淨。",
          "此據疑者定義也。疑者曰。智定有知。境屬無相。故今定云。據汝所說。則所知之境常清淨。無相般若之智常自有。知未可曰清淨無知也。0173b08"
        ],
        [
          187,
          "亦無緣致淨。歎於般若。",
          "緣由也。致立也。若如疑者所見。則經中秖合歡真境。清淨亦無緣由。立清淨之言。歎真般若也。今以經中唯歎般若之文為正量。驗知非因境無相。而曰智無知也。0173b12"
        ],
        [
          188,
          "然。",
          "領前之辭。所疑既非清淨無知之義。何也。故今領之。0173b17"
        ],
        [
          189,
          "經云。般若清淨者。(此再牒前經也)將無以般若體性真淨。本無惑取之知。",
          "將無以者。擬議經旨之語。本覺為智。所依曰體。體不可改。曰性。體即性也。真淨者。非離染之淨。乃真實清淨也。本無惑取之知者。釋無知見等。為真淨義。非離惑取。曰無知。乃本自無惑取。故曰無知。0173b21"
        ],
        [
          190,
          "本無惑取之知。不可以知名哉。",
          "結成清淨無知之義。破前二疑也。0173c02"
        ],
        [
          191,
          "豈唯無知名無知。知自無知矣。",
          "豈唯體無知。故名清淨無知。有知之用。常自清淨無知也。故體用不二。旨清淨故。故曰真般若者清淨無知等也。0173c04"
        ],
        [
          192,
          "是以聖人以無知之般若。照彼無相之真諦。",
          "即體之實智。照真諦理也。然此但契自智之無知。即照無相之真諦。非謂外有真諦。以為所照決定之相。0173c09"
        ],
        [
          193,
          "真諦無兔馬之遺。般若無不窮之鑒。",
          "兔馬之遺者。婆沙論以三獸渡河。入水深淺。即象馬兔喻三乘。造理有異。二乘滅妄求真。如兔馬之涉水。泛身而過。菩薩證唯心。故如大象之渡河。截流而過。故無兔馬。遺餘一乘智鑒。無不窮極故。前曰智有窮幽之鑒而無知焉。此中更合云。聖人以無慮之般若。照彼不遷之俗諦。俗諦無兔馬之遺。般若無不應之用。既一體二用。約境義分境。既真俗相融。用亦權實不二。故論中或秖就一用顯體。已知二用不殊故。今影略出之。以顯前神有應會之用。而無慮焉之正義也。0173c13"
        ],
        [
          194,
          "所以會而不差。當而無是。",
          "此明前權智。所以能會之智不差機宜。言當是者。以取應對之義。至下文辨。應而無慮。故曰當而無是。0173c24"
        ],
        [
          195,
          "寂怕無知。而無不知者矣。",
          "此明前實智。所以虗寂淡怕故無知。無知之知。無不鑒知。0174a04"
        ],
        [
          196,
          "難曰。",
          "此躡上答中名異。故今立難。下自指前。0174a09"
        ],
        [
          197,
          "夫物無以自通。故立名以通物。",
          "通者。運用不滯也。凡世立物名。蓋為物不能運用。故以名。召令得通用。0174a11"
        ],
        [
          198,
          "物雖非名。果有可名之物。當於此名矣。",
          "雖體與名殊。定有對名之體。而對於名。0174a14"
        ],
        [
          199,
          "而論云聖心無知。又云無所不知。",
          "此即牒上寂怕無知而無不知之文。以有無名異。為難也。0174a18"
        ],
        [
          200,
          "意謂(難者之意所謂也)無知未甞知。知未甞無知。",
          "嘗曾也。聖心若定無。則未曾是有。定有則未曾是無。乃可歸一也。0174a21"
        ],
        [
          201,
          "斯則名教之所通。立言之本意也。",
          "若有所定。方是能詮名教。通運所詮智體。亦是立言召物之本意。理當如是。0174a24"
        ],
        [
          202,
          "然論者。(者即指作論之人也)欲一於聖心。異於文旨。尋文求實。未見其當。",
          "論主欲明聖心體一。而立文有異。尋此異文。而求一體者。未見有當名之定體。0174b04"
        ],
        [
          203,
          "何者。",
          "徵也。何謂尋文求實。未見其當。0174b07"
        ],
        [
          204,
          "若知得於聖心。無知無所辨。",
          "辨明也。有知得聖心。無知明何事。0174b09"
        ],
        [
          205,
          "若無知得於聖心。知亦無所辨。",
          "無知得聖心。知名明何物。0174b11"
        ],
        [
          206,
          "若二都無得。無所復論(平呼)哉。",
          "若二名都不得聖心。未審前云無知無所不知。復論何事耶。又解。二名既不得聖心。未審對何名論召聖心之體耶。0174b13"
        ],
        [
          207,
          "答曰。經云。般若義者。",
          "標也。般若體上合宜道理。曰義。0174b17"
        ],
        [
          208,
          "無名無說。",
          "名詮自性。說謂言說。言由名起。既不可名召。故非言說所及也。0174b19"
        ],
        [
          209,
          "非有非無。非實非虗。",
          "非有無者。轉釋上無名說義。智性不同。妄心有知。又不同木石無知。故不可以有無名言詮召也。非虗實者。轉釋非有無義。非實故非有。非虗故非無也。0174b22"
        ],
        [
          210,
          "虗不失照。",
          "故非虗無體即用也。不變即隨緣義。0174c03"
        ],
        [
          211,
          "照不失虗。",
          "故非實有用即體也。隨緣即不變義也。0174c05"
        ],
        [
          212,
          "斯則無名之法。故非言所能言也。",
          "斯則者。牒歸上也。由體用不二故非實非虗。由非虗實故非有無性。非有無不可以名召。故曰無名之法。名既不立。如何言也。前難者以名求體。殊未達名所不能召也。經義如此。故當信之。0174c07"
        ],
        [
          213,
          "言雖不能言。然非言無以傳。",
          "妨云。既言般若義者無名無說等。何以云言所不能言也。故今上句領前也。然者。躊躇經旨也。理非詮表。無以傳達於後人。故當藉言也。故曰般若義者等文也。故知為物有說。理實無言。0174c13"
        ],
        [
          214,
          "是以聖人終日言而未嘗言也。",
          "聖人言教。終日說般若非有非無等。但為破惑。畢竟於般若。未嘗有言說可及。涅槃云。始從鹿野苑。終至跋提河。如是二中間。未曾說一字。何謂經有可言也。此上釋妨。下述意。0174c18"
        ],
        [
          215,
          "今試為子狂言辨之。",
          "狂言者。不定之語也。且為難者。以不定之語詮辨之。非謂般若可說也。0174c23"
        ],
        [
          216,
          "夫聖心者。",
          "標聖人所證一心。具權實體用故。0175a03"
        ],
        [
          217,
          "微妙無相。不可為有。",
          "妙者。不可思議也。妙之至妙。故曰微妙。妙體無相為是也。不是有故。此明心體也。0175a05"
        ],
        [
          218,
          "用之彌勤。不可為無。",
          "彌勤之用。照理達事。不是無也。此明全心之用。0175a08"
        ],
        [
          219,
          "不可為無。故聖智存焉。",
          "智用雙存。故非無。0175a10"
        ],
        [
          220,
          "不可為有。故名教絕焉。",
          "不可思議絕名教詮表。故非有也。前經所謂無名無說非有非無。蓋體用同時。不在二邊也。0175a12"
        ],
        [
          221,
          "是以。",
          "牒上體用二言。釋言下之意。0175a16"
        ],
        [
          222,
          "言知不為知。欲以通其鑒。",
          "前言無所不知。非謂智是有知。蓋欲通般若有鑒照異於木石。所以言知也。0175a18"
        ],
        [
          223,
          "不知非不知。欲以辨其相。",
          "前云寂怕無知。非謂智屬無知。蓋欲辨般若之體相異於妄心。所以言無知也。0175a21"
        ],
        [
          224,
          "辨相不為無。通鑒不為有。",
          "正破難者執前知無知之言也。辨體相故說無。不是定無。通鑒照故說有。不是定有。前何以將知無知定名。取定聖心耶。0175a24"
        ],
        [
          225,
          "非有故知而無知。",
          "此下正示非有非無之義。非有故牒上通鑒不為有也。謂靈知即無知。故所以有非有也。0175b04"
        ],
        [
          226,
          "非無故無知而知。",
          "非無故。牒上辨相不為無也。謂無知之體。本自靈明。所以無非無也。良由體用知無知。雖有二言。定無二相。0175b07"
        ],
        [
          227,
          "是以知即無知。無知即知。",
          "全用是體。全體是用。如波即水。全水即波也。0175b11"
        ],
        [
          228,
          "無以言異。而異於聖心也。",
          "無以者勸不可也。不可見前知無知言異。而謂聖心體用有異也。0175b13"
        ],
        [
          229,
          "難曰。夫真諦深玄。非智不測。",
          "前云以無知之般若。照彼無相之真諦。躡前先敘境智。反難無知也。真諦無相。唯般若實智能照。自餘不可測度。故曰深玄。0175b18"
        ],
        [
          230,
          "聖智之能。在茲而顯。",
          "茲此也。由見真諦。故名聖智。般若功能在此真諦。而表顯之也。故前曰真諦無兔馬之遺。般若無不窮之鑒也。0175b22"
        ],
        [
          231,
          "故經云。不得般若。不見真諦。真諦則般若之緣也。",
          "經文語反。由般若故見真諦也。下成立經意云。真諦為發智之緣。故聖智之能。在茲而顯也。0175c02"
        ],
        [
          232,
          "以緣求智。智則知矣。",
          "若以所知發智之緣。推求於智。既有照理之能。智必有知。何謂無知般若耶。0175c06"
        ],
        [
          233,
          "答曰。以緣求智。智非知也。",
          "此明境智體同用異。且夫真境無相。真智無知。今上句約用縱之。以真境求真智。義分能所。下句就體奪之。真智無知。即真境無相。理實無二。故清涼曰。智體無自。即是證如。0175c10"
        ],
        [
          234,
          "何者。",
          "推也。以緣求智。何以智無知耶。下釋。0175c15"
        ],
        [
          235,
          "放光云。不緣色生識。是名不見色。",
          "緣慮也。識以了別為義。經是簡妄反顯也。般若不緣慮色境。而生分別妄識。是名般若不見色。若妄心則緣境生分別。故有知見。則知難者以智為知。乃是認妄為真也。0175c17"
        ],
        [
          236,
          "又云。五陰清淨故。般若清淨。",
          "此明真心真境。五陰者。色受想行識也。清淨者。本來寂滅也。色心既本自清淨。故般若體性清淨無知。故曰以緣求智。智非知也。0175c22"
        ],
        [
          237,
          "般若即能知也。五陰即所知也。所知即緣也。",
          "此三也字。前二即結上經旨。後一生起後文。以前段就體。推釋同虗。此中約用結顯。義分能所境智。經云般若清淨。即靈智無知。以為能覺也。五陰清淨。即真境無相。以為所覺也。此乃以無知心覺心無知。義分能所耳。下句生後。此所知無相境。即發般若之緣。由了無相。方曰般若故。0176a02"
        ],
        [
          238,
          "夫知與所知。",
          "總標也。真妄二智。俱曰能知。真妄二境。同名所知。0176a11"
        ],
        [
          239,
          "相與而有。",
          "相者當對也。與者共同也。難者以妄智對境。有知有相故。0176a14"
        ],
        [
          240,
          "相與而無。",
          "主家義分能所。以真智對境。無相無知故。0176a17"
        ],
        [
          241,
          "相與而無。故物莫之有。",
          "物者指心境也。莫之者不能也。真心境則同虗寂。不能令有。0176a19"
        ],
        [
          242,
          "相與而有。故物莫之無。",
          "妄境智則同幻有。故不能令無。0176a22"
        ],
        [
          243,
          "物莫之無。故為緣之所起。",
          "妄境為緣。起妄智之分別。0176a24"
        ],
        [
          244,
          "物莫之有。故則緣所不能生。",
          "生起也。所緣之境本寂。不能起能緣之分別。0176b02"
        ],
        [
          245,
          "緣所不能生。故照緣而非知。",
          "境寂心空。故智照所緣。而無分別。故上答曰。以緣求智。智非知也。此釋真境智義也。0176b04"
        ],
        [
          246,
          "為緣之所起。故知緣相因而生。",
          "境為緣而起智。是以能知所緣相因。而生分別。故古者曰。未有無心境。曾無無境心。此即上難者云。以緣求智。智則知矣。0176b07"
        ],
        [
          247,
          "是以知(妄智)與無知(真智)生於所知矣。",
          "迷自心則執境。智起起之則境生。故妄智曰有知。了自心則境寂智虗。虗而不二。故真智曰無知。故前問者答者俱曰。以緣求智而有知無知之異者。葢迷悟之不同耳。0176b11"
        ],
        [
          248,
          "何者。",
          "真妄二智。何故同生於所知。0176b16"
        ],
        [
          249,
          "夫智以知所知。取相故名知。",
          "妄智迷真心外取相。故知妄境也。0176b18"
        ],
        [
          250,
          "真諦自無相。真智何由知。",
          "真境本無相。真智以無知而契之。故曰何由知。0176b20"
        ],
        [
          251,
          "所以然者。",
          "有何所以故。妄境智則知緣相因而生。真境智則緣所不能生耶。故今牒之。0176b23"
        ],
        [
          252,
          "夫所知非所知。所知生於知。",
          "事本空無。妄智不達。執之為有。見有境起。0176c03"
        ],
        [
          253,
          "所知既生知。知亦生所知。",
          "因有境故智有分別。故有知心起。0176c05"
        ],
        [
          254,
          "所知既相生。相生即緣法。",
          "既境智相生。即智為境。緣境為智。緣緣會故。境智同有也。0176c07"
        ],
        [
          255,
          "緣法故非真。非真故非真諦也。",
          "從緣境智。緣會則生。緣離則滅。既有生滅。故非真諦門中乃稱為妄也。0176c10"
        ],
        [
          256,
          "故中觀云。物從因緣有故不真。",
          "證上可知。然中觀文有二句。上句證前。後句標下。故今取義便。隔彼後句。以就次科也。0176c13"
        ],
        [
          257,
          "不從因緣故即真。",
          "不藉因緣生者。方名真實。標也。0176c17"
        ],
        [
          258,
          "今真諦曰真。真則非緣。",
          "今真諦門中無相真境。與無知真智。是一心理智。假分能所。實無二相。既非緣有。故名曰真。0176c19"
        ],
        [
          259,
          "真非緣故。無物從緣而生也。",
          "無物者。境智既不從緣。故無緣生境智之物。所以曰真境真智無相無知也。0176c22"
        ],
        [
          260,
          "故經云。不見有法無緣而生。",
          "真諦門中不見有境智之法。故無緣相生。上明所以竟。故知難者以妄問真也。簡辨已畢。0177a01"
        ],
        [
          261,
          "是以真智觀真諦。未甞取所知。智不取所知。此智何由知。",
          "述成真境智。顯無知義。以真智不取。是觀真諦義也。0177a06"
        ],
        [
          262,
          "然。",
          "領前也。智實無知。如何契理。下釋云。0177a09"
        ],
        [
          263,
          "智非無知。但真諦非所知。故真智亦非知。",
          "智非木石之無知。但以照而常寂。故真境無外相。即真智無知爾。0177a11"
        ],
        [
          264,
          "而子欲以緣求智。以智為知。",
          "此牒彼執妄也。0177a14"
        ],
        [
          265,
          "緣自非緣。於何而求知哉。",
          "責迷真也。緣自非緣者。真境非外緣。如何發智有所知耶。0177a16"
        ],
        [
          266,
          "難曰。論云不取者。",
          "牒上云智不取所知者。下敘難。0177a21"
        ],
        [
          267,
          "為無知故不取。為知然後不取耶。",
          "開兩關也。0177a23"
        ],
        [
          268,
          "若無知故不取。聖人則冥若夜遊。不辨緇素之異。",
          "夜遊者。暗中遊方也。緇素者黑白也。智若無知故不取。則聖心冥昧。如人夜行。豈辨境之黑白。何以云真智觀真諦也。0177b01"
        ],
        [
          269,
          "若知然後不取。知則異於不取矣。",
          "若先有知。後不取者知。即是取與不取有異也。0177b05"
        ],
        [
          270,
          "答曰。非無知故不取。又非知然後不取。",
          "不同木石無知。不同妄想有知。木石絕靈照。妄想居攀緣。般若離二邊。故非此二。而說不取也。0177b08"
        ],
        [
          271,
          "知則不取。故能不取而知。",
          "當靈鑒時。本無取著。故能無取著。而長鑒知。如摩尼珠現色。而本無色。無色而常現色。此乃全用即體。全體即用。知與不取。說雖前後。義實同時。0177b12"
        ],
        [
          272,
          "難曰。論云不取者。",
          "牒上知即不取故能不取而知。正難下句也。0177b18"
        ],
        [
          273,
          "誠以聖心不物於物。故無惑取也。",
          "誠實也。不物於物者。不執著於物也。既無惑取之心。故曰不取。0177b20"
        ],
        [
          274,
          "無取則無是。無是則無當。",
          "是當之言。諸教少有。此論多說。凡兩物不別曰相是。敵對曰相當。亦猶彼此是非。蓋諸法相望之通名也。今明境智相當相是。故曰是當。今且以智曰是。境曰當。釋之。真心真境同虗。故無惑取。則無心是於境。亦無境當於心。此即難者解不取之義如是也。0177b23"
        ],
        [
          275,
          "誰當聖心。而云聖心無所不知耶。",
          "誰何也。心無是境無當。但可云無知。以何當對於聖心。而云有知耶。無所不知者。有知也。此則難者但解其體。未達其用。故為此難也。0177c06"
        ],
        [
          276,
          "答曰。然無是無當者。",
          "前難者雖解境智同真。未了即真心境。故以無難有。今先領彼所解。後示體用雙融之正義也。0177c11"
        ],
        [
          277,
          "夫無當則物無不當。",
          "境則全理之事。無相即相。0177c15"
        ],
        [
          278,
          "無是則物無不是。",
          "智亦全體之用。無知即知。0177c17"
        ],
        [
          279,
          "物無不是。故是而無是。",
          "知即無知。照而常寂也。0177c19"
        ],
        [
          280,
          "物無不當。故當而無當。",
          "相即無相。觸事而真也。若達此知無知不二。相無相無殊。則何疑前云知即不取。故能不取而知也。0177c21"
        ],
        [
          281,
          "故經云。盡見諸法(境智歷然)而無所見者也。",
          "智無知。境無相故也。0178a01"
        ],
        [
          282,
          "難曰。聖心非不能是。誠以無是可是。",
          "此因上是而無是。故立此問。遣後人之餘疑。非不能是者。即上云是也。顯有照鑒故。誠以無是可是者。意謂由境無所是之相可是。故曰無是。此以有知之智。對無相之境。故曰是而無是也。0178a05"
        ],
        [
          283,
          "雖無是可是。",
          "境雖無相可是。0178a10"
        ],
        [
          284,
          "故當是於無是矣。",
          "聖心必須對於無相境也。0178a12"
        ],
        [
          285,
          "是以經云。真諦無相故般若無知者。",
          "經是正義。真諦無有無相。般若無有無知也。今難者解意不同。意謂般若是有知。由真諦無相可得故。般若無知也。者之一字牒經。不自領經意云。0178a14"
        ],
        [
          286,
          "誠以般若無有有相之知。",
          "信經所說。則知般若定無照有之知。以顯唯照無也。0178a18"
        ],
        [
          287,
          "若以無相為無相。有何累於真諦也。",
          "為是也。累滯也。聖心若以無相真境。是無相者。有何所以。滯累此真諦。而取於無相耶。雖不取有。少異於妄心。若取於無。何殊於斷見。故此疑問也。0178a21"
        ],
        [
          288,
          "答曰。聖人無無相也。",
          "般若無此取無相之心也。0178b02"
        ],
        [
          289,
          "何者。",
          "推上也。0178b04"
        ],
        [
          290,
          "若以無相為無相(牒問)無相即為相。捨有而之無。",
          "若以無相是無相。無相即是相。雖捨有相而著無相。豈為智照也。0178b06"
        ],
        [
          291,
          "譬猶逃峯而赴壑。俱不免於患矣。",
          "逃避也。峯者山之高處也。壑者溪也。逃避峯之危峻。而赴于溪壑。俱不免害身之患。捨有取無。俱不免乎取相。般若聖智。故非如是也。0178b09"
        ],
        [
          292,
          "是以至人(約人顯智也)處有不有。居無不無。",
          "居處者。智之所詣故。即事造理。故處有不有。理不異事。故居無不無。又處有居無。照理事故。即前是當也。不有不無。泯理事故。則無是無當也。0178b14"
        ],
        [
          293,
          "雖不取於有無。",
          "明不取也。非唯不取有。亦不取無也。又即前無當無是義也。0178b18"
        ],
        [
          294,
          "然亦不捨於有無。",
          "明不捨也。正不取時。即不捨故。故云然亦。又非但不雙取。然亦不雙捨。即前物無不是。物無不當也。又初句不有離增益謗。次句不無離損減謗。次句雙非有無。離相違謗。末句雙照有無。離戲論謗。四謗既無。百非斯絕。是當之義。髣髴聖心也。0178b21"
        ],
        [
          295,
          "所以和光塵勞。周旋五趣。",
          "此顯已證之所以也。和者謂渾雜也。光者智用也。聖人光有二。一身光。二教智光。今明教智光。塵勞者。三界中五塵坌污勞擾之處。是羣生之所居。聖人渾和其間。以教智光。而開導之也。周旋者。周徧返覆也。五趣者。天人獄鬼畜。鬼開修羅。即六趣也。四生不過五趣。聖人垂形於五趣。周徧返覆也。前明說教。此顯現身。蓋聖人從根後智。起大悲之化用也。0178c04"
        ],
        [
          296,
          "寂然而往。怕爾而來。",
          "雖往來於三界。往無往相。故曰寂然而往。來無來相。故曰怕爾而來。前明處有。此顯不有。0178c13"
        ],
        [
          297,
          "恬淡(上呼)無為。而無不為。",
          "心靜曰恬。智純曰淡。雖無作為之心。而常照理達事。故無不為。此明上居無不無也。0178c16"
        ],
        [
          298,
          "難曰。聖心雖無知。然其應會之道不差。",
          "即前云會而不差也。由無為而為。故應會眾生。不差失於機宜也。0178c21"
        ],
        [
          299,
          "是以可應者應之。不可應者存之。",
          "釋不差之義。根熟則應之令入道。未熟則存之令熟。則金剛所謂護念付囑之義。0178c24"
        ],
        [
          300,
          "然則聖心有時而生。有時而滅。可得然乎。",
          "根熟則能應心生。未熟則能應心滅。既曰當而無是。則無知無為。何得有此生滅。0179a03"
        ],
        [
          301,
          "答曰。生滅者(牒所問也)生滅心也。",
          "妄心取相。故隨境生滅。0179a07"
        ],
        [
          302,
          "聖人無心。生滅焉起。",
          "聖心無取。故曰無心。既不取境。何有生滅。0179a09"
        ],
        [
          303,
          "然。",
          "牒上領問也。問云既無心生滅。何有應而不差之義耶。故今領之。0179a12"
        ],
        [
          304,
          "非無心。(非同木石之無心)但是無心(無取著心)心耳。",
          "靈明之心。長在此為應。本經云。菩薩清涼月。遊於畢竟空。0179a15"
        ],
        [
          305,
          "又非不應(非同二乘之不應)但是不應(不起分別之應)應耳。",
          "機感應生。則悲應之心常存。所謂眾生心水淨。菩提影現中。0179a18"
        ],
        [
          306,
          "是以聖人應會之道。則信若四時之質。直以虗無為體。",
          "質實也。應之不虗故。直但也。權智無心之心。不應而應。其由春夏秋冬。雖應不失時。虗而無體。權智無心而應。類此可知。0179a22"
        ],
        [
          307,
          "難曰。(解中疑問)聖智之無(聖人無心生滅焉起)惑智之無。",
          "境有生滅。智乃隨之。離境智無。生滅何有。難者因前而解。故此呈之。0179b04"
        ],
        [
          308,
          "俱無生滅(同也)何以異之。",
          "如何分真妄之異耶。0179b07"
        ],
        [
          309,
          "答曰。聖智之無者。無知。",
          "體本無知故。0179b09"
        ],
        [
          310,
          "惑智之無者。知無。",
          "了知無體故。此上標真妄。0179b11"
        ],
        [
          311,
          "其無雖同(同無生滅)所以無者異也。",
          "無之所以。真妄有異。此標同異也。0179b13"
        ],
        [
          312,
          "何者(推上異之所以)夫聖心虗靜。無知可無。",
          "智體本無知見。故曰虗靜。三際常然。可無生滅也。0179b16"
        ],
        [
          313,
          "可曰無知。非謂知無。",
          "此明真異於妄。不假知了。0179b18"
        ],
        [
          314,
          "惑智有知。故有知可無。",
          "惑智取境。隨境生滅。智性空無。生滅不有也。0179b20"
        ],
        [
          315,
          "可謂知無。非曰無知也。",
          "此顯妄異真也。前則本無故無。此則了空故無。所以異也。0179b22"
        ],
        [
          316,
          "無知。即般若之無也。",
          "智體本無生滅。故曰般若之無。0179c01"
        ],
        [
          317,
          "知無。則真諦之無也。",
          "結會妄智。為真境也。難者既了惑智性空。則惑智為所了境。由了始無即事而真。故曰真諦之無也。故知無生滅則雖同。本無今無有異也。0179c03"
        ],
        [
          318,
          "是以般若之與真諦。",
          "牒上同無之境智也。0179c08"
        ],
        [
          319,
          "言用即同而異。",
          "即同無而理智不泯。是用也。0179c10"
        ],
        [
          320,
          "言寂即異而同。",
          "雖理智宛然而同一虗無。是寂也。0179c12"
        ],
        [
          321,
          "同故無心於彼此。異故不失於照功。",
          "體同故心境彼此無殊。用異故不失能所之功。0179c14"
        ],
        [
          322,
          "是以辨同者同於異。辨異者異於同。",
          "辨者解了也。欲解同無。但觀理智。欲明理智。須了同無。此明互即。下顯雙亡。0179c17"
        ],
        [
          323,
          "斯則不可得而異。不可得而同也。",
          "辨異於同。故不可得異。辨同於異。故不可得同。同異兩亡。此答前云俱無生滅。何以異之也。0179c20"
        ],
        [
          324,
          "何者。",
          "何故不可異。而又不可同。0179c24"
        ],
        [
          325,
          "內有獨鑒之明。外有萬法之實。",
          "約心為內。以境為外。蓋指拄如此。非有內外之相。獨鑒之明者。智也。即心之照。心外無法。故曰獨鑒。又以對下萬法故。萬法之實者。理也。理為萬法之體故也。0180a03"
        ],
        [
          326,
          "萬法雖實。然非照不得。",
          "事本即真。非智不顯。0180a08"
        ],
        [
          327,
          "內外相與以成其照功。",
          "與共也。由智顯理。理顯曰智。故共成鑒照之功也。0180a10"
        ],
        [
          328,
          "此則聖所不能同用也。",
          "結異也。聖智與理。所以不可得而同者。此明照用也。0180a12"
        ],
        [
          329,
          "內雖照而無知(照體本寂)外雖實而無相(真理本空)內外寂然。相與俱無(境智同寂)此則聖所不能異寂也。",
          "結同也。聖智與理。所以不可得而異者。此明寂也。0180a16"
        ],
        [
          330,
          "是以經云諸法不異者。",
          "諸法者心境也。不異者同虗寂也。者字是牒經。下釋之云。0180a19"
        ],
        [
          331,
          "豈曰續鳧截鶴。夷嶽盈壑。然後無異哉。",
          "續鳧截鶴。語出真經。云鳧脛雖短。續之則憂。鶴脛雖長。斷之則悲等。夷平也。嶽山也。盈滿也。壑谿也。此則反釋經意。豈謂令鳧鶴長短。谿山高低。等無差別。而謂諸法不異。非此說也。下順釋云。0180a22"
        ],
        [
          332,
          "誠以不異於異。",
          "不異之義。於殊異中也。則高低長短。性不可異。故曰不異也。0180b03"
        ],
        [
          333,
          "故雖異而不異也。",
          "此證上辨。同者同於異也。0180b06"
        ],
        [
          334,
          "故經云。甚奇世尊。於無異法中而說諸法異。",
          "大品經。空生歎佛讚法。雖諸法同真無異。而境智宛爾差殊。此證上辨異者。異於同也。0180b08"
        ],
        [
          335,
          "又云。般若(智)與諸法(境)亦不一相。",
          "能所各存。證上不可得而同也。0180b12"
        ],
        [
          336,
          "亦不異相。",
          "同一真體。證上不可得而異也。0180b14"
        ],
        [
          337,
          "信矣。",
          "佛語實不虗。故自信信他也。0180b16"
        ],
        [
          338,
          "難曰。論云。言用則異。言寂則同。",
          "牒上云聖所不能同用也。聖所不能異寂也。0180b19"
        ],
        [
          339,
          "未詳般若之內。則有用寂之異乎。",
          "此是請益。問般若真一無差。何以有一用一寂之異。未詳審也。0180b22"
        ],
        [
          340,
          "答曰。用即寂。",
          "不離境智之二。而同一寂滅也。故勝鬘云。二而不二。難可了知。如全波是水故。0180c01"
        ],
        [
          341,
          "寂即用。",
          "同一虗寂。而能所歷然。勝鬘又云。不二而二。難可了知。如全水是波故。此中言寂。即權實同體。言用。即二用雙明。竝體用同時故也。0180c04"
        ],
        [
          342,
          "用寂體一。同出而異名。",
          "言體者。非所依真體。此明相依之體用依於寂。以寂為體。寂依於用。以用為體。相依故體一也。同出而異名者。寂出用。用出寂。故有寂用之異名。非謂別有一體。為用寂之出處也。0180c08"
        ],
        [
          343,
          "更無無用之寂。而主於用也。",
          "又合云。更無無寂之用。而主於寂也。今文影略。更者定義也。意云。定無無用之單寂。而為用之。依主。又定無無寂之單用。而為寂之。依主。不有則已。有則用寂。同時既無二體。如何一有一無。0180c13"
        ],
        [
          344,
          "是以(承上用寂不二故)智彌昧。照逾明。",
          "結實也。彌極也。逾過也。體本無知故。昧之彌極。即體之照。照徹理源。其明過逾於常照也。即前云。智有窮幽之鑒。而無知焉。0180c21"
        ],
        [
          345,
          "神彌靜。應逾動。",
          "結權也。體本無慮。故靜之彌極。即體之應常。應有緣故。動之逾越也。即前云。神有應會之用。而無慮焉。下總責疑者。0181a01"
        ],
        [
          346,
          "豈曰明昧動靜之異哉。",
          "明與昧。動與靜。豈當執異也。0181a05"
        ],
        [
          347,
          "故成具云。不為而過為。",
          "證上權智靜而常用。0181a07"
        ],
        [
          348,
          "寶積曰。無心無識。無不覺知。",
          "證上寶智。即昧而明也。淨名上卷實積偈讚云。以無心意而現行。今則小變其文也。0181a09"
        ],
        [
          349,
          "斯則(總指標宗已上問答等文也)窮神(權也)盡智(實也)極象外(有無曰象)之談也。",
          "般若體用不二。故極有無之象外也。談者指上所說也。0181a13"
        ],
        [
          350,
          "即之明文。聖心可知矣。",
          "結也。明文者。如證而說。故曰明了之文。思之可解。又或近指上二經。曰明文。問答終此。0181a16"
        ]
      ],
      "tag": "遵"
    }
  }
}