{
  "html": [
    "<div id='body0'>",
    "<p id='p1' data-head-level=\"2\" class=\"head\">物不遷論第一</p>",
    "<div ke-pan='1' data-ke-type='1' class='ke-line first-ke has-next-ke' data-indent='0'>序</div>",
    "<div ke-pan='2' data-ke-type='1' class='ke-line' data-indent='1'> 常情</div>",
    "<p id='p2' class=\"\">夫生死交謝，寒暑迭遷，有物流動，人之常情。余則謂之不然。</p>",
    "<div ke-pan='3' data-ke-type='1' class='ke-line first-ke has-next-ke' data-indent='1'> 明真解(立宗)</div>",
    "<p id='p2a'>何者？《放光》云：「法無去來，無動轉者。」尋夫不動之作，豈釋動以求靜？必求靜於諸動。必求靜於諸動，故雖動而常靜；不釋動以求靜，故雖靜而不離動。</p>",
    "<div ke-pan='6' data-ke-type='1' class='ke-line first-ke has-next-ke' data-indent='1'> 述異同</div>",
    "<p id='p2c'>然則動靜未始異，而惑者不同，緣使真言滯於競辯，宗途屈於好異。所以靜躁之極，未易言也。</p>",
    "<p id='p2b'>何者？夫談真則逆俗，順俗則違真。違真故迷性而莫返，逆俗故言淡而無味。緣使中人未分於存亡，下士撫掌而弗顧，近而不可知者，其唯物性乎！</p>",
    "<div ke-pan='8' data-ke-type='1' class='ke-line first-ke' data-indent='1'> 申論意</div>",
    "<p id='p2d'>然不能自已，聊復寄心於動靜之際，豈曰必然！試論之曰：</p>",
    "<div ke-pan='9' data-ke-type='1' class='ke-line first-ke has-next-ke' data-indent='0'>論</div>",
    "<div ke-pan='10' data-ke-type='1' class='ke-line has-next-ke' data-indent='1'> 引經明不遷</div>",
    "<p id='p3' class=\"\">《道行》云：「諸法本無所從來，去亦無所至。」《中觀》云：「觀方知彼去，去者不至方。」斯皆即動而求靜，以知物不遷明矣。</p>",
    "<div ke-pan='13' data-ke-type='1' class='ke-line first-ke' data-indent='1'> 指物明不遷</div>",
    "<p id='p3a'>夫人之所謂動者，以昔物不至今，故曰動而非靜。我之所謂靜者，亦以昔物不至今，故曰靜而非動。動而非靜，以其不來；靜而非動。以其不去。然則所造未嘗異，所見未嘗同。逆之所謂塞，順之所謂通。苟得其道，復何滯哉！</p>",
    "<div ke-pan='14' data-ke-type='1' class='ke-line first-ke has-next-ke' data-indent='1'> 遣惑明不遷</div>",
    "<p id='p3b'>傷夫人情之惑也久矣，目對真而莫覺。既知往物而不來，而謂今物而可往。往物既不來，今物何所往？</p>",
    "<p id='p3c'>何則？求向物於向，於向未甞無；責向物於今，於今未甞有。於今未嘗有，以明物不來；於向未甞無，故知物不去。覆而求今，今亦不往。是謂昔物自在昔，不從今以至昔；今物自在今，不從昔以至今。故仲尼曰：「回也見新，交臂非故。」如此，則物不相往來，明矣。既無往返之微朕，有何物而可動乎？然則旋嵐偃嶽而常靜，江河兢注而不流，野馬飄鼓而不動，日月歷天而不周。復何怪哉！</p>",
    "<div ke-pan='16' data-ke-type='1' class='ke-line first-ke has-next-ke' data-indent='1'> 會教明不遷</div>",
    "<div ke-pan='17' data-ke-type='1' class='ke-line has-next-ke' data-indent='2'> 廣會教明不遷</div>",
    "<p id='p3d'>噫！聖人有言曰：「人命逝速，速於川流。」是以聲聞悟非常以成道，緣覺覺緣離以即真。苟萬動而非化，豈尋化以階道？覆尋聖言，微隱難測。若動而靜，似去而留。可以神會，難以事求。是以言去不必去，閑人之常想；稱住不必住，釋人之所謂往耳。豈曰去而可遣、住而可留也。</p>",
    "<p id='p3e'>故《成具》云：「菩薩處計常之中，而演非常之教。」《摩訶衍論》云：「諸法不動，無去來處。」斯皆導達群方，兩言一會，豈曰文殊而乖其致哉？是以言常而不住，稱去而不遷。不遷，故雖往而常靜；不住，故雖靜而常往。雖靜而常往，故往而弗遷；雖往而常靜，故靜而弗留矣。然則莊生之所以藏山，仲尼之所以臨川，斯皆感往者之難留，豈曰排今而可往？是以觀聖人心者，不同人之所見、得也。</p>",
    "<p id='p3f'>何者？人則謂少壯同體、百齡一質，徒知年往，不覺形隨。是以梵志出家，白首而歸。隣人見之曰：「昔人尚存乎？」梵志曰：「吾猶昔人，非昔人也。」隣人皆愕然，非其言也。所謂有力者負之而趨，昧者不覺。其斯之謂歟！</p>",
    "<div ke-pan='19' data-ke-type='1' class='ke-line first-ke has-next-ke' data-indent='2'> 略會教明不遷</div>",
    "<p id='p3g'>是以如來因群情之所滯，則方言以辯惑，乘莫二之真心，吐不一之殊教，乖而不可異者，其唯聖言乎！</p>",
    "<p id='p3h'>故談真有不遷之稱，導俗有流動之說。雖復千途異唱，會歸同致矣。而徵文者聞不遷，則謂昔物不至今；聆流動者，而謂今物可至昔。既曰古今，而欲遷之者，何也？是以言往不必往，古今常存，以其不動；稱去不必去，謂不從今至古，以其不來。不來，故不馳騁於古今；不動，故各性住於一世。然則群籍殊文、百家異說，苟得其會，豈殊文之能惑哉？</p>",
    "<div ke-pan='21' data-ke-type='1' class='ke-line first-ke' data-indent='1'> 反常明不遷</div>",
    "<p id='p3i'>是以人之所謂住，我則言其去；人之所謂去，我則言其住。然則去住雖殊，其致一也。故經云：「正言似反。誰當信者？」斯言有由矣。</p>",
    "<p id='p3j'>何者？人則求古於今，謂其不住。吾則求今於古，知其不去。今若至古，古應有今；古若至今，今應有古。今而無古，以知不來；古而無今，以知不去。若古不至今，今亦不至古，事各性住於一世，有何物而可去來？然則四象風馳、璇璣電捲，得意毫微，雖速而不轉。</p>",
    "<div ke-pan='22' data-ke-type='1' class='ke-line first-ke' data-indent='1'> 結會明不遷</div>",
    "<p id='p3l'>是以如來，功流萬世而常存，道通百劫而彌固。成山假就於始簣，修途託至於初步，果以功業不可朽故也。功業不可朽，故雖在昔而不化，不化故不遷。不遷故，則湛然明矣。故經云：「三災彌綸而行業湛然。」信其言也。</p>",
    "<p id='p3k'>何者？果不俱因，因因而果。因因而果，因不昔滅；果不俱因，因不來今。不滅不來，則不遷之致明矣！復何惑於去留，踟蹰於動靜之間哉？然則乾坤倒覆，無謂不靜；洪流滔天，無謂其動。苟能契神於即物，斯不遠而可知矣！</p>",
    "<p id='p4' class=\"juan-end\"><span class='lineInfo' line='0151c29'></span>物不遷論<span class='doube-line-note'>終</span></p>",
    "</div>"
  ],
  "html_org": [
    [
      "<div id='body0'>",
      "<p id='p1' data-head-level=\"2\" class=\"head\">物不遷論第一</p>",
      "<p id='p2' class=\"\"><span class='lineInfo' line='0151a09'></span>夫生死交謝，寒暑迭遷，有物流動，人之常情。余則謂之不然。何者？《放光》云：「法無去來，無動轉者。」尋夫不動之作，豈釋動以求靜？必求靜於諸動。必求靜於諸動，故雖動而常靜；不釋動以求靜，故雖靜而不離動。然則動靜未始異，而惑者不同，緣使真言滯於競辯，宗途屈於好異。所以靜躁之極，未易言也。何者？夫談真則逆俗，順俗則違真。違真故迷性而莫返，逆俗故言淡而無味。緣使中人未分於存亡，下士撫掌而弗顧，近而不可知者，其唯物性乎！然不能自已，聊復寄心於動靜之際，豈曰必然！試論之曰：</p>",
      "<p id='p3' class=\"\"><span class='lineInfo' line='0151a20'></span>《道行》云：「諸法本無所從來，去亦無所至。」《中觀》云：「觀方知彼去，去者不至方。」斯皆即動而求靜，以知物不遷明矣。夫人之所謂動者，以昔物不至今，故曰動而非靜。我之所謂靜者，亦以昔物不至今，故曰靜而非動。動而非靜，以其不來；靜而非動。以其不去。然則所造未嘗異，所見未嘗同。逆之所謂塞，順之所謂通。苟得其道，復何滯哉！傷夫人情之惑也久矣，目對真而莫覺。既知往物而不來，而謂今物而可往。往物既不來，今物何所往？何則？求向物於向，於向未甞無；責向物於今，於今未甞有。於今未嘗有，以明物不來；於向未甞無，故知物不去。覆而求今，今亦不往。是謂昔物自在昔，不從今以至昔；今物自在今，不從昔以至今。故仲尼曰：「回也見新，交臂非故。」如此，則物不相往來，明矣。既無往返之微朕，有何物而可動乎？然則旋嵐偃嶽而常靜，江河兢注而不流，野馬飄鼓而不動，日月歷天而不周。復何怪哉！噫！聖人有言曰：「人命逝速，速於川流。」是以聲聞悟非常以成道，緣覺覺緣離以即真。苟萬動而非化，豈尋化以階道？覆尋聖言，微隱難測。若動而靜，似去而留。可以神會，難以事求。是以言去不必去，閑人之常想；稱住不必住，釋人之所謂往耳。豈曰去而可遣、住而可留也。故《成具》云：「菩薩處計常之中，而演非常之教。」《摩訶衍論》云：「諸法不動，無去來處。」斯皆導達群方，兩言一會，豈曰文殊而乖其致哉？是以言常而不住，稱去而不遷。不遷，故雖往而常靜；不住，故雖靜而常往。雖靜而常往，故往而弗遷；雖往而常靜，故靜而弗留矣。然則莊生之所以藏山，仲尼之所以臨川，斯皆感往者之難留，豈曰排今而可往？是以觀聖人心者，不同人之所見、得也。何者？人則謂少壯同體、百齡一質，徒知年往，不覺形隨。是以梵志出家，白首而歸。隣人見之曰：「昔人尚存乎？」梵志曰：「吾猶昔人，非昔人也。」隣人皆愕然，非其言也。所謂有力者負之而趨，昧者不覺。其斯之謂歟！是以如來因群情之所滯，則方言以辯惑，乘莫二之真心，吐不一之殊教，乖而不可異者，其唯聖言乎！故談真有不遷之稱，導俗有流動之說。雖復千途異唱，會歸同致矣。而徵文者聞不遷，則謂昔物不至今；聆流動者，而謂今物可至昔。既曰古今，而欲遷之者，何也？是以言往不必往，古今常存，以其不動；稱去不必去，謂不從今至古，以其不來。不來，故不馳騁於古今；不動，故各性住於一世。然則群籍殊文、百家異說，苟得其會，豈殊文之能惑哉？是以人之所謂住，我則言其去；人之所謂去，我則言其住。然則去住雖殊，其致一也。故經云：「正言似反。誰當信者？」斯言有由矣。何者？人則求古於今，謂其不住。吾則求今於古，知其不去。今若至古，古應有今；古若至今，今應有古。今而無古，以知不來；古而無今，以知不去。若古不至今，今亦不至古，事各性住於一世，有何物而可去來？然則四象風馳、璇璣電捲，得意毫微，雖速而不轉。是以如來，功流萬世而常存，道通百劫而彌固。成山假就於始簣，修途託至於初步，果以功業不可朽故也。功業不可朽，故雖在昔而不化，不化故不遷。不遷故，則湛然明矣。故經云：「三災彌綸而行業湛然。」信其言也。何者？果不俱因，因因而果。因因而果，因不昔滅；果不俱因，因不來今。不滅不來，則不遷之致明矣！復何惑於去留，踟蹰於動靜之間哉？然則乾坤倒覆，無謂不靜；洪流滔天，無謂其動。苟能契神於即物，斯不遠而可知矣！</p>",
      "<p id='p4' class=\"juan-end\"><span class='lineInfo' line='0151c29'></span>物不遷論<span class='doube-line-note'>終</span></p>",
      "</div>"
    ]
  ],
  "info": {
    "caption": "物不遷論",
    "cb_ids": "T1858_001",
    "cols": 1,
    "folder": "demo",
    "id": "T1858A",
    "note_count": 20,
    "note_id": 1320,
    "notes": [
      "0|康|T1859_001|T1859 肇論疏，唐·元康",
      "0|惠|X0866_001_002|X0866 肇論疏，晉·惠達",
      "0|界|X0880|X0880 物不遷論辯解，明·真界",
      "0|憨|X0873_001|X0873 肇論略注，明·德清",
      "0|遵|X0870_002|X0870 注肇論疏，宋·遵式",
      "0|文|T1860_001|T1860 肇論新疏，元·文才"
    ],
    "step": 2
  },
  "log": [
    "Split paragraph #p2 at 51 as result #p2a,p2b: 夫生死交謝，寒暑迭遷，有物流動，人之常情。余則謂之不然。@何者？《放光》云：「法無去來，無動轉者。」尋夫不動之作，豈釋動以求靜？必求靜於諸動。必求靜於諸動，故雖動而常靜；不釋動以求靜，故雖靜而不離動。然則動靜未始異，而惑者不同，緣使真言滯於競辯，宗途屈於好異。所以靜躁之極，未易言也。@何者？夫談真則逆俗，順俗則違真。違真故迷性而莫返，逆俗故言淡而無味。緣使中人未分於存亡，下士撫掌而弗顧，近而不可知者，其唯物性乎！然不能自已，聊復寄心於動靜之際，豈曰必然！試論之曰：",
    "Split paragraph #p3 at 54 as result #p3a,p3b,p3c,p3d,p3e,p3f,p3g,p3h,p3i,p3j,p3k: 《道行》云：「諸法本無所從來，去亦無所至。」《中觀》云：「觀方知彼去，去者不至方。」斯皆即動而求靜，以知物不遷明矣。@夫人之所謂動者，以昔物不至今，故曰動而非靜。我之所謂靜者，亦以昔物不至今，故曰靜而非動。動而非靜，以其不來；靜而非動。以其不去。然則所造未嘗異，所見未嘗同。逆之所謂塞，順之所謂通。苟得其道，復何滯哉！@傷夫人情之惑也久矣，目對真而莫覺。既知往物而不來，而謂今物而可往。往物既不來，今物何所往？@何則？求向物於向，於向未甞無；責向物於今，於今未甞有。於今未嘗有，以明物不來；於向未甞無，故知物不去。覆而求今，今亦不往。是謂昔物自在昔，不從今以至昔；今物自在今，不從昔以至今。故仲尼曰：「回也見新，交臂非故。」如此，則物不相往來，明矣。既無往返之微朕，有何物而可動乎？然則旋嵐偃嶽而常靜，江河兢注而不流，野馬飄鼓而不動，日月歷天而不周。復何怪哉！@噫！聖人有言曰：「人命逝速，速於川流。」是以聲聞悟非常以成道，緣覺覺緣離以即真。苟萬動而非化，豈尋化以階道？覆尋聖言，微隱難測。若動而靜，似去而留。可以神會，難以事求。是以言去不必去，閑人之常想；稱住不必住，釋人之所謂往耳。豈曰去而可遣、住而可留也。@故《成具》云：「菩薩處計常之中，而演非常之教。」《摩訶衍論》云：「諸法不動，無去來處。」斯皆導達群方，兩言一會，豈曰文殊而乖其致哉？是以言常而不住，稱去而不遷。不遷，故雖往而常靜；不住，故雖靜而常往。雖靜而常往，故往而弗遷；雖往而常靜，故靜而弗留矣。然則莊生之所以藏山，仲尼之所以臨川，斯皆感往者之難留，豈曰排今而可往？是以觀聖人心者，不同人之所見、得也。@何者？人則謂少壯同體、百齡一質，徒知年往，不覺形隨。是以梵志出家，白首而歸。隣人見之曰：「昔人尚存乎？」梵志曰：「吾猶昔人，非昔人也。」隣人皆愕然，非其言也。所謂有力者負之而趨，昧者不覺。其斯之謂歟！@是以如來因群情之所滯，則方言以辯惑，乘莫二之真心，吐不一之殊教，乖而不可異者，其唯聖言乎！@故談真有不遷之稱，導俗有流動之說。雖復千途異唱，會歸同致矣。而徵文者聞不遷，則謂昔物不至今；聆流動者，而謂今物可至昔。既曰古今，而欲遷之者，何也？是以言往不必往，古今常存，以其不動；稱去不必去，謂不從今至古，以其不來。不來，故不馳騁於古今；不動，故各性住於一世。然則群籍殊文、百家異說，苟得其會，豈殊文之能惑哉？@是以人之所謂住，我則言其去；人之所謂去，我則言其住。然則去住雖殊，其致一也。故經云：「正言似反。誰當信者？」斯言有由矣。@何者？人則求古於今，謂其不住。吾則求今於古，知其不去。今若至古，古應有今；古若至今，今應有古。今而無古，以知不來；古而無今，以知不去。若古不至今，今亦不至古，事各性住於一世，有何物而可去來？然則四象風馳、璇璣電捲，得意毫微，雖速而不轉。是以如來，功流萬世而常存，道通百劫而彌固。成山假就於始簣，修途託至於初步，果以功業不可朽故也。功業不可朽，故雖在昔而不化，不化故不遷。不遷故，則湛然明矣。故經云：「三災彌綸而行業湛然。」信其言也。@何者？果不俱因，因因而果。因因而果，因不昔滅；果不俱因，因不來今。不滅不來，則不遷之致明矣！復何惑於去留，踟蹰於動靜之間哉？然則乾坤倒覆，無謂不靜；洪流滔天，無謂其動。苟能契神於即物，斯不遠而可知矣！",
    "Split paragraph #p2a at 54 as result #p2c: 何者？《放光》云：「法無去來，無動轉者。」尋夫不動之作，豈釋動以求靜？必求靜於諸動。必求靜於諸動，故雖動而常靜；不釋動以求靜，故雖靜而不離動。@然則動靜未始異，而惑者不同，緣使真言滯於競辯，宗途屈於好異。所以靜躁之極，未易言也。",
    "Split paragraph #p2b at 58 as result #p2d: 何者？夫談真則逆俗，順俗則違真。違真故迷性而莫返，逆俗故言淡而無味。緣使中人未分於存亡，下士撫掌而弗顧，近而不可知者，其唯物性乎！@然不能自已，聊復寄心於動靜之際，豈曰必然！試論之曰：",
    "Split paragraph #p3j at 77 as result #p3l: 何者？人則求古於今，謂其不住。吾則求今於古，知其不去。今若至古，古應有今；古若至今，今應有古。今而無古，以知不來；古而無今，以知不去。若古不至今，今亦不至古，事各性住於一世，有何物而可去來？然則四象風馳、璇璣電捲，得意毫微，雖速而不轉。@是以如來，功流萬世而常存，道通百劫而彌固。成山假就於始簣，修途託至於初步，果以功業不可朽故也。功業不可朽，故雖在昔而不化，不化故不遷。不遷故，則湛然明矣。故經云：「三災彌綸而行業湛然。」信其言也。",
    "Split note #413 at 0072b22 of 惠 with #641,642,643,644,645,646,647,648,649,650: 文有二義：一、明造論，二、道行云下，正辨論體。@夫生死交謝寒暑迭遷者，生死之變猶冬夏而時行也。有物流動人之常情者，唯有法流動不及無為者。中人以下皆共知之。此是標宗也。@今即下，正明造論所由。有二科：一、立宗。二、或者下，正明所由。@立宗中有三段。初，依經立宗；次，破；後，結也。@今即謂之不然者。總反惑情。何者下，依經立宗也。次，尋夫下，破舊義也。尋夫不動之作。豈釋動以求靜。必求靜於諸動者。正破舊義。@彼云不遷者。賴於續假。轉前作後名為動法。若許實法即無動轉。故法與時俱。時與法俱。轉變後法還舒於前。名為不動。此即釋動以求靜也。@過去法來不來有三說。第一云。過去雖滅而曾為因。故相續行者成就此因。因非轉來。在於現附也。@第二云。因體有為。當時即滅。而善惡功用湛然常在也。@第三云。善惡功用隨心轉來。來至現在者也。@今於三宗亦同不同。但言而無當。取汝言賴續故動者。為當前法續後。為當後法接前。若前法續後。前時未有。後云未有。何續。若後法接前。後起前已謝。何處接。動亦例然。今即不然。求是推求。以三時求動。動相不可得。故云求靜於諸動。下句可解。@後段。然即動靜未始異者。結宗也。",
    "Split note #419 at 0074b08 of 惠 with #651,652,653: 第五科。是以如來下。舉因果以勸學。有三段。初。舉果勸因不滅。次。舉因勸果必生。後。勸齊萬物。@功流萬世至彌固。此是舉果也。從成山至初步。譬因不滅也。功不可杇故在昔而不化者。以功業不滅證不遷之致也。故下。引經證果不滅也。@次段。何者。舉因勸果必生也。果不俱因因因而果者。立兩章門。因因而果因不昔滅者。釋因不滅也。果不俱因因不來今者。釋因不來。斯即不滅不來。果義得生。正不遷之致也。@復何惑下。勸無惑也。後段。然即。結宗勸學也。",
    "Split note #644 at 0072b22 of 惠 with #654: 今即謂之不然者。總反惑情。何者下，依經立宗也。@次，尋夫下，破舊義也。尋夫不動之作。豈釋動以求靜。必求靜於諸動者。正破舊義。",
    "Split note #414 at 0072c15 of 惠 with #655,656,657,658,659,660,661,662: 第二科。而惑者下。明所由。有三段。初。明辨理者不同。而或者不同句。亦可屬上。亦牽於下。次。明道相反。後。明所為人也。@真言滯於競辨者。佛言無當而滯於偏執也。@宗途屈於好異者。理無二途而屈於是非。即是於諦義也。所以求那法師偈云。諸論各異端。修行理無二。偏執有是非。達者無違諍也。@次。何者下。明道俗相反。教亦相違。@談真即逆俗順俗即違真者。俗。習也。言真之教違於俗。順俗之教反於道也。違真故下。明行亦反也。@後段。緣使中人下。明所為中人未分於存忘者。疑於有道若存。疑於無道若亡也。@下士撫掌而弗脣者。異己所見。其乖常情。對牛皷簧。非彼能覺。故大咲而弗脣也。@動靜之際之。莊生云。鴈木之間猶未免有累。故竟不處。@今肇師亦爾。處遷不遷之間。設投處猶未免偏。竟不處也。此釋造論意之也。",
    "Split note #415 at 0073a05 of 惠 with #663,664,665,666,667,668,669: 第二。道行下。正辨論體。有五科。一。依經論立宗。二。傷夫下。破去來明不遷。三。噫聖人下。徵教。四。是以覩下。約愚智二人明取教得失。五。是以如來下。明因果無失以觀覺。@初科有三段。初。依經論標宗。次。就二人釋經論意。後。明趣無二也。@非常之說常情難悟。故以引標不遷教。此經語可作兩釋。一。諸法本來不生故無去來。二。以假異明無去來。然推假異即離無當。即是本來不生之義。@復引中觀標動靜無二也。次段就二人釋。先釋中觀意。以昔物不至今故動而非靜者。@人情所謂本時無法。今有名現。而現法流入過去更不遷今。故動而非靜也。@我之所謂靜者。亦昔物不至今。靜而非動者。同事異悟。已過之法更不來今。昔物自在昔。即靜而非動也。@靜而非動以其不來者。即釋經語。已之法更不來今。以知昔物不來於今也。動而非靜以其不住者。流入過去無去。剎那並於現。以知不住也。一義是眠生時無所從來亦無所去也。@後段。然即下。明旨趣無二。動靜所趣未曾異執。見未嘗同也。逆之所謂塞順之所謂通者。偏執即逆塞。忘懷即順通。然即理無動靜而取動靜者。論於或若即動靜而無動靜者。契會無二矣。",
    "Split note #416 at 0073b01 of 惠 with #670,671,672,673,674,675: 第二科。傷夫下。破去來明不遷。有三段。初。傷凡情表不遷。次。破去來明不遷。後。引外聖證不遷也。@傷夫人情之或久矣。目對真而莫覺者。若聖智對。五目莫見其形。斯乃道遠乎哉。迷情即是因緣。道遠乎哉。因緣即是中。故云因緣所生法。我說即是空。亦為是假名。亦是中道義。而凡夫宍眼冥然不知。如對牛皷簧。彼非所悟也。@既知往物既不來今物何往者。已過之法更不來今。今不住法亦不移時也。次。何則下。破去來。即釋道行意。此中先就向物以四句明無去來也。初兩句立有無義。於今嘗有下兩句。正明向物無去來也。@覆而求今今亦不往者。應有四句。求今物於今於今未嘗無。責今物於向於向未嘗有。於向未嘗有以知物不去。於今未甞無以知物不來也。是為下。舉今昔兩物結明不遷也。@後段。仲尼下。引外聖證不遷教。所謂外內雖殊所明理同是也。@有何物而可動者。經中觀意也。@然即下。齊萬物而結不遷也。釋論云。光風動塵野馬之中如野馬者也。",
    "Split note #671 at 0073b01 of 惠 with #676: 既知往物既不來今物何往者。已過之法更不來今。今不住法亦不移時也。@次。何則下。破去來。即釋道行意。此中先就向物以四句明無去來也。初兩句立有無義。於今嘗有下兩句。正明向物無去來也。",
    "Split note #417 at 0073b18 of 惠 with #677,678,679,680,681,682,683,684,685,686,687,688,689,690: 第三科。噫下。徵教。有三段。初。舉無常教以徵今說。次。人情不同教非一軌。後。引外聖證無常教同也。@人命速於川流者。舉仲尼教也。@是以下。三乘證果執無常教也。@齊萬物而非化豈尋化以階道者。證教非謬也。@覆尋聖言微隱難測者。正徵今記。䨱者䨱無常教。尋不遷意。結理難解也。若動而靜似去而留。可以神會者。推於大士。非中下所知也。@次段。是以下。明人執不同。教非一軌。有三階。一。明去住兩教之意。二。正出兩教。三。兩教一會也。@言去不必去閑人之常想者。言無常不必無常。但防計常之想也。@秤住不必住釋人之不住者。言不遷不必是不遷。但解計往之想。後住字當為往也。@若用住字釋者。常字亦不可以計常之常。應以常情而釋之耳。@二。成具下。正出經。成具明無常教。摩訶衍明不遷教也。@三。斯皆下。兩教一會。是以下。釋意。三雙六句。@言常而不住。秤去而不遷者。此二句勸取教莫偏也。不遷故雖往而靜。@不住故雖靜而往者。此二句明教意相通也。雖靜而往故往而弗遷。@雖往而靜故靜而弗留者。此二句明物無動靜也。@後段。然即下。引外聖證無常教。同莊生如上所云也。仲尼臨川云人命逝速如斯也。",
    "Split note #418 at 0073c14 of 惠 with #691,692,693,694,695,696,697,698,699,700,701,702,703,704,705,706,707,708,709,710,711,712,713,714,715,716: 第四科。是以覩下。約愚智二人取教得失。有二段。初。明為二人起教不同。次。明取教得失。後。反常合道。@初段有二階。一。明二人。二。明起教也。@不同人所見得明者。下不及上也。@何者下。出二人。隣人是或。梵為智者。從初至形隨。是出惑情。以梵志下。正出其事也。@吾猶昔人非昔人者。可作兩釋。一云。吾豈昔人乎。非昔人也。一云。猶。若也。吾若昔人。@非昔人也。一息一得。向息非今息。昨日之人於今化矣。而愚者竊然。以為昔人常存。此不朽物化也。@二。明起教不同。是以如來因群生以辨惑者。教起無端。病除是貴。故此句出病。明起教所由也。@乘莫二之真心下。正明起教不一也。@不遷為俗而云不遷為真者。謂情為俗。即反常為真故也。@後段。而徵下。正明得失。有二階。@一。因教著偏。聞不遷即昔物可至今者。凡人所謂時年雖移。人之質體古今不異。如以指進薪火傳不滅。而不知指火與薪俱謝也。聽流動即謂流入過去。而不知支火非今火也。今即正破。既云古今。古即在於古。今即在於今。而云遷者何也。@二。是以下。勸著不遷教。@言住不必住。古今常存。以其不動者。@言所謂住。不必是住。@言其非動。非謂是住。即不住之住。@古今不動也。一云。從彼至此乃是住義。古不至今何處有住。@古不至今故無住者。今亦不往於古。言其不動。@又住是對動之言。無動故無住也。@秤去不必去。不從今至古。以其不來者。言去不必是去。言其非來。非謂是去。即不去之去。古今不住也。@一云從今至古乃是去義。今不至古。何處有去。今不至古故無去者。古亦不來於今。言其不來。又去是對來之言。無來故無去也。@不來故下。結不遷。@然即下。會教也。@後段。是以人下。反常合道。有三階。@一。反其常情及合於道。故云人所謂住我即言去也。求那偈云。諸論各異端。修行理無二。偏執有是非。達者無違諍。故去來雖殊其旨無二也。正言似反誰當信者。通理無言。言因病起。相治之力無非相反。故河上云。正直之言世人不知。以為反言也。@二。何者下。就二人釋反常義。人即求古於今謂其不住者。凡情求古於今。今而無古。以古物不住也。吾即求今於古知其不去者。吾即求今於古。古而無今。以知今物不去也。下釋就文可見也。@然下。齊萬物。四象者。老子云。大象者四象之母也。不炎不寒不溫不涼。言若執之即天下往。今即四像謂炎溫寒涼加風馳之速也。@旋機電卷者。尚書云。旋機玉衡以齊七政。窂。天文之器也。如今運天圖也。例略云。故處旋璣以觀大運。見天地之運未足恠之者也。",
    "Extract note #26 of 康 with #717,718,719,720,721,722,723,724,725,726,727: 成山假就於始簣者。論",
    "Extract note #25 of 康 with #728,729: 何者人則求古於今謂其",
    "Extract note #24 of 康 with #730,731,732,733,734,735,736,737,738: 而言方言者，隨方之言",
    "Extract note #18 of 康 with #739,740: 緣使中人未分於存亡下",
    "Extract note #17 of 康 with #741: 尋夫不動之作，豈釋動",
    "Extract note #20 of 康 with #742: 斯皆即動而求靜以知物",
    "Extract note #21 of 康 with #743,744,745: 然則所造未嘗異下。廣",
    "Extract note #22 of 康 with #746,747,748,749,750,751,752,753: 既知往物之不來而謂今",
    "Extract note #23 of 康 with #754,755,756,757,758,759,760,761,762,763,764,765,766,767,768,769,770,771,772,773,774,775,776: 速於川流者。涅槃經云",
    "Extract note #18 of 康 with #777,778,779: 何者夫談真則逆俗順俗",
    "Extract note #18 of 康 with #780: 所以靜躁之極未易言也",
    "Extract note #770 of 康 with #781: 言有住者。不必即住。"
  ],
  "notes": {
    "康": {
      "col": 0,
      "desc": "T1859 肇論疏，唐·元康",
      "name": "T1859_001",
      "notes": [
        [
          16,
          "夫生死交謝寒暑遞遷有物流動人之常情也下",
          "有本云生死，有本云生滅，俱得，今用生死也。有本云迭遷，有本遞遷，俱得，今用迭遷也。《小雅》<sup title='《小尔雅》，汉代训诂学著作'>*</sup>云：迭遞，交更也。今明迭遷，更相、遷易也。\n生死者，非直謂人身死此生彼，通謂一切萬物生死變化也。如《涅槃經》云：「一切諸世間，生者皆歸死。壽命雖無量，要必有終盡。」既從生至死，亦從死至生。生死迴還，終始無際，是謂交謝。謝，往也。《易》<sup title='《周易·系辞下》'>*</sup>云：暑往而寒來，寒往而暑來。又云：鼓之以雷霆，潤之以風雨。日月運行，一寒一暑。是謂迭遷也。即以生死寒暑，名之為有，名之為物，皆有遷謝移易，故云流動。流如水流，動如風動。此是常情所解也。常者尋常也。《小雅》云：四尺謂之仞，倍仞謂之尋，尋者舒兩臂也，倍尋謂之常也。0166c25"
        ],
        [
          17,
          "余則謂之不然下",
          "第二明真解也。余，我也。謂，言也。不如前解，故曰不然也。\n何者放光云法無去來無動轉者，竺法護前翻大品，名曰放光。以此經初廣明如來放光等事，即以為名也。彼經既云法無去來，何有生死交謝！復云無動轉者，何有寒暑迭遷耶！\n亦可通說，未必須配也。亦可何者字，是肇法師語，非經文也。0167a13"
        ],
        [
          741,
          "尋夫不動之作，豈釋動以求靜。",
          "釋者，捨離。尋放光經作不動之語者，非謂捨動而別論靜，即求靜於動法之中，即動而為靜耳。言豈釋者，不釋也。必求靜於諸動下，覆上意可見也。0167a13"
        ],
        [
          18,
          "然則動靜未始異而惑者不同下",
          "第三述異同也。動靜理雖不殊，而迷惑之人謂異也。緣使真言滯於競辨宗途屈於好異者，真言謂佛教也，競辨謂異說也，宗途謂法理也，好異謂異解也。0167a25"
        ],
        [
          780,
          "所以靜躁之極未易言也者。",
          "謂靜躁兩間難辨也。又釋靜躁不二是靜躁之極，欲說此理，未易可論也。0167a25"
        ],
        [
          779,
          "何者夫談真則逆俗順俗則違真者。",
          "俗人謂異，言不異者，則逆俗人也。真理是一，言不一者，則違真理也。此言真者，謂理實如此，故名為真，未必即為真諦也。如云真書真寶，可即是真諦乎！固不然也。有人執此語非，前序中不遷當俗諦。此非得意之言也。0167a25"
        ],
        [
          778,
          "違真故迷性而莫返逆俗故言談而無味者。",
          "違真理則迷法性，不能自返也。亦可情迷，不能自返悟也。逆俗人，則語薄淡，無滋味也。老子云：「樂與餌，過客止<sup title='大正藏为「容上」'>*</sup>，道之出口，淡乎其無味。」\n今借此語，以飾論文也。如來說法，皆依二諦，言則順俗，理則明真。且秦人好文，譯經者言參經史，晉朝尚理。作論者辭涉老莊，言參經史，不可謂佛與丘且同風。辭涉老莊，不可謂法與聃周<sup title='聃周（dān zhōu），老聃与庄周的并称'>*</sup>齊致。肇法師一時挺秀，千載孤標，上智貴其高明，下愚譏其混雜。是謂資宋章而適越，露形之俗見嗤，抱荊玉而歸楚，無目之徒致哂。信可悲也，深可歎哉。近有無識之徒，自相朋附。或身參法侶，翻謗大乘。或形廁俗流，反宗小教。上誹高德，苟布負俗之名。下贊庸流，將謂契真之實。自忘顏厚，豈識羞慚。經云：「譬如癡賊，棄捨金寶，擔負瓦礫。」此之謂矣。然信毀禍福，素有誠言，及至臨終，果招其咎，舌出長餘一尺，氣奔經乎數晨。既出牛聲，不知豹變。無間極苦，夫復何疑！後之學者，幸知前事也。0167a25"
        ],
        [
          740,
          "緣使中人未分於存亡下士撫掌而不顧者。",
          "老子云：「上士聞道勤而行之，中士聞道若存若亡，下士聞道大笑之，不笑不足以為道。」今借此語也，中人聞此動靜不二，未能決定，或信或疑，故云未分於存亡。下人聞此決定不信，故云撫掌而弗顧。撫掌拍手也，弗顧不視也。0167a25"
        ],
        [
          739,
          "近而不可知者其唯物性乎者。",
          "動靜不二，物之性也。近對目前而人不覺，今傷歎之，故云爾也。0167a25"
        ],
        [
          19,
          "然不能自已下",
          "第四申論意也。已，止也。豈曰必然者，未必然也。0167c07"
        ],
        [
          20,
          "道行云諸法本無所從來去亦無所至下",
          "第二正是論文也。文有六章，第一引經明不遷，第二指物明不遷，第三遣惑明不遷，第四會教明不遷，第五反常明不遷，第六結會明不遷。今初。\n引一經一論，以標於指歸，明不遷之宗本也。道行者，小品般若也。叡法師小品序云：章雖三十，貫之者道。言雖十萬，佩之者行。行凝然後無生。道足然後補處也。\n中觀者，中論一名中觀論，以此論中明觀因緣等法故也。然彼論中，無有此語，應是取去來品意耳。去來品云：「已去無有去，未去亦無去。離已去未去，去時亦無去。」今取此意，故云「去者不至方也。」0167c09"
        ],
        [
          742,
          "斯皆即動而求靜以知物不遷明矣者。",
          "經云無來無去，論云無去，此之二文，皆是即去明無去，非謂離去有無去。即去無去，是謂不遷之義，一論之旨歸也。0167c09"
        ],
        [
          21,
          "夫人之所謂動者下",
          "第二指物明不遷也。人以昔物去今，故名為動。我以昔物在昔，故名為靜。\n動而非靜以其不來靜而非動以其不去者。餘本皆云「靜而非動以其不來，動而非靜以其不去。」句上可釋，下句難解。今勘古本如前說也。動而非靜以其不來者，此覆人之所謂動句也。靜而非動以其不去者，此覆我之所謂靜句也。人以昔物去今而往昔，故曰動而非靜。我以昔物在昔而不去，故曰靜而非動也。0167c25"
        ],
        [
          745,
          "然則所造未嘗異下。",
          "廣雅云：造，詣也。爾雅云：造，適也。嘗有兩義，一者曾義，二者常義。莊子云：「夫言非吹也，言者有言，其所言者特未定也。」果有言耶？其未嘗有言耶？此是曾義。又云，仲尼語顏回曰「若必有以也，嘗以語我來！」此是常義也。目所造詣未嘗有異，而心眼所見未曾有同也。0167c25"
        ],
        [
          744,
          "逆之所謂塞順之所謂通者。",
          "逆理則塞，順理則通。逆理謂人也，順理謂已也。0167c25"
        ],
        [
          743,
          "苟得其道復何滯哉者。",
          "苟，且也。且得其道理，則動靜不二，更無疑滯也。0167c25"
        ],
        [
          22,
          "傷夫人情之惑久矣下",
          "第三遣惑明不遷也。傷是傷歎也。目對真而莫覺者，此亦謂不遷之事。理審如此，故名為真，未必即是真諦也。莫覺者不覺也。0168a15"
        ],
        [
          753,
          "既知往物之不來而謂今物之可往者。",
          "敘或情也。往物既不來今物何可往者，難惑計也。0168a15"
        ],
        [
          752,
          "何則求向物於向於向未嘗無者。",
          "求昨日物於昨日，則昨不無也。責向物於今於今未嘗有者，責昨日物於今日，則今日不有也。於今未嘗有以明物不來者，此是前動而非靜，以其不來句意也。於向未嘗無故知物不去者，此是前靜而非動，以其不去句意也。0168a15"
        ],
        [
          751,
          "覆而求今今亦不往者。",
          "前之兩對，直明往而不來。今以今類往亦復如是也。0168a15"
        ],
        [
          750,
          "是為昔物自在昔不從今以至昔者。",
          "此是不去也。今物自在今不從昔以至今者，此是不來也。0168a15"
        ],
        [
          749,
          "故仲尼曰回也見新交臂非故者。",
          "莊子外篇田子方章云：孔子謂顏回曰「吾終身與汝交一臂，而失之，可不哀與。」郭象注云：「夫變化不可執而留也，故雖交臂相守，而不能令停。」今用此語也。見新者。謂故人已謝，新人自來也。交臂非故者，交臂相守，亦已謝往，非後故人也。此依郭注釋也。今謂郭注不然！今言交一臂而失之者，謂交一臂之頃已失前人，非謂交臂執手不能令停也。明知交臂之頃，前已非後，言誰遷耶！0168a15"
        ],
        [
          748,
          "如此則物不相往來明矣者",
          "然前已非後，則是遷義。而言不遷者。此明無有一物定住、而從此遷向彼，故曰不遷也。如此則物不相往來明矣者。若前人至後，後人至前，可謂往來。既不如此，故無往來也。0168a15"
        ],
        [
          747,
          "既無往返之微朕又何物而可動乎者。",
          "朕字有二音，一者陳錦反，出《爾雅》；二者陳忍反，出許慎注《淮南子》。按事之萌兆，謂之朕。今是後音也。李奇云：朕，兆也。莊子云：體盡無為而遊無朕。郭注云：任物故自然無迹。朕，跡也。既無往返之跡，故知不動也。0168a15"
        ],
        [
          746,
          "然則旋藍偃岳而常靜下。",
          "旋藍，劫初時大風名也，亦曰隨嵐，梵音輕重之異耳。有本云旋嵐。嵐者，此方之風名也。旋嵐即旋風也。又釋修行道地經云：興雲之風，名旋嵐也。向前為俯，向後為偃，偃臥倒也。岳者，山也。江河者，有本云江海，言海不及河也。莊子云：野馬塵埃也。郭注云：野馬者遊氣也。遊氣奔競，喻如野馬飄揚也，鼓動也。日月歷天者，有本云麗天，言歷易見也，日月周旋故言歷也。麗者，易云「日月麗乎天，百穀草木麗乎土」，小雅云「麗，著也」。前風非後風，故偃岳而常靜。前水非後水，故競注而不流。前氣非後氣，故飄鼓而不動。前日非後日，故歷天而不周。華嚴經云「譬如長風起，鼓拂生動勢，二俱不相知，諸法亦如是。」譬如駃水流，水流無定止，二俱不相知，諸法亦如是。肇法師不見華嚴，而作論冥合，自非妙悟玄理，何至於斯乎！0168a15"
        ],
        [
          23,
          "噫聖人有言下",
          "第四會教明不遷也。文有兩段，通是會教，前廣、後略。今初也。\n噫者。《論語》云「噫！斗筲之人，何足算也。」註云「噫，不平之聲也」。《切韻》云「噫者，恨聲也。」\n聖人者。《大戴禮》云：哀公問孔子「何謂聖人？孔子曰：聖人者，智通乎大道，應變而不窮也。」莊子云「以德分人謂之聖，以財分人謂之賢也。」0168c08"
        ],
        [
          776,
          "速於川流者。",
          "涅槃經云「人命不停，過於山水。」非論語中歎逝，下文方引論語耳。此意云，聖教自云人命逝速，即是遷義。何謂不遷耶？人有此疑。故今遣釋也。0168c08"
        ],
        [
          775,
          "是以聲聞悟非常以成道緣覺覺緣離以即真者。",
          "以法是遷流故，聲聞聞無常教，悟無常理而成道也。亦以法是遷流故，緣覺覺無常理，而得證真也。0168c08"
        ],
        [
          774,
          "苟即萬動而非化豈尋化以階道者。",
          "且使萬物非是遷流變化，何由尋此無常遷化之理，而得道耶？固應是遷也。0168c08"
        ],
        [
          773,
          "覆尋聖言微隱難測者。",
          "前如問此如答也。微者小也。老子云「視之不見名曰夷，聽之不聞名曰希，搏之不得名曰微也。」測者，測量也。有本云「喻，謂曉喻也。」0168c08"
        ],
        [
          772,
          "若動而靜似去而留者。",
          "據言教，則如動如去也；據理實，則如靜如留也。0168c08"
        ],
        [
          771,
          "可以神會難以事求者。",
          "可以般若神心契會，不可以言迹事相而求也。0168c08"
        ],
        [
          770,
          "是以言去不必去閑人之常想者。",
          "服虔注《漢書》云「閑，闌」也。王弼注《易》云「閑，閡」也。若蘭若閡，皆是防義。釋者，小雅云「釋解」也，若釋皆是遣義也。經中言諸法生滅無常，是謂去也。謂無常者，未必即無常。為防人之常執。故說無常耳。經中又言業果不失。是謂住也。0168c08"
        ],
        [
          781,
          "言有住者。",
          "不必即住。為防人執斷之心，故言住耳。0168c08"
        ],
        [
          769,
          "豈曰去而可遣住而可留者。",
          "有本云「去而可追，非也，法性不去。」經中言去，不能遣得法性令其去也。法性不住，經中言住，不能留得法性令其住也。當知為緣故說去，其實則非去。為緣故說住，實亦非住也。0168c08"
        ],
        [
          768,
          "故成具云菩薩處計常之中而演非常之教者。",
          "《光明定意經》也。彼文云「如來者，不用衣食。處計常之中，而知無常之諦。」今取彼經意，故云菩薩耳。0168c08"
        ],
        [
          767,
          "摩訶衍論云者。",
          "大智度論，釋摩訶衍經。故名彼論無摩訶衍論。摩訶衍，梵音，此云大乘也，即大品經也。0168c08"
        ],
        [
          766,
          "斯皆導達群方兩言一會者。",
          "導，謂引。達，謂通達。群方，謂眾生。言聖人引導眾生多方便也，雖有多方，會歸一致耳。亦可群自是群，方自是方。易云「方以類聚，物以群分。」聖人道此，故有兩說耳。0168c08"
        ],
        [
          765,
          "豈曰文殊而乖其致哉者。",
          "不可以言去言住兩文有殊，則令法性幽、致乖阻也。0168c08"
        ],
        [
          764,
          "是以言常而不住稱去而不遷者。",
          "言常未常，故不住也。稱去未必去，故不遷也。已後覆疏此語可見。0168c08"
        ],
        [
          763,
          "然則莊生之所以藏山仲尼之所以臨川者。",
          "《莊子·內篇·大宗師》章云「夫藏舟於壑，藏山於澤，謂之固矣。然而夜半有力者負之而走，昧者不知也。」<sup title='下句有「若夫藏天下于天下而不得所遁，是恒物之大情也。」'>*</sup>論語云「子在川上曰，逝者如斯夫，不捨晝夜。」莊子意明前山非後山，孔子意前水非後水也。0168c08"
        ],
        [
          762,
          "斯皆感往者之難留豈曰排今而可往者。",
          "此二人皆感歎「往者不停，前後各別」，非謂定有一物，從此推排至彼也。所以引此二書。\n證成不遷者。夫教之為體，意在悟物。若於物有悟，教則為益。若於物無益，教反成損。依向經論廣說不遷，恐儒道二家疑而不信，故引二文令其悟解耳。事如佛教說戒，以不殺為先。俗人好殺，豈能領會。若即俗書以明不殺，則無不從順也。孟子云「五畝之宅樹之以桑，則七十者可以衣帛矣。鷄㹠犬彘養不失時，則八十者可以食肉矣。」若據此文，則七十已下不合衣帛，八十已下不合食肉。慈悲不殺，豈獨佛經。以此相證，誰能不信。今引二書意同此也。0168c08"
        ],
        [
          760,
          "是以覩聖心者不同人之所見得者。",
          "有本云用，有本云同，俱得也。經中言常、言無常，聖人之心難見得，人之常心則不見聖心也。何者？0168c08"
        ],
        [
          759,
          "人則謂少壯同體、百齡一質者。",
          "常人謂昔日少年，後遷至壯，故云同體，百年同是一身，更非別人也。0168c08"
        ],
        [
          758,
          "徒知年往不覺形隨者。",
          "徒，虛也。年往形亦往，此是遷義。即此遷中有不遷也。往年在往時，往形在往日，是謂不遷。而人乃謂往日之人遷至今日，是謂惑矣。是以梵志出家下，此事未詳所出經也。0168c08"
        ],
        [
          757,
          "昔人尚存乎者。",
          "謂昔人猶存至今日也。吾猶昔人者，猶，如也。如似昔人，實非昔人也。亦可云，吾身雖復猶是昔人，其實非昔人也。亦可云，汝謂吾猶是昔人，其實非昔人也。亦可云，吾可猶是昔人乎？吾非復昔人也！0168c08"
        ],
        [
          756,
          "隣人皆愕然非其言者。",
          "愕謂驚愕，不解其言故驚愕也。0168c08"
        ],
        [
          755,
          "所謂有力者負之而趨者。",
          "有力謂無常力也，負謂擔負也。趨疾行也。昧謂暗昧也。0168c08"
        ],
        [
          754,
          "歟者。",
          "此字單作自得。不勞著欠。此謂助語。如焉乎之類也。0168c08"
        ],
        [
          24,
          "是以如來因群情所滯即方言以辨惑者",
          "第二略會教明不遷也。因物情滯有，即為說動教。因物情滯無，即為說靜教。而言方言者，隨方之言，說教以遣其惑也。0169c07"
        ],
        [
          737,
          "乘莫二之真心吐不一之殊教者。",
          "知動靜不二是莫二，即真心也。說動靜兩教，是不一之殊教也。0169c07"
        ],
        [
          736,
          "乖而不可異者其唯聖言乎者。",
          "言乖，乖而理不可異也。故談真有不遷之稱、導俗有流動之說，真則言不遷，導俗流則言遷也。0169c07"
        ],
        [
          735,
          "雖復千塗異唱會歸同致者。",
          "說動說靜有異，理唯是一，所謂動即靜也。0169c07"
        ],
        [
          734,
          "而徵文者聞不遷則謂昔物不至今者。",
          "執靜教也，徵謂徵責也。0169c07"
        ],
        [
          733,
          "聆流動者而謂今物可至昔者。",
          "《蒼頡篇》云「聆，聽也」。聞說動，則謂今物流動，謝往去也。0169c07"
        ],
        [
          732,
          "既曰古今而欲遷之者何耶者。",
          "昔自在昔，何須遷至今。今自在今，何須遷至昔耶。是以言往不必往下。經中言遷。未必即遷。以古在古。以今在今故也。稱去不必去下。此句意同上。而語別也。0169c07"
        ],
        [
          731,
          "不來故不馳騁於古今者。",
          "馳騁，走也。古不來今，今不去古也。不動故各性住於一世者。此句意同上。而語別也。古今各定。故云各性於一世也。0169c07"
        ],
        [
          730,
          "然則群籍殊文下。",
          "群籍謂經書也，百家謂子書。九經雖殊，同明一教。百家雖異，同明一道。以喻佛經雖眾，言迹不同。莫不同，明一致。得其道理，文言不能惑亂也。0169c07"
        ],
        [
          25,
          "是以人之所謂住我則言其去下",
          "第五反常明不遷也。人謂從少至老仍是一人。故名為住。我言前人非後。故名為去。人謂昔人已往。故名為去。我言昔人在昔。故名為住也。然則去住雖殊其致一也者。我言去之與住。不相違反。取其念念變異故言去。取其各住一世故言住。此則住猶是去。去猶是住也。故經云正言似反誰當信者。中本起經云爾。斯言有由者。謂經此言有所以也。0170a03"
        ],
        [
          729,
          "何者人則求古於今謂其不住者。",
          "以昔物去至昔。不在今也今。將為不住也。吾則求今於古知其不去。以今物自在今。不去至昔。將為不去也。已下覆疏此二句也。事各性住何物而可去來者。事物也。物各住其本性。各住一世。故無去來也。0170a03"
        ],
        [
          728,
          "然則四像風馳下。",
          "舉事釋成也。四像謂四時之像。馳謝如風。故云風馳也。𢭀機電卷者。此𢭀字多遂手邊作𭻾。人家不解。乃引尚書文釋。謂言此字為非。尚書云。在璿璣玉衡以齊七政。孔注云。在察也。璿美玉也。機衡也。玉者正天文之器。可以運轉。舜察天文。考七政。以審已當天位與不。若作此釋。則𢭀字合玉邊作睿也。今謂不然。此是北斗樞星名也。北斗七星。一天樞。二𢭀。三機。四權。五衡。六開陽。七搖光。今不能具道七星。故但言𢭀機二星耳。七星運轉猶如電卷也。雖四象七星運轉流速。得其理也亦常不動也。王弼略例云。處𢭀機而觀大運。則天地之動未足怪也。此意亦指七星也。0170a03"
        ],
        [
          26,
          "是以如來功流萬世而常存下",
          "第六結會明不遷也。萬世百劫蓋語多也。積功萬世，前功在於前積道百劫。蓋昔道在於昔，不朽不失，彌復堅固也。0170b02"
        ],
        [
          727,
          "成山假就於始簣者。",
          "論語云「譬如為山，雖覆一簣，進者吾往也。」注云：簣，土籠也。積簣土以成山。前功在於前而不失，故積多而成山也。0170b02"
        ],
        [
          726,
          "修途託至於初步者。",
          "老子云「九層之臺，起於累土；千里之行，始於足下。」積一步以至多故，至千里者，無由一步，故云託至也。託是假託也。0170b02"
        ],
        [
          725,
          "果以功業不可朽故者。",
          "此之四事，皆前功不朽，後功相續，方成其事耳。0170b02"
        ],
        [
          724,
          "雖在昔而不化者。",
          "昔功在於昔，於昔不失，故云不化。不化故云不遷，以不遷故。事如常在，故曰湛然也。0170b02"
        ],
        [
          723,
          "故經云三災彌淪而行業湛然者。",
          "彌淪遍滿義。《周易·系辞》云「易與天地准，故能彌淪天下之道耳。」此經未詳也。0170b02"
        ],
        [
          722,
          "何者夫果不俱因因因而果者。",
          "因果不同處，故曰不俱。由因而得果，故云因因而果也。因不昔滅者，在昔不滅。因不來今者，昔因不來至今果也。0170b02"
        ],
        [
          721,
          "不滅不來則不遷之致明矣者。",
          "既不滅失，又復不來，故言不遷也。0170b02"
        ],
        [
          720,
          "復何惑於去留踟蹰於動靜之間哉者。",
          "知去留無二，故不惑也。知動靜不二，故不踟蹰也。踟蹰者，不進貌也。0170b02"
        ],
        [
          719,
          "然則乾坤倒覆無謂不靜。",
          "乾，天也。坤，地也。雖倒天而覆地，莫言不靜也。0170b02"
        ],
        [
          718,
          "洪流滔天無謂其動者。",
          "堯遭九年之潦，洪水滔天，猶是靜也。0170b02"
        ],
        [
          717,
          "苟能契神於即物斯不遠而可知者。",
          "以神情與物理相契，即物知不遷不復遠也。0170b02"
        ]
      ],
      "tag": "康"
    },
    "惠": {
      "col": 0,
      "desc": "X0866 肇論疏，晉·惠達",
      "name": "X0866_001_002",
      "notes": [
        [
          410,
          "0072b09",
          "上明佛果。此下二論明生死因果相對。上則辨果。此則論因。又境智相對。上已明智此復辨境。今此二論先觀俗入真。故不遷明俗。不真明真也。今不言遷而云不遷者。立教本意只為中根執無常教者說。故云中人未分於存亡。下士撫掌而不領。何者。如來說法去常故說無常。非謂是無常。去住故說不住。非謂是不住。然即理反常心之境。教有非常之說也。而少心者造極不同聽心異。聞無常分取流動。聞不住即取生滅。因緣著偏。乖之彌遠。故立不遷破除內執。斯蓋反其常情乃合於道。故以不遷立言也。"
        ],
        [
          419,
          "0074b08",
          "第五科。是以如來下。舉因果以勸學。有三段。初。舉果勸因不滅。次。舉因勸果必生。後。勸齊萬物。",
          651,
          "0074b08",
          "功流萬世至彌固。此是舉果也。從成山至初步。譬因不滅也。功不可杇故在昔而不化者。以功業不滅證不遷之致也。故下。引經證果不滅也。"
        ],
        [
          652,
          "0074b08",
          "次段。何者。舉因勸果必生也。果不俱因因因而果者。立兩章門。因因而果因不昔滅者。釋因不滅也。果不俱因因不來今者。釋因不來。斯即不滅不來。果義得生。正不遷之致也。"
        ],
        [
          653,
          "0074b08",
          "復何惑下。勸無惑也。後段。然即。結宗勸學也。"
        ],
        [
          411,
          "0072b18",
          "文有二義：一、明造論，二、道行云下，正辨論體。",
          412,
          "0072b20",
          "夫生死交謝寒暑迭遷者，生死之變猶冬夏而時行也。有物流動人之常情者，唯有法流動不及無為者。中人以下皆共知之。此是標宗也。"
        ],
        [
          642,
          "0072b22",
          "今即下，正明造論所由。有二科：一、立宗。二、或者下，正明所由。",
          643,
          "0072b22",
          "立宗中有三段。初，依經立宗；次，破；後，結也。",
          644,
          "0072b22",
          "今即謂之不然者。總反惑情。何者下，依經立宗也。"
        ],
        [
          654,
          "0072b22",
          "次，尋夫下，破舊義也。尋夫不動之作。豈釋動以求靜。必求靜於諸動者。正破舊義。",
          645,
          "0072b22",
          "彼云不遷者。賴於續假。轉前作後名為動法。若許實法即無動轉。故法與時俱。時與法俱。轉變後法還舒於前。名為不動。此即釋動以求靜也。",
          646,
          "0072b22",
          "過去法來不來有三說。第一云。過去雖滅而曾為因。故相續行者成就此因。因非轉來。在於現附也。",
          647,
          "0072b22",
          "第二云。因體有為。當時即滅。而善惡功用湛然常在也。",
          648,
          "0072b22",
          "第三云。善惡功用隨心轉來。來至現在者也。",
          649,
          "0072b22",
          "今於三宗亦同不同。但言而無當。取汝言賴續故動者。為當前法續後。為當後法接前。若前法續後。前時未有。後云未有。何續。若後法接前。後起前已謝。何處接。動亦例然。今即不然。求是推求。以三時求動。動相不可得。故云求靜於諸動。下句可解。"
        ],
        [
          650,
          "0072b22",
          "後段。然即動靜未始異者。結宗也。"
        ],
        [
          414,
          "0072c15",
          "第二科。而惑者下。明所由。有三段。初。明辨理者不同。而或者不同句。亦可屬上。亦牽於下。次。明道相反。後。明所為人也。",
          655,
          "0072c15",
          "真言滯於競辨者。佛言無當而滯於偏執也。",
          656,
          "0072c15",
          "宗途屈於好異者。理無二途而屈於是非。即是於諦義也。所以求那法師偈云。諸論各異端。修行理無二。偏執有是非。達者無違諍也。"
        ],
        [
          657,
          "0072c15",
          "次。何者下。明道俗相反。教亦相違。",
          658,
          "0072c15",
          "談真即逆俗順俗即違真者。俗。習也。言真之教違於俗。順俗之教反於道也。違真故下。明行亦反也。"
        ],
        [
          659,
          "0072c15",
          "後段。緣使中人下。明所為中人未分於存忘者。疑於有道若存。疑於無道若亡也。",
          660,
          "0072c15",
          "下士撫掌而弗脣者。異己所見。其乖常情。對牛皷簧。非彼能覺。故大咲而弗脣也。"
        ],
        [
          661,
          "0072c15",
          "動靜之際之。莊生云。鴈木之間猶未免有累。故竟不處。",
          662,
          "0072c15",
          "今肇師亦爾。處遷不遷之間。設投處猶未免偏。竟不處也。此釋造論意之也。"
        ],
        [
          415,
          "0073a05",
          "第二。道行下。正辨論體。有五科。一。依經論立宗。二。傷夫下。破去來明不遷。三。噫聖人下。徵教。四。是以覩下。約愚智二人明取教得失。五。是以如來下。明因果無失以觀覺。",
          663,
          "0073a05",
          "初科有三段。初。依經論標宗。次。就二人釋經論意。後。明趣無二也。",
          664,
          "0073a05",
          "非常之說常情難悟。故以引標不遷教。此經語可作兩釋。一。諸法本來不生故無去來。二。以假異明無去來。然推假異即離無當。即是本來不生之義。復引中觀標動靜無二也。"
        ],
        [
          665,
          "0073a05",
          "復引中觀標動靜無二也。次段就二人釋。先釋中觀意。以昔物不至今故動而非靜者。"
        ],
        [
          666,
          "0073a05",
          "人情所謂本時無法。今有名現。而現法流入過去更不遷今。故動而非靜也。"
        ],
        [
          667,
          "0073a05",
          "我之所謂靜者。亦昔物不至今。靜而非動者。同事異悟。已過之法更不來今。昔物自在昔。即靜而非動也。",
          668,
          "0073a05",
          "靜而非動以其不來者。即釋經語。已之法更不來今。以知昔物不來於今也。動而非靜以其不住者。流入過去無去。剎那並於現。以知不住也。一義是眠生時無所從來亦無所去也。"
        ],
        [
          669,
          "0073a05",
          "後段。然即下。明旨趣無二。動靜所趣未曾異執。見未嘗同也。逆之所謂塞順之所謂通者。偏執即逆塞。忘懷即順通。然即理無動靜而取動靜者。論於或若即動靜而無動靜者。契會無二矣。"
        ],
        [
          416,
          "0073b01",
          "第二科。傷夫下。破去來明不遷。有三段。初。傷凡情表不遷。次。破去來明不遷。後。引外聖證不遷也。",
          670,
          "0073b01",
          "傷夫人情之或久矣。目對真而莫覺者。若聖智對。五目莫見其形。斯乃道遠乎哉。迷情即是因緣。道遠乎哉。因緣即是中。故云因緣所生法。我說即是空。亦為是假名。亦是中道義。而凡夫宍眼冥然不知。如對牛皷簧。彼非所悟也。"
        ],
        [
          671,
          "0073b01",
          "既知往物既不來今物何往者。已過之法更不來今。今不住法亦不移時也。"
        ],
        [
          676,
          "0073b01",
          "次。何則下。破去來。即釋道行意。此中先就向物以四句明無去來也。初兩句立有無義。於今嘗有下兩句。正明向物無去來也。"
        ],
        [
          672,
          "0073b01",
          "覆而求今今亦不往者。應有四句。求今物於今於今未嘗無。責今物於向於向未嘗有。於向未嘗有以知物不去。於今未甞無以知物不來也。是為下。舉今昔兩物結明不遷也。"
        ],
        [
          673,
          "0073b01",
          "後段。仲尼下。引外聖證不遷教。所謂外內雖殊所明理同是也。"
        ],
        [
          674,
          "0073b01",
          "有何物而可動者。經中觀意也。"
        ],
        [
          675,
          "0073b01",
          "然即下。齊萬物而結不遷也。釋論云。光風動塵野馬之中如野馬者也。"
        ],
        [
          417,
          "0073b18",
          "第三科。噫下。徵教。有三段。初。舉無常教以徵今說。次。人情不同教非一軌。後。引外聖證無常教同也。",
          677,
          "0073b18",
          "人命速於川流者。舉仲尼教也。"
        ],
        [
          678,
          "0073b18",
          "是以下。三乘證果執無常教也。"
        ],
        [
          679,
          "0073b18",
          "齊萬物而非化豈尋化以階道者。證教非謬也。"
        ],
        [
          680,
          "0073b18",
          "覆尋聖言微隱難測者。正徵今記。䨱者䨱無常教。尋不遷意。結理難解也。若動而靜似去而留。可以神會者。推於大士。非中下所知也。"
        ],
        [
          681,
          "0073b18",
          "次段。是以下。明人執不同。教非一軌。有三階。一。明去住兩教之意。二。正出兩教。三。兩教一會也。",
          682,
          "0073b18",
          "言去不必去閑人之常想者。言無常不必無常。但防計常之想也。"
        ],
        [
          683,
          "0073b18",
          "秤住不必住釋人之不住者。言不遷不必是不遷。但解計往之想。後住字當為往也。",
          684,
          "0073b18",
          "若用住字釋者。常字亦不可以計常之常。應以常情而釋之耳。"
        ],
        [
          685,
          "0073b18",
          "二。成具下。正出經。成具明無常教。摩訶衍明不遷教也。"
        ],
        [
          686,
          "0073b18",
          "三。斯皆下。兩教一會。是以下。釋意。三雙六句。言常而不住。"
        ],
        [
          687,
          "0073b18",
          "言常而不住。秤去而不遷者。此二句勸取教莫偏也。不遷故雖往而靜。",
          688,
          "0073b18",
          "不住故雖靜而往者。此二句明教意相通也。雖靜而往故往而弗遷。",
          689,
          "0073b18",
          "雖往而靜故靜而弗留者。此二句明物無動靜也。"
        ],
        [
          690,
          "0073b18",
          "後段。然即下。引外聖證無常教。同莊生如上所云也。仲尼臨川云人命逝速如斯也。"
        ],
        [
          418,
          "0073c14",
          "第四科。是以覩下。約愚智二人取教得失。有二段。初。明為二人起教不同。次。明取教得失。後。反常合道。",
          691,
          "0073c14",
          "初段有二階。一。明二人。二。明起教也。",
          692,
          "0073c14",
          "不同人所見得明者。下不及上也。"
        ],
        [
          693,
          "0073c14",
          "何者下。出二人。隣人是或。梵為智者。從初至形隨。是出惑情。以梵志下。正出其事也。",
          694,
          "0073c14",
          "吾猶昔人非昔人者。可作兩釋。一云。吾豈昔人乎。非昔人也。一云。猶。若也。吾若昔人。",
          695,
          "0073c14",
          "非昔人也。一息一得。向息非今息。昨日之人於今化矣。而愚者竊然。以為昔人常存。此不朽物化也。"
        ],
        [
          696,
          "0073c14",
          "二。明起教不同。是以如來因群生以辨惑者。教起無端。病除是貴。故此句出病。明起教所由也。",
          697,
          "0073c14",
          "乘莫二之真心下。正明起教不一也。"
        ],
        [
          698,
          "0073c14",
          "不遷為俗而云不遷為真者。謂情為俗。即反常為真故也。"
        ],
        [
          699,
          "0073c14",
          "後段。而徵下。正明得失。有二階。",
          700,
          "0073c14",
          "一。因教著偏。聞不遷即昔物可至今者。凡人所謂時年雖移。人之質體古今不異。如以指進薪火傳不滅。而不知指火與薪俱謝也。聽流動即謂流入過去。而不知支火非今火也。今即正破。既云古今。古即在於古。今即在於今。而云遷者何也。"
        ],
        [
          701,
          "0073c14",
          "二。是以下。勸著不遷教。",
          702,
          "0073c14",
          "言住不必住。古今常存。以其不動者。",
          703,
          "0073c14",
          "言所謂住。不必是住。",
          704,
          "0073c14",
          "言其非動。非謂是住。即不住之住。",
          705,
          "0073c14",
          "古今不動也。一云。從彼至此乃是住義。古不至今何處有住。",
          706,
          "0073c14",
          "古不至今故無住者。今亦不往於古。言其不動。",
          707,
          "0073c14",
          "又住是對動之言。無動故無住也。",
          708,
          "0073c14",
          "秤去不必去。不從今至古。以其不來者。言去不必是去。言其非來。非謂是去。即不去之去。古今不住也。",
          709,
          "0073c14",
          "一云從今至古乃是去義。今不至古。何處有去。今不至古故無去者。古亦不來於今。言其不來。又去是對來之言。無來故無去也。"
        ],
        [
          710,
          "0073c14",
          "不來故下。結不遷。"
        ],
        [
          711,
          "0073c14",
          "然即下。會教也。"
        ],
        [
          712,
          "0073c14",
          "後段。是以人下。反常合道。有三階。",
          713,
          "0073c14",
          "一。反其常情及合於道。故云人所謂住我即言去也。求那偈云。諸論各異端。修行理無二。偏執有是非。達者無違諍。故去來雖殊其旨無二也。正言似反誰當信者。通理無言。言因病起。相治之力無非相反。故河上云。正直之言世人不知。以為反言也。"
        ],
        [
          714,
          "0073c14",
          "二。何者下。就二人釋反常義。人即求古於今謂其不住者。凡情求古於今。今而無古。以古物不住也。吾即求今於古知其不去者。吾即求今於古。古而無今。以知今物不去也。下釋就文可見也。"
        ],
        [
          715,
          "0073c14",
          "然下。齊萬物。四象者。老子云。大象者四象之母也。不炎不寒不溫不涼。言若執之即天下往。今即四像謂炎溫寒涼加風馳之速也。",
          716,
          "0073c14",
          "旋機電卷者。尚書云。旋機玉衡以齊七政。窂。天文之器也。如今運天圖也。例略云。故處旋璣以觀大運。見天地之運未足恠之者也。"
        ]
      ],
      "raw": [
        [
          410,
          "0072b09",
          "上明佛果。此下二論明生死因果相對。上則辨果。此則論因。又境智相對。上已明智此復辨境。今此二論先觀俗入真。故不遷明俗。不真明真也。今不言遷而云不遷者。立教本意只為中根執無常教者說。故云中人未分於存亡。下士撫掌而不領。何者。如來說法去常故說無常。非謂是無常。去住故說不住。非謂是不住。然即理反常心之境。教有非常之說也。而少心者造極不同聽心異。聞無常分取流動。聞不住即取生滅。因緣著偏。乖之彌遠。故立不遷破除內執。斯蓋反其常情乃合於道。故以不遷立言也。"
        ],
        [
          411,
          "0072b18",
          "文有二義：一、明造論，二、道行云下，正辨論體。",
          412,
          "0072b20",
          "夫生死交謝寒暑迭遷者，生死之變猶冬夏而時行也。有物流動人之常情者，唯有法流動不及無為者。中人以下皆共知之。此是標宗也。"
        ],
        [
          642,
          "0072b22",
          "今即下，正明造論所由。有二科：一、立宗。二、或者下，正明所由。",
          643,
          "0072b22",
          "立宗中有三段。初，依經立宗；次，破；後，結也。",
          644,
          "0072b22",
          "今即謂之不然者。總反惑情。何者下，依經立宗也。"
        ],
        [
          654,
          "0072b22",
          "次，尋夫下，破舊義也。尋夫不動之作。豈釋動以求靜。必求靜於諸動者。正破舊義。",
          645,
          "0072b22",
          "彼云不遷者。賴於續假。轉前作後名為動法。若許實法即無動轉。故法與時俱。時與法俱。轉變後法還舒於前。名為不動。此即釋動以求靜也。",
          646,
          "0072b22",
          "過去法來不來有三說。第一云。過去雖滅而曾為因。故相續行者成就此因。因非轉來。在於現附也。",
          647,
          "0072b22",
          "第二云。因體有為。當時即滅。而善惡功用湛然常在也。",
          648,
          "0072b22",
          "第三云。善惡功用隨心轉來。來至現在者也。",
          649,
          "0072b22",
          "今於三宗亦同不同。但言而無當。取汝言賴續故動者。為當前法續後。為當後法接前。若前法續後。前時未有。後云未有。何續。若後法接前。後起前已謝。何處接。動亦例然。今即不然。求是推求。以三時求動。動相不可得。故云求靜於諸動。下句可解。"
        ],
        [
          650,
          "0072b22",
          "後段。然即動靜未始異者。結宗也。"
        ],
        [
          414,
          "0072c15",
          "第二科。而惑者下。明所由。有三段。初。明辨理者不同。而或者不同句。亦可屬上。亦牽於下。次。明道相反。後。明所為人也。",
          655,
          "0072c15",
          "真言滯於競辨者。佛言無當而滯於偏執也。",
          656,
          "0072c15",
          "宗途屈於好異者。理無二途而屈於是非。即是於諦義也。所以求那法師偈云。諸論各異端。修行理無二。偏執有是非。達者無違諍也。"
        ],
        [
          657,
          "0072c15",
          "次。何者下。明道俗相反。教亦相違。",
          658,
          "0072c15",
          "談真即逆俗順俗即違真者。俗。習也。言真之教違於俗。順俗之教反於道也。違真故下。明行亦反也。"
        ],
        [
          659,
          "0072c15",
          "後段。緣使中人下。明所為中人未分於存忘者。疑於有道若存。疑於無道若亡也。",
          660,
          "0072c15",
          "下士撫掌而弗脣者。異己所見。其乖常情。對牛皷簧。非彼能覺。故大咲而弗脣也。"
        ],
        [
          661,
          "0072c15",
          "動靜之際之。莊生云。鴈木之間猶未免有累。故竟不處。",
          662,
          "0072c15",
          "今肇師亦爾。處遷不遷之間。設投處猶未免偏。竟不處也。此釋造論意之也。"
        ],
        [
          415,
          "0073a05",
          "第二。道行下。正辨論體。有五科。一。依經論立宗。二。傷夫下。破去來明不遷。三。噫聖人下。徵教。四。是以覩下。約愚智二人明取教得失。五。是以如來下。明因果無失以觀覺。",
          663,
          "0073a05",
          "初科有三段。初。依經論標宗。次。就二人釋經論意。後。明趣無二也。",
          664,
          "0073a05",
          "非常之說常情難悟。故以引標不遷教。此經語可作兩釋。一。諸法本來不生故無去來。二。以假異明無去來。然推假異即離無當。即是本來不生之義。"
        ],
        [
          665,
          "0073a05",
          "復引中觀標動靜無二也。次段就二人釋。先釋中觀意。以昔物不至今故動而非靜者。"
        ],
        [
          666,
          "0073a05",
          "人情所謂本時無法。今有名現。而現法流入過去更不遷今。故動而非靜也。"
        ],
        [
          667,
          "0073a05",
          "我之所謂靜者。亦昔物不至今。靜而非動者。同事異悟。已過之法更不來今。昔物自在昔。即靜而非動也。",
          668,
          "0073a05",
          "靜而非動以其不來者。即釋經語。已之法更不來今。以知昔物不來於今也。動而非靜以其不住者。流入過去無去。剎那並於現。以知不住也。一義是眠生時無所從來亦無所去也。"
        ],
        [
          669,
          "0073a05",
          "後段。然即下。明旨趣無二。動靜所趣未曾異執。見未嘗同也。逆之所謂塞順之所謂通者。偏執即逆塞。忘懷即順通。然即理無動靜而取動靜者。論於或若即動靜而無動靜者。契會無二矣。"
        ],
        [
          416,
          "0073b01",
          "第二科。傷夫下。破去來明不遷。有三段。初。傷凡情表不遷。次。破去來明不遷。後。引外聖證不遷也。",
          670,
          "0073b01",
          "傷夫人情之或久矣。目對真而莫覺者。若聖智對。五目莫見其形。斯乃道遠乎哉。迷情即是因緣。道遠乎哉。因緣即是中。故云因緣所生法。我說即是空。亦為是假名。亦是中道義。而凡夫宍眼冥然不知。如對牛皷簧。彼非所悟也。"
        ],
        [
          671,
          "0073b01",
          "既知往物既不來今物何往者。已過之法更不來今。今不住法亦不移時也。"
        ],
        [
          676,
          "0073b01",
          "次。何則下。破去來。即釋道行意。此中先就向物以四句明無去來也。初兩句立有無義。於今嘗有下兩句。正明向物無去來也。"
        ],
        [
          672,
          "0073b01",
          "覆而求今今亦不往者。應有四句。求今物於今於今未嘗無。責今物於向於向未嘗有。於向未嘗有以知物不去。於今未甞無以知物不來也。是為下。舉今昔兩物結明不遷也。"
        ],
        [
          673,
          "0073b01",
          "後段。仲尼下。引外聖證不遷教。所謂外內雖殊所明理同是也。"
        ],
        [
          674,
          "0073b01",
          "有何物而可動者。經中觀意也。"
        ],
        [
          675,
          "0073b01",
          "然即下。齊萬物而結不遷也。釋論云。光風動塵野馬之中如野馬者也。"
        ],
        [
          417,
          "0073b18",
          "第三科。噫下。徵教。有三段。初。舉無常教以徵今說。次。人情不同教非一軌。後。引外聖證無常教同也。",
          677,
          "0073b18",
          "人命速於川流者。舉仲尼教也。"
        ],
        [
          678,
          "0073b18",
          "是以下。三乘證果執無常教也。"
        ],
        [
          679,
          "0073b18",
          "齊萬物而非化豈尋化以階道者。證教非謬也。"
        ],
        [
          680,
          "0073b18",
          "覆尋聖言微隱難測者。正徵今記。䨱者䨱無常教。尋不遷意。結理難解也。若動而靜似去而留。可以神會者。推於大士。非中下所知也。"
        ],
        [
          681,
          "0073b18",
          "次段。是以下。明人執不同。教非一軌。有三階。一。明去住兩教之意。二。正出兩教。三。兩教一會也。",
          682,
          "0073b18",
          "言去不必去閑人之常想者。言無常不必無常。但防計常之想也。"
        ],
        [
          683,
          "0073b18",
          "秤住不必住釋人之不住者。言不遷不必是不遷。但解計往之想。後住字當為往也。",
          684,
          "0073b18",
          "若用住字釋者。常字亦不可以計常之常。應以常情而釋之耳。"
        ],
        [
          685,
          "0073b18",
          "二。成具下。正出經。成具明無常教。摩訶衍明不遷教也。"
        ],
        [
          686,
          "0073b18",
          "三。斯皆下。兩教一會。是以下。釋意。三雙六句。"
        ],
        [
          687,
          "0073b18",
          "言常而不住。秤去而不遷者。此二句勸取教莫偏也。不遷故雖往而靜。",
          688,
          "0073b18",
          "不住故雖靜而往者。此二句明教意相通也。雖靜而往故往而弗遷。",
          689,
          "0073b18",
          "雖往而靜故靜而弗留者。此二句明物無動靜也。"
        ],
        [
          690,
          "0073b18",
          "後段。然即下。引外聖證無常教。同莊生如上所云也。仲尼臨川云人命逝速如斯也。"
        ],
        [
          418,
          "0073c14",
          "第四科。是以覩下。約愚智二人取教得失。有二段。初。明為二人起教不同。次。明取教得失。後。反常合道。",
          691,
          "0073c14",
          "初段有二階。一。明二人。二。明起教也。",
          692,
          "0073c14",
          "不同人所見得明者。下不及上也。"
        ],
        [
          693,
          "0073c14",
          "何者下。出二人。隣人是或。梵為智者。從初至形隨。是出惑情。以梵志下。正出其事也。",
          694,
          "0073c14",
          "吾猶昔人非昔人者。可作兩釋。一云。吾豈昔人乎。非昔人也。一云。猶。若也。吾若昔人。",
          695,
          "0073c14",
          "非昔人也。一息一得。向息非今息。昨日之人於今化矣。而愚者竊然。以為昔人常存。此不朽物化也。"
        ],
        [
          696,
          "0073c14",
          "二。明起教不同。是以如來因群生以辨惑者。教起無端。病除是貴。故此句出病。明起教所由也。",
          697,
          "0073c14",
          "乘莫二之真心下。正明起教不一也。"
        ],
        [
          698,
          "0073c14",
          "不遷為俗而云不遷為真者。謂情為俗。即反常為真故也。"
        ],
        [
          699,
          "0073c14",
          "後段。而徵下。正明得失。有二階。",
          700,
          "0073c14",
          "一。因教著偏。聞不遷即昔物可至今者。凡人所謂時年雖移。人之質體古今不異。如以指進薪火傳不滅。而不知指火與薪俱謝也。聽流動即謂流入過去。而不知支火非今火也。今即正破。既云古今。古即在於古。今即在於今。而云遷者何也。"
        ],
        [
          701,
          "0073c14",
          "二。是以下。勸著不遷教。",
          702,
          "0073c14",
          "言住不必住。古今常存。以其不動者。",
          703,
          "0073c14",
          "言所謂住。不必是住。",
          704,
          "0073c14",
          "言其非動。非謂是住。即不住之住。",
          705,
          "0073c14",
          "古今不動也。一云。從彼至此乃是住義。古不至今何處有住。",
          706,
          "0073c14",
          "古不至今故無住者。今亦不往於古。言其不動。",
          707,
          "0073c14",
          "又住是對動之言。無動故無住也。",
          708,
          "0073c14",
          "秤去不必去。不從今至古。以其不來者。言去不必是去。言其非來。非謂是去。即不去之去。古今不住也。",
          709,
          "0073c14",
          "一云從今至古乃是去義。今不至古。何處有去。今不至古故無去者。古亦不來於今。言其不來。又去是對來之言。無來故無去也。"
        ],
        [
          710,
          "0073c14",
          "不來故下。結不遷。"
        ],
        [
          711,
          "0073c14",
          "然即下。會教也。"
        ],
        [
          712,
          "0073c14",
          "後段。是以人下。反常合道。有三階。",
          713,
          "0073c14",
          "一。反其常情及合於道。故云人所謂住我即言去也。求那偈云。諸論各異端。修行理無二。偏執有是非。達者無違諍。故去來雖殊其旨無二也。正言似反誰當信者。通理無言。言因病起。相治之力無非相反。故河上云。正直之言世人不知。以為反言也。"
        ],
        [
          714,
          "0073c14",
          "二。何者下。就二人釋反常義。人即求古於今謂其不住者。凡情求古於今。今而無古。以古物不住也。吾即求今於古知其不去者。吾即求今於古。古而無今。以知今物不去也。下釋就文可見也。"
        ],
        [
          715,
          "0073c14",
          "然下。齊萬物。四象者。老子云。大象者四象之母也。不炎不寒不溫不涼。言若執之即天下往。今即四像謂炎溫寒涼加風馳之速也。",
          716,
          "0073c14",
          "旋機電卷者。尚書云。旋機玉衡以齊七政。窂。天文之器也。如今運天圖也。例略云。故處旋璣以觀大運。見天地之運未足恠之者也。"
        ],
        [
          419,
          "0074b08",
          "第五科。是以如來下。舉因果以勸學。有三段。初。舉果勸因不滅。次。舉因勸果必生。後。勸齊萬物。",
          651,
          "0074b08",
          "功流萬世至彌固。此是舉果也。從成山至初步。譬因不滅也。功不可杇故在昔而不化者。以功業不滅證不遷之致也。故下。引經證果不滅也。"
        ],
        [
          652,
          "0074b08",
          "次段。何者。舉因勸果必生也。果不俱因因因而果者。立兩章門。因因而果因不昔滅者。釋因不滅也。果不俱因因不來今者。釋因不來。斯即不滅不來。果義得生。正不遷之致也。"
        ],
        [
          653,
          "0074b08",
          "復何惑下。勸無惑也。後段。然即。結宗勸學也。"
        ],
        [
          420,
          "0074b17",
          "不遷論"
        ],
        [
          421,
          "0074b23",
          "肇論疏卷下　　　晉書"
        ],
        [
          422,
          "0074b23",
          "康永三年二月五日寫之。　同十七日點之畢。　此疏惠達法師撰云云。未詳之。"
        ],
        [
          423,
          "0074c01",
          "(寫本云)文永三年七月廿日於光明山東谷往生院敬奉書寫了。"
        ],
        [
          424,
          "0074c03",
          "願以此寫功。自他開惠眼。　三論宗智舜(春秋六十八)。"
        ],
        [
          425,
          "0074c04",
          "(東南院　寫本奧記云)神龜三年歲次乙丑十一月。"
        ],
        [
          426,
          "0074c05",
          "寶龜二年年次辛亥四月卅日沙彌慈晉(云云)。"
        ],
        [
          427,
          "0074c06",
          "文永三年八月廿七日校合之。次加謬點了。寫本之文字不法之間。極難見解。後來之士尋正本可正之耳。"
        ],
        [
          428,
          "0074c09",
          "貞和四年五月談肇論了。而述義中引惠達釋。皆符此書□□□□□。"
        ]
      ],
      "tag": "惠"
    },
    "憨": {
      "col": 0,
      "desc": "X0873 肇論略注，明·德清",
      "name": "X0873_001",
      "notes": [
        [
          571,
          "肇論",
          "肇。乃作者之名。曰僧肇。時稱肇公。論。乃所立之論。蓋以人名論也。公為什門高弟。從譯場翻譯諸經。久參什師。深達實相。比因佛法西來甚少。大義未暢。時人多尚老莊虗無之談。而沙門釋子亦相尚之。多宗虗無以談佛義。各立為宗。如晉道恒。述無心論。東晉道林。作即色遊玄論。晉竺法汰。作本無論。皆墮相言無。都墮斷滅。公愍大道未明。故造此四論。以破邪執。斯立言之本意也。論者。謂假立賓主。徵析論量。以顯正理。摧破邪執。人法雙影。故曰肇論。0330b06"
        ],
        [
          572,
          "後秦長安釋僧肇作",
          "苻堅有國。據關中。號為大秦。暨姚萇篡立。亦號為秦。故史以前後別之。萇崩。其子興。嗣國。什師譯經。當興之時。故公稱後秦。按公傳略云。法師僧肇。京兆人。幼家貧。為人傭書。遂博觀子史。志好虗玄。每以老莊為心要。既而歎曰。美則美矣。然其栖神冥累之方。猶未盡善。後見舊維摩經。歡喜頂受。乃曰始知所歸矣。因此出家。年二十為沙門。名震三輔。什公在姑臧。肇走依之。什與語。驚曰法中龍象也。及歸關中。詳定經論。四方學者。輻輳而至。設難交攻。肇迎刃而解。皆出意表。著般若無知論。什覽之曰。吾解不謝子。文當相揖耳。傳其論至匡山。劉遺民以似遠公。公拊髀歎曰未曾有也。復作物不遷等論。皆妙盡精微。秦主尤重其筆札。傳布中外。年三十二而卒。當時惜其早世云。0330b17"
        ],
        [
          573,
          "宗本義",
          "宗本者。示其立論所宗有本也。以四論非一時作。論既成。乃以宗本義統之。蓋所宗本乎一心。以窮萬法迷悟凡聖之源也。如起信以一心為宗。有法有義。故曰宗本義。0330c08"
        ],
        [
          574,
          "本無。實相。法性。性空。緣會。一義耳。",
          "此標宗揀法。以為四論之本也。本無者。直指寂滅一心。了無一法。離一切相。逈絕聖凡。故曰本無。非推之使無也。以一切諸法。皆一心隨緣之所變現。心本無生。但緣會而生。故曰緣會。以緣生諸法。本無實體。緣生故空。故曰性空。以全體真如所變。故曰法性。真如法性所成諸法。真如無相。故諸法本體寂滅。故曰實相。是以本無。為一心之體。緣會。為一心之用。實相。法性。性空。皆一心所成萬法之義。故曰一義耳。依一心法。立此四論。不遷當俗。不真當真。二諦為所觀之境。般若為能觀之心。三論為因。涅槃為果。故首為宗體。0330c13"
        ],
        [
          575,
          "何則。(此徵起四論。各有所宗)一切諸法。緣會而生。",
          "此下標顯不遷宗體也。寂滅一心本無諸法。本無今有。故曰緣會而生。0331a01"
        ],
        [
          576,
          "緣會而生。則未生無有。緣離則滅。",
          "此顯心本不生。但是緣生。非心生也。以生本無生。故滅亦緣滅。非心滅也。不生不滅一心之義。於是乎顯矣。0331a04"
        ],
        [
          577,
          "如其真有。有則無滅。",
          "此返顯緣生諸法非實有也。真。實也。若諸法果是實有。則不應隨緣散滅。今既隨緣滅。則法非實有矣。0331a08"
        ],
        [
          578,
          "以此而推。故知雖今現有。有而性常自空。性常自空。故謂之性空。",
          "以此緣生緣滅而觀諸法。則知雖今現有而非實有。以體常自空。體常自空。故義說性空。0331a13"
        ],
        [
          579,
          "性空故。故曰法性。",
          "諸法實性即是真如。真如性空。以真如性現成諸法。法法全真。良由真如性空。故諸法性空。稱為法性。0331a16"
        ],
        [
          580,
          "法性如是。故曰實相。",
          "諸法之性全體真如。真如之相本自無相。法性如如。寂滅離相。故曰實相。0331a20"
        ],
        [
          581,
          "實相自無。非推之使無。故名本無。",
          "實相乃真如實體。今既隨緣成一切法。則法法皆真。若觀法法全真。則了無一法可當情者。斯則不待推測使無。則法本無也。萬法本無。又何有一毫可轉動哉。以此而觀諸法。則不遷之旨。昭昭心目矣。上明不遷宗本。0331a23"
        ],
        [
          582,
          "言不有不無者。(此標不真空宗本也)不如有見常見之有。邪見斷見之無耳。",
          "此標立論所破之執也。不如。猶不比也。凡夫外道。定執諸法是實有。確執諸法為斷滅之無。政在所破。但以不字破之。故曰不有不無。0331b06"
        ],
        [
          583,
          "若以有為有。則以無為無。",
          "此出計也。若以諸法為實有。則墮常見。若以諸法為實無。則墮斷見。0331b10"
        ],
        [
          584,
          "夫不存無以觀法者。可謂識法實相矣。",
          "此示正觀也。存無下應添一有字。言不存有無二見以觀法。可謂識法之實相矣。以有無二見。顛倒見也。0331b13"
        ],
        [
          585,
          "雖觀有而無所取相。然則法相為無相之相。聖人之心。為住無所住矣。",
          "此出觀益也。謂離有無二見以觀諸法。則法法寂然。故法雖有而不取相。不取法相。則當體如如。故相即為無相之相矣。諸相無相。寂滅性空。斯則所觀之境空。境空則心自寂。故聖人之心。為無住之住。此心空也。心境俱空。於何不寂。0331b18"
        ],
        [
          586,
          "三乘等觀性空而得道也。性空者。謂諸法實相也。見法實相。故云正觀。若其異者。便為邪觀。設二乘不見此理。則顛倒也。",
          "此約法以顯能觀之人也。三乘之人。同觀性空而得道果。然此諸法性空。即是實相。能見諸法實相。方為正觀。設使二乘不見此理。則同凡夫顛倒矣。此單約諸法盡皆實相。二乘所見偏空。亦是實相性空。若不是實相性空。何以得證道果。意謂法一人異。故下難明。0331c02"
        ],
        [
          587,
          "是以三乘觀法無異。但心有大小為差耳。",
          "此明法一人異也。伏難。難曰。既三乘同見一法。何以證果有差。答曰。其實三乘觀法無異。但為心有大小。故證果有差耳。足知法本是一。但人心大小有異。故所證果不同。以取不取相故耳。非法異也。正若三獸渡河。河本是一。但三獸大小不同。故所履淺深不一。斯乃獸三而河非三也。詳夫立論之意。蓋以不遷當俗。不真當真。二諦為所觀之境。般若為能觀之智。境智為因。涅槃為果。其三乘乃能修之人。故介宗本之中。良有以也。0331c09"
        ],
        [
          588,
          "漚和般若者。大慧之稱也。",
          "此標般若無知宗本也。梵云漚和。此云方便。般若。此云智慧。以有方便之智。乃稱大慧。若無方便。但名孤慧。故所取偏空。非大慧也。前二論真俗二諦。當所觀之境。今漚和般若。為能觀之心。雙照二諦。不取有無。不墮二邊。故云大慧。0331c19"
        ],
        [
          589,
          "諸法實相。謂之般若。能不形證。漚和功也。適化眾生。謂之漚和。不染塵累。般若力也。",
          "此釋大慧之義也。能見諸法實相。是謂般若。雖觀空而不取證。仍起方便度生之事。是仗漚和之功也。適化眾生。乃方便之事。雖涉生死。不被塵勞所累。全仗般若之力也。是以菩薩觀空而萬行沸騰。涉有而一道清淨。淨名云。無方便慧縛。有方便慧解。無慧方便縛。有慧方便解。雙照二諦。不取有無之相。故能出空入假而無礙。故云大慧。0332a02"
        ],
        [
          590,
          "然則般若之門觀空。漚和之門涉有。涉有未始迷虗。故常處有而不染。不厭有而觀空。故觀空而不證。是謂一念之力。權慧具矣。一念之力。權慧具矣。好思。歷然可解。",
          "此重明不證不染之義也。以般若唯照空。漚和唯涉有。以涉有而不迷虗。是仗般若之力。故處有而不染。以不厭有而觀空。故觀空而不取證。是仗漚和之功也。斯則空有不異之二諦。權實不二之一心。同時雙照。存泯無礙。故曰一念之力權慧具矣。好思歷然可解者。勉其用心觀照分明。則心境歷然。權實並顯。當不勞而妙契矣。0332a13"
        ],
        [
          591,
          "泥洹盡諦者。直結盡而已。則生死永滅。故謂盡耳。無復別有一盡處耳。",
          "此標涅槃無名宗本也。言泥洹。亦名涅槃。稱為盡諦者。直是煩惱結盡而已。所謂五住究盡。故二死永亡。是生死永滅。名為盡耳。非復別有一盡處可歸。亦非實有一名可稱也。故曰涅槃無名。四論所宗。一心為本。謂不有不無之二諦。以非知不知之觀照。證不生不滅之一心。因果冥會。妙契環中。宗本之義。盡乎是矣。0332a22"
        ],
        [
          592,
          "物不遷論第一",
          "此論俗諦即真。為所觀之境也。物者。指所觀之萬法。不遷。指諸法當體之實相。以常情妄見諸法。似有遷流。若以般若而觀。則頓見諸法實相。當體寂滅真常。了無遷動之相。所謂無有一法可動轉者。以緣生性空。斯則法法當體本自不遷。非相遷而性不遷也。能見物物不遷。故即物即真。真則了無一法可當情者。以此觀俗。則俗即真也。良由全理成事。事事皆真。諸法實相。於是乎顯矣。論主宗維摩法華。深悟實相。以不遷當俗。即俗而真。不遷之旨。昭然心目。0332b06"
        ],
        [
          593,
          "夫生死交謝。寒暑迭遷。有物流動，人之常情。余則謂之不然。",
          "將明不遷。先立遷流之相。為所觀之境。要在即遷以見不遷。非相遷而性不遷也。是由人迷謂之遷。人悟即不遷。故曰人之常情。余則謂之不然。論主妙悟實相。故總斥之。法華云。不如三界。見於三界。大火所燒。此土安隱。譬如恒河之水。人見為水。鬼見為火。迷悟之分。亦由是也。0332b18"
        ],
        [
          594,
          "何者。(徵釋迷悟之由)放光云。法無去來。無動轉者。",
          "引經立定宗體。此義引彼經第七卷中云。諸法不動搖。故諸法亦不去亦不來等。即法華云。是法住法位。世間相常住。蓋言諸法實相。當體如如。本無去來動轉之相。佛眼觀之。真空冥寂。凡夫妄見。故有遷流。不遷論旨。以此為宗。0332c01"
        ],
        [
          595,
          "尋夫不動之作。豈釋動以求靜。必求靜於諸動。",
          "此依宗出體也。尋究不動之旨。蓋即動物以見真常。非捨動以求靜也。良由全理所成之事。法法皆真。當體常住。非於事外求理。故但言事不遷。不說理不遷也。以即事物以見不遷。故云必求靜於諸動。立論文義有四段。初約動靜以明境不遷。次約境以明物不遷。三約古今以明時不遷。四約時以明因果不遷。此初也。0332c07"
        ],
        [
          596,
          "必求靜於諸動。故雖動而常靜。不釋動以求靜。故雖靜而不離動。",
          "此依體釋義也。必求靜於動。雖萬動陳前。心境湛然。故曰雖動常靜。苟不捨動求靜。故一道虗間。雖應緣交錯。不失其會。如華嚴云。不離菩提場。而徧一切處。所謂佛身充滿於法界。普現一切羣生前。隨緣赴感靡不周。而恒處此菩提座。不悟此理。難明動靜不二之旨。0332c16"
        ],
        [
          597,
          "然則動靜未始異。而惑者不同。緣使真言滯於競辯。宗途屈於好異。所以靜躁之極。未易言也。",
          "此依義辯惑也。其實動靜一源。本來不二。故未始異。但迷者妄見不同。各執一端。真言。如所引不去來動轉等了義之談。以異見不同。故使真實之言滯於競辯而不通。使一乘真宗不能伸暢。返屈於好異之論。如所破心無本無廓然等。皆不了實相而妄生異論。論者以此之故。所以靜躁之極致。難與俗人言也。0332c24"
        ],
        [
          598,
          "何者。(徵釋難言之所以)夫談真則逆俗。順俗則違真。違真故迷性而莫返。逆俗故言淡而無味。",
          "所以難言者。以法不應機。所謂高言不入於俚耳也。若談真則逆俗人之耳。若順俗則違真常之道。若真常不明。則迷者不能使之歸真。若逆俗人之耳。則言之出口淡而無味。此其所以難言也。0333a09"
        ],
        [
          599,
          "緣使中人未分於存亡。下士撫掌而弗顧。",
          "所以難言者。正為根機之不同也。其順真逆俗之言。若上根利智。聞而便信。故不失人。亦不失言。若使中根之人。則猶疑不決。故未分存亡。若下根聞之。則撫掌大笑而不顧矣。存亡撫掌二語。出老子。中士聞道若存若亡。下士聞道大笑之。不笑不足以為道。是知實相妙談。聞而信者實不易得。所以靜躁之極。未易言也。0333a14"
        ],
        [
          600,
          "近而不可知者。其唯物性乎。",
          "此歎不唯信根之難。而真常之法。其實難信難解也。以其觸目皆真。目對之而不覺。可不哀歟。0333a22"
        ],
        [
          601,
          "然不能自已。聊復寄心於動靜之際。豈曰必然。試論之曰。",
          "此言作論之意。為愍迷者。悲興於懷。不能自已。聊爾寄心於動靜之間。以明動靜不二之言。以曉迷者。然非敢謂必然。但試論之耳。0333b02"
        ],
        [
          602,
          "道行云。諸法本無所從來。去亦無所至。中觀云。觀方知彼去。去者不至方。",
          "此引經論以定不遷宗極也。諸法當體寂滅。本自無生。從緣而生。故無所從來。緣散而滅。故去亦無所至。如空中華。無起滅故。中論但義引彼第二論破去來品云。去法。去者。去處。皆相因待。不得言定有定無。是故決定知三法虗妄。空無所有。但有假名。如幻如化。大方無隅。本無定向。去者妄指。其實無方可至。如人往東。究竟不知以何為東也。0333b07"
        ],
        [
          603,
          "斯皆即動而求靜。以知物不遷。明矣。",
          "此下論物不遷也。經言法無來去。則觸目真常。論云去不至方。則去而不去。斯皆即動求靜之微意。證知物不遷明矣。0333b15"
        ],
        [
          604,
          "夫人之所謂動者。以昔物不至今。故曰動而非靜。(如朱顏在昔。今已老耄。以謂流光遷謝。故曰動而非靜)我之所謂靜者。亦以昔物不至今。故曰靜而非動。(以我而觀。朱顏自住在昔。未嘗遷至於今。故曰靜而非動)動而非靜。以其不來。(人之以為遷流者。以少壯不來。故以為動)靜而非動。以其不去。(我之所謂不遷者。以少壯在昔不來今。亦如老耄在今不至昔。故以為靜)然則所造未嘗異。所見未嘗同。(同以昔物不來。而見有動靜之不同)逆之所謂塞。順之所謂通。(迷者以情逆理。故塞。悟者以理達事。故通)苟得其道。復何滯哉(若悟真常。有何相可滯哉)。\n傷夫人情之惑也久矣。目對真而莫覺。",
          "上逆順二言。總申實相之境不異。因人迷悟之不同。故所見有乖。此傷夫下。正出迷情。以觸目皆真。但人迷不覺。良可哀哉。0333c03"
        ],
        [
          605,
          "既知往物而不來。而謂今物而可往。往物既不來。今物何所往。",
          "此總責迷倒也。既知往物不來。則知昔住在昔而不來今。則可例知今物亦不至昔矣。此乃不遷之義也。却謂今物可遷而往。豈不迷哉。0333c08"
        ],
        [
          606,
          "何則。求向物於向。於向未嘗無。責向物於今。於今未嘗有。於今未嘗有。以明物不來。於向未嘗無。故知物不去。覆而求今。今亦不往。是謂昔物自在昔。不從今以至昔。今物自在今。不從昔以至今。",
          "此約今昔不相往來。正明不遷之義也。以向物自住在向而不來。即今求向而不可得。返覆而觀。則知今自住今。而不至向。則不遷之義明矣。以其昔自住昔。今自住今。絕無往來之相。以此觀之。不遷之旨。昭然可見。論初引經論以無去來立定宗體。故返覆論之。0333c15"
        ],
        [
          607,
          "故仲尼曰。回也見新交臂非故。如此。則物不相往來。明矣。",
          "此引孔子之言。以證不遷之義也。義引莊子。仲尼謂顏回曰。吾與汝交一臂而失之。可不哀歟。意謂交臂之頃。已新新非故。蓋言迅速難留之如此也。論主引意。要在迅速極處。乃見不遷之實。楞伽云。一切法不生。我說剎那義。初生即有滅。不為愚者說。賢首解云。以剎那流轉。必無自性。無自性故。即是無生。若非無生。則無流轉。是故契無生者。方見剎那。淨名云。不生不滅。是無常義。論主深悟實相。即在生滅遷流法中。頓見不遷之實。故所引乃遷流之文。以明不遷之旨。非達無生意者。最難轉身吐氣也。0333c23"
        ],
        [
          608,
          "既無往返之微朕。有何物而可動乎。",
          "此結顯妙悟。不落常情也。後結文云。得意毫微雖速而不轉。言諸法湛然。無纖微朕兆來去之相。有何物而可動轉乎。詳其論意。雖云今昔之物本無去來。要見時無古今。平等一際。若達古今一際。則物自無往來。所謂處夢謂經年。覺乃須臾頃。故時雖無量。攝在一剎那。所謂枕上片時春夢間。行盡江南數千里。若以夢事而觀諸法。則時無古今。法無去來。昭然心目。纔入意地。便墮流轉。此非常情可到也。0334a11"
        ],
        [
          609,
          "然則旋嵐偃嶽而常靜。江河兢注而不流。野馬飄鼓而不動。日月歷天而不周。復何怪哉。",
          "此引迅速四事。以證即物不遷。以成上無往返之微朕意也。旋嵐。亦云毗嵐。乃壞劫之風。須彌為之摧。故云偃嶽。野馬。出莊子。乃澤中陽𦦨。飄揚不停。且此四事。常情見之。以為遷流之極。若言不遷。則以為怪。以明眼觀之。本無遷流。復何怪哉。如初引經云。法無去來。無動轉者。正要即動以見不遷。非指靜為不遷也。靜已不遷。又何論之有。故論命題。乃以物物當體不遷。非言相遷而性不遷也。此不遷之旨。正顯諸法實相。非妙悟之士。誠不易見。上已備論不遷之旨。下引教會通。以釋前真言滯於競辯宗途屈於好異。靜躁之極未易言。等文。要人離言會意。不可執言失旨也。0334a22"
        ],
        [
          610,
          "噫。聖人有言曰。人命逝速。速於川流。(此言人命無常。意在密顯真常)是以聲聞悟非常以成道。緣覺覺緣離以即真。(二聖皆以聞無常而證果)苟萬動(法也)而非化。(化言生死無常也)豈尋化以階道。(道。涅槃果也。意謂若萬法不是無常。二乘聖人何以由聞無常而證聖果)覆尋聖言。微隱難測。(返覆推尋聖人之言。雖說無常。而意在密顯真常。所以隱微難測)若動而靜。似去而留。(聖人言雖動而意在顯靜。言似去而意實常住。所以靜躁之極未易言。但可以神會。難以事相求之耳。若不達聖人立言之旨。不能離言得意。將謂實有生死去來之相。執言競辯。此則終不能悟不遷之妙。直須離言得體。方能契會本真耳)可以神會。難以事求(謂滯相則迷真。當契神於物表耳)。\n是以言去不必去。閑人之常想。稱住不必住。釋人之所謂往耳。豈曰去而可遣。住而可留也。",
          "此釋聖言難測。教人離言體妙也。言去言往。乃生死法也。住。乃涅槃常住之果也。凡聖人言生死遷流。不是實有可去之相。但防閑凡夫執常之想耳。所稱涅槃常住。非是實有可住之相。但破二乘厭患生死之情耳。其實生死與涅槃。二俱不可得。豈曰定有生死可遣。實有涅槃可留也。下引證。0334b21"
        ],
        [
          611,
          "故成具云。菩薩處計常之中。而演非常之教。摩訶衍論云。諸法不動。無去來處。斯皆導達群方。兩言一會。豈曰文殊。而乖其致哉。",
          "此明聖人言異而旨一。釋上生死涅槃二法皆空之義也。成具言菩薩以處凡夫計常之中。故說無常以破其執。非是實有生死之相。意在令人即無常以悟真常。如大論云。諸法湛然。常住不動。本無去來。意欲令人即羣動以悟不遷。而常與無常之言。皆導達羣方。隨類應機之談。言異而旨一。豈以殊文而乖其致哉。執言競辯。豈非惑耶。下釋兩言一會。0334c06"
        ],
        [
          612,
          "是以言常而不住。稱去而不遷。(證無為而不捨萬行。故常而不住。處生死而不起涅槃。故去而不遷)不遷。故雖往而常靜。(雖順萬化。而一道湛然)不住。故雖靜而常往。(不起滅定。而現諸威儀)雖靜而常往。故往而弗遷。(以無心意而現行。故常往而弗遷)雖往而常靜。故靜而弗留矣。(不住無為。不捨有為。故靜而不留。此釋兩言一會之義也)然則莊生之所以藏山。仲尼之所以臨川。斯皆感往者之難留。豈曰排今而可往。是以觀聖人心者。不同人之所見得也。",
          "此引二氏之言。證明兩言一會之義也。莊子曰。藏舟於壑。藏山於澤。謂之固矣。有力者負之而趨。昧者不覺。藏天下於天下。則無所遯矣。此言舟山藏於壑澤。將謂之固。然被有力者負之而趨。則不能留。如今人熟睡舟中。順流而去。雖遷實不見其遷。意謂人未忘形合道。縱隱遯山林。寄形天地。然形骸亦被造化密移。而昧者不覺。以有所藏。則有所遯。若形與道合。則無所藏。無藏則無遯。如藏天下於天下。則無所遯。此莊子意也。論語。子在川上曰。逝者如斯夫。不捨晝夜。此歎道體無間。如川流之不息。此孔子意也。論主引文以證不遷。意取昧者不覺。則雖遷而不遷。不捨晝夜。則雖往而不往。故論釋之曰。斯二語者。但是感歎往者之難留。不是排今而可往。斯則言雖似遷而意實不遷。故誡之曰。觀聖人之心。不以常情執言害義。可謂之得矣。論主引遷流之文。而釋以不遷之義。結以不是排今可往。則重在今物自在今。不從昔以至今一語。為不遷之準。要人目前當下直達不遷之旨。了無去來之相。求之言外。則妙旨昭然。0334c21"
        ],
        [
          613,
          "何者。人則謂少壯同體。百齡一質。徒知年往。不覺形隨。(人雖同體一質。而有老少之不同。形容似有遷變。其實朱顏自隨住在昔少時而不來。老耄自住在今而不去。此不遷意也)是以梵志出家。白首而歸。隣人見之曰。昔人尚存乎。梵志曰。吾猶昔人。非昔人也。鄰人皆愕然。非其言也。所謂有力者負之而趨。昧者不覺。其斯之謂歟。",
          "此引梵志之事。以釋雖遷而不遷。以明昧者不覺之義也。且梵志自少出家。白首而歸。隣人見之。謂昔人猶在。是以昔之朱顏為今之老耄。梵志答曰。吾似昔人。非昔人也。意為少壯自住在昔而不來。豈可以今之老耄排去而至昔耶。此不遷之義明甚。但隣人不知。故愕然非其言。是昧者不覺之意也。予少讀此論。竊以前四不遷義。懷疑有年。因同妙師結冬蒲阪。重刻此論。校讀至此。恍然有悟。欣躍無極。因起坐禮佛。則身無起倒。揭簾出視。忽風吹庭樹。落葉飛空。則見葉葉不動。信乎旋嵐偃嶽而常靜也。及登廁去溺。則不見流相。歎曰。誠哉。江河競注而不流也。於是回觀昔日法華世間相常住之疑。泮然冰釋矣。是知論旨幽微。非真參實見。而欲以知見擬之。皆不免懷疑漠漠。吾友嘗有駁之者。意當必有自信之日也。0335a22"
        ],
        [
          614,
          "是以如來因群情之所滯。則方言以辯惑。乘莫二之真心。吐不一之殊教。乖而不可異者。其唯聖言乎。",
          "此總結聖人言異而心不異也。諸佛出世。本來無法可說。但因群生所執之情。故隨類設言以辯惑。破其執耳。所乘乃不二之真心。其言乃不一之殊教。其說雖乖。而心實不可異者。其唯聖言乎。隱微難測。正在於此。0335b15"
        ],
        [
          615,
          "故談真有不遷之稱。導俗有流動之說。雖復千途異唱。會歸同致矣。",
          "此釋乖而不異之義也。謂談真有不遷之稱。而意在攝俗。導俗有流動之說。而意在返真。是以千途異唱。會歸同致。此所以乖而不可異也。0335b22"
        ],
        [
          616,
          "而徵文者聞不遷。則謂昔物不至今。聆流動者。而謂今物可至昔。既曰古今。而欲遷之者。何也。",
          "此出迷者執言失旨也。徵文。謂但取信於文言者。隨語生解。聞不遷。則謂昔物不至今。似為得旨。及聆流動。又謂今物可至昔。既曰古今。則古自住古。今自住今。而欲遷今至古者何耶。此責執言之失也。以古不來則易見。言今不至昔最難明。論主直以現今當下不遷至昔。立定主意。要人目前頓見不遷之實。了悟諸法實相。為論之宗極。0335c03"
        ],
        [
          617,
          "是以言往不必往。古今常存。以其不動。稱去不必去。謂不從今至古。以其不來。",
          "此下正破迷執也。上論物不遷。此論時不遷。凡言往不必作往解。古今常存者。以其不動也。凡稱去不必作去解。謂不從今至古者。以古不來今也。0335c12"
        ],
        [
          618,
          "不來。故不馳騁於古今。不動。故各性住於一世。",
          "此結歸宗體也。以其不來不去。了無三際之相。故不馳騁於古今。不動不靜。平等一如。故各性住於一世。0335c16"
        ],
        [
          619,
          "然則群籍殊文。百家異說。苟得其會。豈殊文之能惑哉。",
          "此顯忘言會旨也。雖則千經萬論。殊文異說。苟得法界宗通。則會歸一真之境。豈被文言之所惑哉。0335c21"
        ],
        [
          620,
          "是以人之所謂住。我則言其去。人之所謂去。我則言其住。然則去住雖殊。其致一也。故經云。正言似反。誰當信者。斯言有由矣。",
          "此顯迷語一源也。人之所謂住者。乃妄執為常。且執常。則墮無常矣。故我言去以破其執者。意在無住。非謂往也。今之所謂去者。乃執生死無常也。我則言其住以破其執。意在本無生死。非謂住而可留也。是則去住二言。無非破執之談。以顯一真常住。故言殊而致一。正若老氏所云正言似反。誰當信者。斯言有由矣。此言迷悟不出一真。是非本無二致。正是現前。則不隨言取義也。0336a02"
        ],
        [
          621,
          "何者。(此徵顯古今不遷。要即迷返悟也)人則求古於今。謂其不住。(人於今中求古而不可得。則計以為遷。此迷也)吾則求今於古。知其不去。(我求今於古中而不可得。則知今不去。此悟也)今若至古。古應有今。古若至今。今應有古。(若今古果有往來。則當互有其跡)今而無古。以知不來。古而無今。以知不去。(此正示不遷義也。以今中無古。則知古不來。古中無今。則知今不去。既無來去。則前後際斷。又何遷之有)若古不至今。今亦不至古。(古今不相到)事各性住於一世。有何物而可去來。(若悟古今一際。則了法法真常。經云。是法住法位。世間相常住。此則事各性佳於一世。有何物而可去來哉)然則四象風馳。璇璣電捲。得意毫微。雖速而不轉。",
          "此結歸妙悟也。四象乃日月星辰。新疏指四時。璇璣舊為北斗二星名。今意為斗樞。皆旋轉不停。如電捲無速也。苟悟不遷之理於毫微。則雖速而不轉。若法界圓明。則十方湛然寂滅矣。前一往皆論迷見遷流故。故為凡。此下論悟則不遷。是為聖。0336a19"
        ],
        [
          622,
          "是以如來。功流萬世而常存。道通百劫而彌固。",
          "此下言悟之為聖。故常住不朽。以明因果不遷也。功流萬世。則利他之行常存。道通百劫。自利之行益固。雖萬世百劫。時似有遷。而二行不朽。不遷之實也。0336b01"
        ],
        [
          623,
          "成山假就於始簣。修途託至於初步。果以功業不可朽故也。",
          "此引二氏之言。以證因果不遷之義也。論語云。譬如為山。雖覆一簣。進吾進也。老子云。千里之行。始於足下。二語皆譬資始成終之意。為山萬仞。假一簣以成功。山成而初簣不廢。如行千里。始於發足一步。行至而初步不移。故功成至聖。行滿不異於初心。所謂發心畢竟二無別。從因至果。而行行不遷。淨名云。所作之業亦不忘。不忘則不朽。善惡皆然。此論聖功也。0336b07"
        ],
        [
          624,
          "功業不可朽。故雖在昔而不化。不化故不遷。不遷故則湛然明矣。故經云。三災彌綸而行業湛然。信其言也。",
          "此以不朽釋不遷意。所言功業不朽者。以昔因不化。由不化。故不遷。不遷。故知因果湛然。平等一際明矣。引經證成。彌綸。充滿之義。言三災壞劫。乃遷之極也。而行業湛然。不動不壞。所謂大火所燒時。我此土安隱。則極遷極不遷。言可徵矣。0336b18"
        ],
        [
          625,
          "何者。果不俱因。因因而果。因因而果。因不昔滅。果不俱因。因不來今。不滅不來。則不遷之致明矣。復何惑於去留。踟躕於動靜之間哉。",
          "此總結歸因果不遷。以終一論之義也。何者。徵明因果不遷之意。果不俱因。言因果終始不同遷也。因因而果。果成而因不滅。不遷也。果不俱因。而昔因不來。不來。則昔自住昔。雖遷而不遷也。以不滅不來。則不遷之理明矣。又何惑於去留之相。踟蹰於動靜之間哉。踟蹰。乃卻顧不進之意。猶豫不決之謂也。既明不遷之理。又何惑於去來之時。懷疑於動靜之境哉。一論大義。結歸於此。0336c02"
        ],
        [
          626,
          "然則乾坤倒覆。無謂不靜。洪流滔天。無謂其動。苟能契神於即物。斯不遠而可知矣。",
          "此結責勸修也。謂既明不遷之理。則旋乾倒嶽。勿謂不靜。洪流滔天。勿謂其動。此責也。下勸修。若能契悟於即物。見真之境。則觸目無非實相常住。一切萬法無有一毫可動轉者。斯則不必遠求而當下可知矣。0336c12"
        ],
        [
          627,
          "物不遷論(終)。",
          "予少讀肇論。於不遷之旨茫無歸宿。每以旋嵐等四句致疑。及後有省處。則信知肇公深悟實相者。及閱華嚴大疏。至問明品。譬如河中水。湍流競奔逝。清凉大師引肇公不遷偈證之。蓋推其所見妙契佛義也。予嘗與友人言之。其友殊不許可。反以肇公為一見外道。廣引教義以駁之。即法門老宿。如雲棲紫柏諸大老。皆力爭之。竟未迴其說。予閱正法眼藏。佛鑑和尚示眾。舉僧問趙州。如何是不遷義。州以兩手作流水勢。其僧有省。又僧問法眼。不取於相。如如不動。如何不取於相。見於不動去。法眼云。日出東方夜落西。其僧亦有省。若也於此見得。方知道旋嵐偃嶽。本來常靜。江河競注。元自不流。其或未然。不免更為饒舌。天左旋。地右轉。古往今來經幾徧。金烏飛。玉兔走。纔方出海門。又落青山後。江河波渺渺。淮濟浪悠悠。直入滄溟晝夜流。遂高聲云。諸禪德。還見如如不動麼。然趙州法眼。皆禪門老宿將。傳佛心印之大老。佛鑑推之示眾。發揚不遷之旨。如白日麗天。殊非守教義文字之師可望崖者。是可以肇公為外道見乎。書此以示學者。則於物不遷義。當自信於言外矣。0336c18"
        ]
      ],
      "tag": "憨"
    },
    "文": {
      "col": 0,
      "desc": "T1860 肇論新疏，元·文才",
      "name": "T1860_001",
      "notes": [
        [
          1182,
          "物不遷論第一",
          "物即緣會諸法。謂染淨依正古今寒暑等。不遷即性空實相等。以緣生之物本性即空。空即實相故。物物皆不遷也。今約終頓二教之義。略示玄妙。\n初終教者。謂隨緣之理起成諸事。即事同真故遷即不遷。此中曲有三門。\n一以理從事理亦隨遷。況事法邪。楞伽經略云。如來藏與因俱有生滅。又不增減經云。法身流轉五道云云。皆此義也。\n二以事從理事且不遷。況真理邪。仁王經云。煩惱菩提於第一義而無二故。諸佛如來與一切法悉皆如故。楞伽又云。五識身非流轉。\n三此二無礙同時鎔融。非一非異。遷與不遷亦非前後。即涅槃娑羅娑鳥。淨名法無去來常不住故是也。清涼云。因乖常理遂成三界無常。苟悟無常之實。即無常常矣。下論大義皆是此理。\n後頓教者。謂法法本真妄見流動。若一念不生前後際斷。法非生滅非遷非不遷。仍名不遷也。華嚴云。一切法無生云云。若依歸峯略鈔解。緣生之法相同遍計似生似滅。性同圓成不生不滅。亦終教意也。\n今此論中雙含二教。如下云。不釋動以求靜云云。又云。目對真而莫覺。0203b26"
        ],
        [
          1183,
          "夫生死(滅也)交謝寒暑迭(互也)遷。有物流動人之常情",
          "將明遷即不遷之理。先陳迷倒不遷見遷之情。令忘情悟實也。初句舉所遷之法。通一切法生來死謝。死至生亡生滅相待。故云交也。次句舉能遷之時。通一切時迭遷可知。有謂緣有流動遷也。後句中義兼凡外。亦正為權小以一形三。唯見無常不見即常者。皆常情淺見也。0203c19"
        ],
        [
          1184,
          "予(我也)則謂之不然",
          "論主宗悟一乘善入實相。欲導常情故總斥之。0203c27"
        ],
        [
          1185,
          "何者",
          "不許見遷必有教理。故總徵之。0203c29"
        ],
        [
          1186,
          "放光云。法無去來無動轉者",
          "即彼經第七卷中云。諸法不動搖故諸法亦不去亦不來等。法即緣集之物。以任持自體軌生人解。故去來動轉遷也。既云皆無不遷也。然實教了義多有此說法華云。世間相常住。0204a01"
        ],
        [
          1187,
          "尋夫不動之作豈釋(捨也)動以求靜。必求靜於諸動。必求靜於諸動故。雖動而常靜。不釋動以求靜故。雖靜而不離動",
          "初句舉經。但解動靜以例去來。動即遷也。靜即不遷。豈釋下會釋。次二句明不捨事動而求靜理。然動靜多體。且約心境略示。境者真諦理性故靜。俗諦事法故動。二諦相即故云不捨。意云。要證真諦之靜不離俗動。心者實智向真故靜。權智應俗故動。二智無礙故亦不捨權動也。後四句躡前以明即靜而動。亦通心境。以不捨事動而入靜。故正靜時正動。論中正唯理事。既云求靜不捨等。故兼二智。0204a06"
        ],
        [
          1188,
          "然則動靜未始異。而惑者不同",
          "動靜本一迷夫見異。世間與出世殊科。依計與圓成分處。0204a18"
        ],
        [
          1189,
          "緣(因也)使真言滯於競(諍也)辯。宗(理也)途屈於好異",
          "真言謂了義言詮真實之教。宗途謂一乘宗途不遷之理。意云。動靜無二了義所詮。三乘之人於無二法中而見兩異。保執權淺不信無二之道。好異之心發言諍辨。因此使令了義滯而不行。宗途屈而不伸。正同圭峯大師云了義匿於龍藏。敘此為起論之由也。然四論之作皆由排異。何者。不真空明斥三家。般若論云。然異端之論紛然久矣。涅槃論云。今演論之作。寂彼廓然排方外之談。故知皆緣異見而作。0204a21"
        ],
        [
          1190,
          "所以靜躁(動也)之極未易言也",
          "競辨者眾好異者多。故言之難。0204b03"
        ],
        [
          1191,
          "何者(微也)夫談真則逆俗。順俗則違真。違真故迷性而莫返(歸也)逆俗故言淡而無味",
          "初二句明逆順兩違。體乎不二名真。執乎兩異名俗若順法談一。則逆乎常情好異之徒。此則法不應根也。若順俗談異。則又違真一之法此則根不達法也。後四句逆順皆失。謂莫二之真即性也。今既順俗談異常情。迷此真性不能歸於寶所。若談真則俗情不入。反謂言淡無味。老氏云。道之出口淡乎其無味。0204b05"
        ],
        [
          1192,
          "緣使中人未分於存亡。下士撫(擊也)掌而弗(不也)顧",
          "承前談真而來。意云。雖逆俗招無味之謗。只可談真使人返悟。不可順俗而令不入。上士聞真勤而行之。中士聞真若存若亡。疑信相半。下士聞真則拍手大笑。反為淡泊不復顧慕。文出老書。故順而釋之。0204b14"
        ],
        [
          1193,
          "近而不可知者。其唯物性乎",
          "初句事俗流動名近。即真不遷難知。後句屬體。0204b20"
        ],
        [
          1194,
          "然不能自已(止也)聊復寄真心於動靜之際。豈曰必然。試論之曰",
          "然者。猶云雖然。中下疑笑。要使真言不滯。宗途大明常情悟入。欲罷不能。略復依言寄真一之心於動靜之際。未敢必是。但試為論之謙也。0204b22"
        ],
        [
          1195,
          "道行云。諸法本無所從來。去亦無所至。中觀論云。觀方知彼去。去者不至方",
          "雙引經論立不遷之宗也。道行引其正文。卷當第十。諸法即物也。本謂根本亦元也。緣集而來來何所從。緣離而去去何所至。如善財問慈氏云。此樓閣何處去耶。答曰。來處去也。解云。欲明其去先知其來。來不見源去亦何所。譬如寒暑相代。寒自何來暑於何去。是謂諸法如幻如化。當處出生隨處滅盡。中觀下但義引彼破去來品。卷當第二。然論極深細。今略示之。方謂去處彼即去者。論長行云。去法去者去處。是法皆相因待不得言定有定無。是故決定知三法虛妄空無所有。但有假名如幻如化。此論之意隨俗故知彼去。順真故不至方。0204b27"
        ],
        [
          1196,
          "斯皆即動而求靜。以知物不遷明矣",
          "經論皆爾。於理何惑。釋動求靜三乘之見也。0204c12"
        ],
        [
          1197,
          "夫人之所謂動者。以昔物不至今。故曰動而非靜。我之所謂靜者。亦以昔物不至今。故曰靜而非動。動而非靜以其不來。靜而非動以其不去",
          "初三句常情倒見。後動而下二句出意。初句牒執。以昔物下出所以。以見物遷至昔唯去不來。故云遷也。次三句舉悟。後靜而下二句出意。初句舉悟。亦以下出所以。昔物不至今今物不去昔。有何動耶。今昔相待其相本空。物在其中無去無來。0204c14"
        ],
        [
          1198,
          "然則所造(詣也)未嘗異。所見未嘗(曾也)同。逆之所謂塞順之所謂通",
          "同見昔物不至今。而有遷不遷之異。後二句中吳淨源法師云。惑者任情逆性而塞。悟者任智順物而通。0204c23"
        ],
        [
          1199,
          "苟得其道復何滯哉",
          "淨源法師云。若悟不遷之道。塞自去矣已上略明大旨已顯。下又廣辨。0204c27"
        ],
        [
          1200,
          "傷夫人情之惑也久矣",
          "無始無明有來至今。論主悲傷迷而弗悟。0205a01"
        ],
        [
          1201,
          "目對真而莫覺。既知往物而不來。而謂今物而可往。往物既不來。今物何所往",
          "初句汎責真謂不遷也。賢首大師云。實際居於目前翻成名相之境。次二句正責不覺之相。知其昔不來。却計今可往。迷也。後二句就示不遷。既知昔物不來。便可悟其今物不往。0205a03"
        ],
        [
          1202,
          "何則",
          "徵也。0205a09"
        ],
        [
          1203,
          "求(索也)向(昔也)物於向。於向未嘗無責(求也)向物於今。於今未嘗有。於今未嘗有。以明物不來。於向未嘗無。故知物不去",
          "以古望今也。初四句中意云。就昔以求昔日之物。昔日元有此物。如昔有堯舜今則無之。後四句躡前成立不遷。此中今古通目三世能遷之時。物者。所遷之物。雖舉能遷。意在所遷故云物不來等。0205a10"
        ],
        [
          1204,
          "復(反也)而求今今亦不往",
          "以今望古不遷亦然。但互改向今及來字可。故論但云今亦不往。0205a18"
        ],
        [
          1205,
          "是謂昔物自在。昔不從今以至昔。今物自在今不從昔以至今",
          "釋成不遷也。論旨以今昔相待來去相形。緣體非真諸相何立。常情為相所轉。見有遷流。悟士了虛當相寂滅。何有今昔之動來去之遷。據此雖念念謝滅。亦念念不遷也。故大論第五云。菩薩知諸法不生不滅其性皆空。予昔讀此反復不入。及讀永明大師宗鏡錄至釋此論疑滯頓消。故知論旨深隱。不可隨文作解。0205a21"
        ],
        [
          1206,
          "如此則物不相往來明矣。既無往反之微眹。有何物而可動乎",
          "通結上文。初一句斷定不遷。後二句結成本義。尚無微眹之動。況有大者。0205b09"
        ],
        [
          1207,
          "然則旋嵐偃(仆也)岳而常靜。江河競注而不流。野馬瓢鼓(動也)而不動。日月歷(經也)天而不周",
          "連引四事。前三所遷之物。後一能遷之時。亦通於物。皆流動中至大者至速者。而云常靜等皆不遷爾。旋嵐大風之名。此風起時偃妙高猶如腐草江河易見。野馬者。南華云。野馬塵埃也。或云。白駒游氣。亦運動中駛埃者。日月於晝夜中周四天下。此皆常靜不流不動。以妄見非真緣生相假。苟達兩虛萬物頓寂也。0205b13"
        ],
        [
          1208,
          "復何怪哉",
          "情計之流執妄為實。聞四不遷良可怪誕。達觀體物至動不動亦常理也。將何怪異。上明不遷文旨已備。此下約教會違。會有內外。如文。0205b23"
        ],
        [
          1209,
          "噫聖人有言曰。人命逝(往也)速速於川流",
          "潛妨也。噫心不平而恨聲也。梵網云。人命無常過於山水。諸經多有。意云。若物不遷豈非違此說耶。0205b27"
        ],
        [
          1210,
          "是以聲聞悟非(無也)常以成道。緣覺覺緣離以即真。苟萬動而非化(遷也)豈尋化以階(進也)道",
          "初二句舉行人。聲謂聲教聞教悟理。修無常等行證成四果。緣謂緣起。觀緣而覺。離緣起之有為。進五果之妙道。後二句辯違。若云不遷。豈彼二人稟無常之教。修無常之行而得道果耶。0205c02"
        ],
        [
          1211,
          "復尋聖言微隱難測。若動而靜似去而留",
          "通前違妨也。復謂研復。聖言即前無常教也。微隱難測者。以言權旨實故。涅槃名為密語。大乘智臣善識密意。意謂雖談無常亦密顯真常。不可守言一向作無常解也。以二法相待有此。定有彼故。若動下出難測所以。若說即無常之動是真常之靜。似說一人即去而元不去也。難測在此。0205c09"
        ],
        [
          1212,
          "可以神會難以事求",
          "此理幽微。只可神而明之妙識佛意。不必隨識依言定旨。事謂情識及言教也。楞伽經中大慧示疑。佛亦會釋。故法四依中。但令依義不依文依智不依識也。生公反教而談理千古希聲。肇公賤事而貴神百世準式。然唯上智中下不可。0205c17"
        ],
        [
          1213,
          "是以言去不必去。閑(防也)人之常想。稱住不必住。釋(解也)人之所謂(執也)往耳。豈曰去而可遣(遷也)住而可留耶",
          "既貴神賤事。只可捨文會旨。經說無常。不必說物遷去。但是防凡夫之人著常之想。經說常住。未必說物不遷。但解二乘計無常爾。此之二說本皆破倒。倒情既遣萬物非遷。非不遷也。涅槃初分大有此說。善哉論主。實曰智臣矣後二句正明捨文。豈可聞說無常。便謂萬物遷去。聞說常住便計萬化常留。0205c23"
        ],
        [
          1214,
          "故成具云。菩薩處計常之中而演非常之教。故摩訶衍論云。諸法不動無去來處",
          "雙引經論各證一事。引成具經中既云。菩薩為破眾生常計而演無常之教。證前閑人之常想。智度論中諸法不動。以證釋人之所謂往。皆對治悉檀非第一義。0206a04"
        ],
        [
          1215,
          "斯皆導達(悟也)群方(類也)兩言一會。豈曰文殊而乖其致(旨也)哉",
          "若經若論。皆是引悟眾生之典。而經說去論言住。兩言在文實異。然經本破常物不必去。論本顯真物不必留。所以云一會。在旨不乖。0206a10"
        ],
        [
          1216,
          "是以言常而不住稱去而不遷。不遷故雖往而常靜。不住故雖靜而常往。雖靜而常往故往而弗遷。雖往而常靜故靜而弗留矣",
          "初二句中經論隨計破著。說遷不遷物不必然也。次四句躡前。已明遷而不遷不遷而遷。後四句復躡前。已明遷即不遷不遷即遷。故非重也。所以不會二乘者。以二乘但稟無常之教而修。故唯會教人可悟也。0206a15"
        ],
        [
          1217,
          "然則莊生之所以藏山。仲尼之所以臨川",
          "此會外典之違也。太宗師略云。夫藏舟於壑藏山於澤。謂之固矣。然而夜半有力者負之而走。昧者不知。若直解者。如人藏山於深澤以謂牢固。力大者得之於夜半中背負而趁。彼藏山者不覺不知。此寓言也。以譬造化之力遷負周密。雖天地之大萬物之廣。未嘗不負之而走也。夜半以喻冥理也。古人云。變化之道挾日月而行。負天地而走。此亦正同四梵志藏身山海時至皆化。仲尼下論語文。孔子臨於川上歎曰。逝者如斯夫。不舍晝夜。意云。新新之化往者過而來者續。無一息之停。如斯。指水也。二典皆言物遷。如何會通。0206a23"
        ],
        [
          1218,
          "斯皆感往者之難留。豈曰排(遣也)今而可往",
          "二典皆感往物難留至今。非說今物排去。以明即遷而不遷爾。巧攝儒道。故類會之。0206b07"
        ],
        [
          1219,
          "是以觀聖人心者。不同人之所見得也",
          "孔子域中之聖。莊周達觀之賢。賢聖之人所見所得人難盡之。不可隨文只作無常之解。0206b10"
        ],
        [
          1220,
          "何者",
          "徵也。0206b13"
        ],
        [
          1221,
          "人則謂少壯同體百齡(年也)一質(體也)徒(虛也)知年往不覺形隨",
          "此出凡情見淺也。但見年去。不知形亦隨變。少壯既殊百年形異。執乎一體誠為倍迷。若知少壯不互有。年年不相到隨遇隨空。何有遷耶。0206b14"
        ],
        [
          1222,
          "是以梵志出家白首而歸。隣人見之曰。昔人尚存乎。梵志曰。吾猶昔人非昔人也。隣人皆愕然非其言也",
          "此以外事故類證爾。梵志解遷中不遷如孔莊。隣人非之如凡淺。西域淨行梵志十五遊學。三十歸娶。五十入山。今言出家謂入山也。白髮復歸。隣人以常情問之云。昔人尚在耶。見今問昔亦已誤矣。故梵志答之但似昔人。豈今之新吾是昔之故吾哉。隣人不達隨變之理執。今白首是昔朱顏。0206b19"
        ],
        [
          1223,
          "所謂有力者負之而趁。昧者不覺。其斯之謂歟",
          "源云。負之而趁猶老少形變。昧者不覺猶人愕然。0206b29"
        ],
        [
          1224,
          "是以如來因群情之所滯。則(準也)方(正也)言以辨惑。乘(憑也)莫二之真心。吐不一之殊教。乖而不可異者其唯聖言乎。故談真有不遷之稱。導俗有流動之說。雖復千途異唱。而會歸同致矣",
          "初至聖言乎等者。通辨諸教文異旨同。故談下結成一致。眾生流滯於生死。根行樂欲種種差殊。故如來觀機演教。依準正理之言以解凡惑。依一真法界流十二分教。若小若大或權或實。八萬度門恒沙佛法故不一也。梵網云。世界無量教門亦爾。雖乃差殊其旨無異。原佛本意亦唯一事。故不可文殊令旨亦差。0206c03"
        ],
        [
          1225,
          "而徵(索也)文者。聞不遷則謂昔物不至今。聆(听也)流動者。而謂今物可至昔",
          "隨聲取義之士。滯於一偏不達圓音。故再舉今昔以示之。令不泥教。0206c15"
        ],
        [
          1226,
          "既曰古今。而欲遷之者何也",
          "古今不可互指。不遷已明。能分古今之異。却欲遷之何故。0206c19"
        ],
        [
          1227,
          "是以言往不必往。古今常存以其不動。稱去不必去。謂不從今至古。以其不來。不來故不馳騁於古今。不動故。性各住於一世",
          "初有六句。不壞古今之相。非去非來以明不遷。然三三兩分。皆初句標。次句釋。後句出不遷所以。以古不來今知今不去古也。不來下四句結成。古今之相隨性而各住自位。皆不遷也。馳騁趁走貌。0206c22"
        ],
        [
          1228,
          "然則群籍殊文百家異說。苟得其會豈殊文之能惑哉",
          "初二句舉教異。群籍目聖教。百家屬師宗。後二句明文異旨同。然上所會。且約動靜常無常等會釋。以此例諸法法皆然。是故經中或說苦等四妄。彰權隱實。或說常等四真。彰實隱權。如是會通異門一道。且藥分千品愈病無殊。教海萬方悟心何異。苟封文迷旨字字瘡疣。得意忘言物物合道。自此以下唯就於時以明不遷。意謂能遷古今三世之時。尚且不遷。況所遷之物而有遷耶。0207a01"
        ],
        [
          1229,
          "是以人之所謂住。我則言其去。人之所謂去。我則言其住。然則去住雖殊。其致一也",
          "謂凡情偏解知住迷去知去迷住。圓見之人一法雙了。特由迷悟雲泥故。去住相反。0207a11"
        ],
        [
          1230,
          "故經云。正言似反誰當信者。斯言有由矣",
          "言似相反旨意常順。如前住云。0207a15"
        ],
        [
          1231,
          "何者",
          "徵也。0207a17"
        ],
        [
          1232,
          "人則求古於今。謂其不住。吾則求今於古。知其不去",
          "執遷之者求古於今。見今無古故云遷也。悟者求今於古見古無今。故今不去也。0207a18"
        ],
        [
          1233,
          "今若至古古應有今。古若至今今應有古",
          "文通二對。皆上句舉執。下句出違。若古今互遷亦應互有。然執者但執今去古。不執古來今。今亦云者但例說爾。0207a22"
        ],
        [
          1234,
          "今而無古以知不來。古而無今以知不去。若古不至今今亦不至古。事(物也)各性住於一世。有何物而可去來",
          "初四句承前互無。知不來去。若古下復躡不來不去。以成不遷。0207a26"
        ],
        [
          1235,
          "然則四象風馳璿璣電卷。得意毫微雖速而不轉",
          "四象即四時。奔馳之疾如風也。璿璣即北斗二星之名。今通因北斗。以繞辰而轉晝夜周天速如電卷。舉此四時晝夜該攝一切。乃遷運中最速疾者。毫微謂毫毛微細也。源云苟得不遷之意在於毫微。雖四象等亦不轉移也。源師之意如能悟毫微不遷之意。雖至遷亦不遷也。此解最正。如遠公云。一毫涉動境成此頹山勢。迷既一毫而成大。悟亦毫微而見理。此中且舉悟涯初涉尚見不遷。況大達耶。0207b01"
        ],
        [
          1236,
          "是以如來功流萬世而常存。道通百劫而彌固(堅也)",
          "初句利他之因。積劫化生故云萬世。次句自利之行三祇修煉。故云百劫。常存彌固。二行皆不遷也。歷萬世之久常存。通百劫之長益固。問經說過去已滅。何故二行堅存耶答。0207b12"
        ],
        [
          1237,
          "成山假就於始簣。修途託至於初步",
          "此中二喻喻因不化。初句論語云。譬如為山。雖覆一簣進(云云)。簣土籠也。意以山喻果。假就者。假初一簣而山成就。始簣喻初因也。積土成山山成而初功益著。運行招果。果圓而先因尤存。後句老氏云。千里之行始於足下。託至者。仗初步而得至於千里。亦以千里喻果初步喻因也。由初至千千里至而初步不化。由行證果。果道圓而初因恒明。二喻事異義同。通喻二行。但舉初者以例中間。大疏說因果無碍云。如來毛孔現往昔因事。圓覺淨業章云。覩見調御歷恒沙劫勤苦境界(云云)。前問約泯相顯性故云已滅。論約即事同真門。故云不化。各據一理也。0207b18"
        ],
        [
          1238,
          "果以功業不可朽故也。雖在昔而不化。不化故不遷。不遷故則湛然明矣",
          "真流之行行行契真。果位反觀愈見不朽。若住相之行力盡而墜矣。湛謂凝湛不動之貌。餘可知。0207c03"
        ],
        [
          1239,
          "故經云。三災彌淪而行業湛然。信其言也",
          "三災者。火水風也。三災雖酷。安能焦爛於虛空。劫海縱遙。何以遷淪於實行。彌淪者。清涼云。周遍包羅之義。謂三災雖壞一切。不能壞於因行。亦以契真故也。0207c07"
        ],
        [
          1240,
          "何者。果不俱(兼也)因因(由也)因而果。因因而果因不昔滅。果不俱因因不來今。不滅不來則不遷之致明矣",
          "初句中果極至得因在應得。二位相遠故不俱也。次句果由因得故。次二句躡示不去。次二句躡示不來。後二句釋成不遷。雖舉果顯因亦即合於性空故不遷也。問前通會諸法。因亦在其中矣。何故別舉其因再明之耶。答深有所以。恐進行之人謂所修隨化勞而無功。故舉如來果身由昔因感。果在因存豈唐捐乎。如童子熟書。非不由生而至於熟。書熱之時前功尤顯。隨相之行熏引尚爾況無相之行乎。所以不辨果不遷者。因且不遷。況夫果道。是故佛果有為無為非一非異。吾今此身即是常身。0207c12"
        ],
        [
          1241,
          "復何惑於去留。踟蹰於動靜之間者哉",
          "惑不達也。踟蹰將進將退之貌。疑也。如上教理成立不遷極明。更何惑於即事之中道耶。0207c26"
        ],
        [
          1242,
          "然則乾坤倒覆無謂不靜。洪流滔天無謂其動",
          "無謂。戒止之辭。倒覆崩墜也。天地雖大。亦緣集之法容可傾覆。以性空故亦即清寧。千門異說不出宗意。0207c29"
        ],
        [
          1243,
          "苟能契神於即物。斯不遠而可知矣",
          "苟能以神妙心智。即於緣生遷化物中。而了不遷之理。物既在近理亦非遠。反顯捨物求之去理轉遠清涼云。至趣非遠。心行得之則甚深。下論云。觸事而真等。0208a04"
        ]
      ],
      "tag": "文"
    },
    "界": {
      "col": 0,
      "desc": "X0880 物不遷論辯解，明·真界",
      "name": "X0880",
      "notes": [
        [
          531,
          "夫生死交謝。寒暑迭遷。有物流動，人之常情。",
          "此述常人所迷。為不遷一論之發起也。蓋常人謂生死去來交相遷謝。寒暑去來迭互變遷。然不知諸法本來常自寂滅。本無身心生死。亦無寒暑去來。是以妄見物遷而不知物不遷也。所言物不遷者。事像可觀稱之為物。物體寂滅故號不遷。不遷故則物物當處而自寂。為物故與四象更互而為依。然物性無差。悟即真理。真本不變。物自湛然。常情所封。於不動中妄以為動。所謂雲駛月運舟行岸移。故宗鏡云。若了真心不動則萬法不遷。若見萬法遷謝皆是妄心。以一切境界唯心妄動。若離心識則尚無一法常住。豈況有萬法遷移。故下廣引經論之言以對破也。0927a10"
        ],
        [
          532,
          "余則謂之不然。何者。放光云。法無去來。無動轉者。",
          "此反上以明不遷也。夫諸法之體。離去來相。無動轉相。何者。謂一切諸法緣會而來。來無所從。緣離而去。去無所至。是則即去來而無去來。即動轉而無動轉。故放光云。法無去來。無動轉也。雖然。而常人不達緣生無性無有去來。則妄見諸法去來。故於身見生死交謝。於世見寒暑迭遷。論主愍之。遂本法無去來無有動轉立論。以破常人有物流動之見也。0927a23"
        ],
        [
          533,
          "尋夫不動之作。豈釋動以求靜。必求靜於諸動。必求靜於諸動。故雖動而常靜。不釋動以求靜。故雖靜而不離動。",
          "此原般若立言之意以為作論之本也。蓋不動之作。既非釋動求靜。而必求靜於動。則動靜不異。故於下文說遷即不遷。以明遷不異不遷。說不遷即遷。以明不遷不異於遷也。0927b10"
        ],
        [
          534,
          "然則動靜未始異。而惑者不同。緣使真言滯於競辯。宗途屈於好異。所以靜躁之極未易言也。",
          "呈上以明立言之難也。然動靜不異。則遷與不遷不相異也。以不異故遷而不遷。不可謂之遷。不遷而遷。亦不可謂之不遷矣。而惑者不同。則遷與不遷不相同也。以不同故。執遷者則謂之遷。執不遷者又謂之不遷。致使離言之真滯於競辯。不異之宗屈於好異。所以動靜不異未易言也。0927b16"
        ],
        [
          535,
          "何者。夫談真則逆俗。順俗則違真。違真故迷性而莫返。逆俗故言淡而無味。緣使中人未分於存亡。下士撫掌而弗顧。近而不可知者。其唯物性乎。然不能自已。聊復寄心於動靜之際。豈曰必然。",
          "徵釋難言所以，即結舉難知之性以起說也。何靜躁之極未易言耶。談真下釋也。謂談不遷則逆於遷，順於遷則違不遷。違不遷，迷性莫返。逆於遷，言淡無味。故使中人聞之如存若亡，下士聞之撫掌弗顧。今欲談不遷不逆於遷，說遷不違不遷，而使中下聞之各得信解者，誠不易言，故靜躁之極未易言也。是以下，常人謂昔物不至今，而論主亦謂昔物不至今。雖談說不遷不離其遷，故不逆於遷。以不逆遷而言不遷故，則意深而有味。故能使中下聞之而各得信解也。又下云人命逝速速於川流，蓋對計常者以無動無滅而言遷。言雖似遷而遷即不遷，故不違不遷。以不違不遷而言遷故，則迷性而可返。\n故二乘之人聞而悟解，以成道即真也。然則不異之極，非惟言之不易。抑亦知之甚難，故云近而不可知者其唯物性乎。然雖難言難知而不能自已，故聊復寄心於動靜之際，以明遷與不遷。豈曰必然，蓋以說遷乃即不遷以明遷，豈必於遷；說不遷乃即遷以明不遷，豈必不遷。故云聊寄動靜豈曰必然也。0927c02"
        ],
        [
          536,
          "試論之曰。道行云。諸法本無所從來。去亦無所至。中觀云。觀方知彼去。去者不至方。斯皆即動而求靜。以知物不遷明矣。",
          "此引經論之言以明不遷也。蓋一切諸法來有所從。去有所至。可謂之遷。以來無所從。去無所至。法不相至。故不遷也。言觀方知彼去者。如人從東至西。以方而觀如似有去。故云觀方知彼去。去不至方者。謂去無所去也。故論偈云。已去無有去。未去亦無去。離已去未去。去時亦無去。鈔云。如人初在東方卓立不動。即名未去。未去故。未去不得名為去。以去法未萌故。若動一步離本立處。反望立處。則名已去。已去故。已去不得名為去。由去法已謝故。惑人便轉計云。動處則有去。此中有去時。非已去未去。是故去時去。龍樹便以相待破云。若有已去未去則有去時。若無已去未去則無去時。如因兩邊短有中間長。若無兩邊短。即無中間長。故偈云。離已去未去。去時亦無去。是則三時無去。以明去無所去。非以無去為無去。故云去者不至方也。斯皆下。會經論意。宗歸不遷。然此不遷之理隱奧難明。今復以事顯之。如人從一步而至三步。若第一步去第二步來。第二步去則第三步來。是則有去有來。即所謂動也。然凡有去來即屬緣生。既屬緣生即無自性。既無自性全體即空。若是則第一步去。去無所去。第二步來。來無所來。一步如是。步步皆然。由是而知諸法。即去來而無去來。即動轉而無動轉。故云即動而求靜以知物不遷。即遷而不遷。豈有物而可動哉。0927c24"
        ],
        [
          537,
          "夫人之所謂動者。以昔物不至今。故曰動而非靜。我之所謂靜者。亦以昔物不至今。故曰靜而非動。動而非靜。以其不來。靜而非動。以其不去。",
          "此即常人之遷以明不遷也。蓋常人謂昔物不至今。以見昔物遷去於昔。故不至於今。故曰動而非靜。此則不達緣生無性。則見物遷去。所以謂之動也。論主謂昔物不至今。以見昔物緣生無性。去即不去。故不至於今。故曰靜而非動。此則了達緣生無性。則去即不去。所以謂之靜也。動而非靜以其不來者。蓋以其昔物遷去於昔。故不來也。靜而非動以其不去者。蓋以其昔物去即不去。故不去也。然則昔物既從緣空故不去不來。有何物而可動哉。如是則遷流之見謝而諸法性空之理明矣。而或人由不達肇公所見緣生無性之理。又錯解靜而非動以其不去之文。遂謂肇公所言昔物不至今者。如前舟載魚。後舟載筍。前舟之魚自住前舟。不至後舟。故以昔物住昔不來而駁之。是乃或人之謬解耳。豈肇公之見也哉。又靜而非動以其不去者。蓋以其昔物緣離而去。去即不去。故云不去。非謂昔物住昔而不去也。而或人由錯解靜而不去之文。遂以昔物住昔不去而駁之。故知其文理俱不通矣。且或人本不達肇公所明物不遷理。又見清涼疏鈔謂肇公所言物不遷濫於小乘。遂即倚傍其言而抑之駁之。此又不通疏鈔之意也。蓋疏鈔謂肇公所言物不遷濫於小乘者。以小乘論云。有為之法若此處生即此處滅。無容從此轉至餘方。鈔釋曰。此生此滅不至餘方。同不遷義。而有法體是生是滅。故非大乘。大乘之法緣生無性。生即不生。滅即不滅。故遷即不遷則其理懸隔。然肇公論則含二意。顯文所明多同前義。蓋由肇公意以物各性住為不遷。則濫小乘無容從此轉至餘方故。然下論云。談真有不遷之稱。導俗有流動之說。此則以真諦為不遷。而不顯真諦之相。若但用於物各性住為真諦相。寧非性空無可遷也。已上皆疏鈔文。然疏鈔既云含有二意。則不獨小乘矣。又云。顯文所明多同前義者。蓋以物各性住。與小乘無容從此轉至餘方文義多同。理實懸隔也。又云。若但用於物各性住為真諦相。寧非性空無可遷者。蓋真諦則泯一切法也。既以物各性住為真諦相。豈非是以無物無住而為真諦不遷者哉。故永明亦謂。肇公所言性住。是以無性為性也。既以性空真諦為不遷。豈得濫同小乘生滅之理乎。縱清涼謂濫於小乘。不云同於凡夫。而或人既以昔物住昔不來而駁之。則抑同常見凡夫矣。若是則尚不能同於小乘。又豈能安住大乘而濫於小乘耶。是則非惟於疏鈔文義不通。亦乃與倚傍言意相悖。良可歎也。又或人亦由不達肇公所明緣生無性無有去來之靜。妄謂肇公以昔物住昔不去謂之靜者。蓋有物有住即有為。有為即生滅。安得謂之靜乎。斯亦或人之謬解耳。又豈肇公之見也哉。此正所謂於無過中求其有過。不特謗法亦且欺人。又謂非駁肇公。將以駁天下之所是。則又不特只欺肇公。又乃輕欺天下之人矣。竊思或人之所以招謗法欺人之罪者。非有他心。但以其不識文理而致然也。可不審哉。0928b03"
        ],
        [
          538,
          "然則所造未甞異。所見未甞同。逆之所謂塞。順之所謂通。苟得其道。復何滯哉。",
          "明上造雖同而見不同也。蓋昔物不至今。一耳。然其所見誠迷悟不同。故云所造未嘗異。所見未嘗同。以見物遷去則逆乎無生常。以是塞故云逆之所謂塞。見物不去則順乎無生真。以之通故云順之所謂通。苟悟物物緣生無性而無生。則不為去來動轉之所留滯矣。故云苟得其道復何滯哉。0929a09"
        ],
        [
          539,
          "傷夫人情之惑久矣。目對真而莫覺。既知往物而不來。而謂今物而可往。往物既不來。今物何所往。何則。求向物於向。於向未嘗無。責向物於今。於今未嘗有。於今未嘗有。以明物不來。於向未嘗無。故知物不去。覆而求今。今亦不往。",
          "歎常人所迷。委辯法無去來。以明物不遷也。目對真而莫覺者。謂萬法本如。不動不變。不離當處常自湛然。而常人日用不覺。所以聖人傷歎之也。既知下。牒上。以明今昔之物各不相到。謂既知往物而不來今。則今物又豈往於昔乎。往物下。牒定不相到義。何則下。徵辯物不相到立不遷義。以破有物流動之見。言求向物於向於向未嘗無者。謂向物緣生無性。去即不去。無即不無。故云於向未嘗無。非謂向物住向而不無也。又因常人見向物遷去執以為無。故此明去即不去。無即不無。是乃即常人之遷以明不遷也。責向物於今於今未嘗有者。謂向物既緣生無性則不至於今。故今不有向也。於今下。牒明向物不來。於向下。牒明向物不去。然則向物之所以不去者。蓋向物以緣離而去。去即不去。故云不去。非謂向物住向而不去也。而或人自不解說者之意。反以向有墮常今無墮斷而駁之。豈異跛驢不能疾步。而反責駿馬之奔逸者也。覆而求今今亦不往者。謂向物既從緣無性而不來。則今物亦從緣無性而不往。蓋今物不往。亦往即不往也。故華嚴云。譬如河中水。湍流競奔逝。各各不相知。諸法亦如是。斯乃即湍流奔逝不妨波波從緣無體而不相周到。故各不相知。如即今昔競往不妨物物緣生無性而不相往來。故各不相至。故華嚴云。諸法無體性。亦無有作用。是故彼一切。各各不相知也。然此既以物物從緣無性不相往來而明不遷。是乃即遷以明不遷矣。又安容以向有今無斷常遷滅之妄議而參於其間哉。0929a20"
        ],
        [
          540,
          "是謂昔物自在昔。不從今以至昔。今物自在今。不從昔以至今。",
          "此呈上今昔之物各不相至也。上二句呈今不至昔。下二句呈昔不至今。所言昔物在昔等者。謂昔物不來如似在昔。故云昔物自在昔。非遷今以至昔。故不從今至昔。今物不往如似在今。故云今物自在今。非遷昔以至今。故不從昔至今。是則今昔不相至。法法不相到。有何物而可遷乎。然則所謂昔物在昔。今物在今者。良以今昔之物從緣無性。不相往來。假名曰在。實無所在也。蓋在猶去來。既無去來。安得有在。故清凉以物各性住為真諦相。則知物物無物。在亦無在矣。是則無去無來亦無所住。故名為之不遷也。而或人固守其文。不會其意。遂以有物有在而駁。之得不自招謬斥之過歟。0929c01"
        ],
        [
          541,
          "故仲尼曰。回也見新。交臂非故。",
          "引證今昔之物各不相至也。言見新非故者。謂新故從緣無性而不相至。則新不至故。故不至新。故見新非故也。然此引新故從緣無性而不相至。以證今昔之物各不相至者。正顯萬法從緣而無自體。故各不相知相到也。0929c14"
        ],
        [
          542,
          "如此。則物不相往來明矣。既無往返之微朕。有何物而可動乎。",
          "結上往物不來今物不往也。言無住返之微朕者。謂今物從緣無性不去於昔。故不往。往物亦從緣無性不來於今。故不返。既無往返之微迹。有何物而可動哉。0929c21"
        ],
        [
          543,
          "然則旋嵐偃嶽而常靜。江河競注而不流。野馬飄鼓而不動。日月歷天而不周。復何怪哉。",
          "此引動而不動之事以成上遷而不遷之理也。若約比量而言。量云。諸法是有法。遷而不遷是宗法。因云。物物緣生無性而不相至故。同喻云。前波非後波等。所謂物物緣生無性而不相至等者。蓋以物物從緣空故不相往來。如波波從緣無體而不相至。是故諸法遷而不遷也。故宗鏡釋云。前風非後風。故偃嶽而常靜。前波非後波。故競注而不流。前氣非後氣。故飄鼓而不動。前日非後日。故歷天而不周。理本如是。復何怪焉。是則三支無過。能立極成矣。而或人竟謂肇公立法宗似因非。有宗無因者。以其錯解肇公之意故也。何者。肇公原以物無去來之義明不遷。不以有物有住明不遷。而或人既錯解其意。遂以有物有住為不遷因。故云有宗無因。以致妄談般若。謬斥先聖。可不辯哉。然則是辯也。非特辯或人也。亦將以辯為或人之所昧者。蓋或人一也。容可已也。昧其言者或未可必也。難可已也。余豈好辯哉。將恐昧其言者亦墮謗法之坑故也。0930a03"
        ],
        [
          544,
          "噫。聖人有言曰。人命逝速。速於川流。是以聲聞悟非常以成道。緣覺覺緣離以即真。苟萬動而非化。豈尋化以階道。覆尋聖言。微隱難測。若動而靜。似去而留。可以神會。難以事求。",
          "此引聖人之言以明遷也。或謂前說不遷。此又何云遷耶。答。前對執遷者故云不遷。乃即遷以明不遷不異於遷。此對計常者。故又云遷。乃即不遷以明遷不異不遷。故二乘悟滅即不滅。遷即不遷。以成道即真也。苟萬下。釋成所證。苟。誠也。非化。謂不遷也。尋。即也。蓋二乘之所以成道即真者。誠萬動而不遷。故悟之以階道。非即遷以階道也。覆尋下。明聖言難測。若動下。明難測所以。蓋由聖人即無動無滅而言動言遷。故若動而實不動。似遷而實不遷。是故若以神會即悟無動無滅以契不遷。若以事求則但見其遷。故云可以神會難以事求也。明遷不遷竟。0930b01"
        ],
        [
          545,
          "是以言去不必去。閑人之常想。稱住不必住。釋人之所謂往耳。豈曰去而可遣。住而可留耶。",
          "此呈上文兩節之意也。言去不必去等者。蓋以說遷乃即不遷以言遷。不異不遷。故不必於遷。但防人之常想耳。說不遷乃即遷以稱不遷。不異於遷。故不必不遷。但釋人之所往耳。是知說遷不遷。惟在拂人之情執。本無定法可說。豈可以遷為遷。以不遷為不遷者哉。故云豈曰去而可遣住而可留耶。0930b15"
        ],
        [
          546,
          "故成具云。菩薩處計常之中。而演非常之教。摩訶衍論云。諸法不動。無去來處。斯皆導達羣方。兩言一會。豈曰文殊而乖其致哉。",
          "此引證上文兩節之意也。先引經以證遷。次引論以證不遷。羣方者。謂隨宜導達之方不一也。兩言一會者。謂說遷不異不遷。說不遷不異於遷。是雖對機言異。而遷與不遷之致無殊。故云豈曰文殊而乖其致哉。0930c01"
        ],
        [
          547,
          "是以言常而不住。稱去而不遷。不遷故雖往而常靜。不住故雖靜而常往。雖靜而常往故往而弗遷。雖往而常靜故靜而弗留矣。",
          "此結上文兩節之意也。蓋前說不遷不異於遷。故云言常而不住。不住即遷也。次文說遷不異不遷。故云稱去而不遷。不遷故雖遷而不遷。不住故雖不遷而遷。雖不遷而遷。故遷而弗遷。雖遷而不遷。故弗遷而遷矣。如是則遷與不遷未始暫異。亦非遷非不遷。而名物不遷耳。前以諸法性空之義而明物不遷者。乃真諦之不遷也。此所謂不遷而遷．遷而不遷．非遷非不遷而明物不遷者。乃中道第一義諦之不遷。他詎可以遷不遷而思議者哉。0930c09"
        ],
        [
          548,
          "然則莊生之所以藏山。仲尼之所以臨川。斯皆感往者之難留。豈曰排今而可往。是以觀聖人心者。不同人之所見得也。",
          "此答外人之難以明聖人感往不同之意也。或謂上來說遷不異不遷。則莊生藏山．仲尼臨川豈非遷乎。答。莊生之所以藏山。仲尼之所以臨川。斯皆為不覺遷者而感其已往難留。豈同世人排今往昔之見。是以云觀聖人心者不同人之所見得也。0930c21"
        ],
        [
          549,
          "何者。人則謂少壯同體。百齡一質。徒知年往。不覺形隨。是以梵志出家白首而歸。隣人見之曰。昔人尚存乎。梵志曰。吾猶昔人。非昔人也。隣人皆愕然。非其言也。所謂有力者負之而趨。昧者不覺。其斯之謂歟。",
          "此徵釋感往之意也。何以聖人感往難留耶。人則下。引事以釋感往之。意蓋時人唯知百齡一質而不覺念念遷訛。故梵志白首而歸。隣人見之曰。昔人尚存。梵志見其不悟。即以言警之云。吾猶昔人。非昔人者。豈非莊生．仲尼之意乎。然隣人猶不悟形遷。故皆愕然而非其言。莊生所謂夜半有力者負之而趨昧者不覺。與隣人不悟形遷。無以異也。故云其斯之謂歟。0931a06"
        ],
        [
          550,
          "是以如來因羣情之所滯。則方言以辯惑。乘莫二之真心。吐不一之殊教。乖而不可異者。其唯聖言乎。故談真有不遷之稱。導俗有流動之說。雖復千途異唱。會歸同致矣。",
          "此結顯如來為機說教不同。不乖一致。以成上言殊致一也。方言謂對機之言乃治病之方。故云方言。蓋以羣情所滯不一。故如來乘一真心。任病處方。隨機說法。雖復千差。其理不異。故云乖而不可異者其唯聖言乎。故談真下。結成言殊致一也。0931a18"
        ],
        [
          551,
          "而徵文者聞不遷。則謂昔物不至今。聆流動者。而謂今物可至昔。既曰古今。而欲遷之者何也。是以言往不必往。古今常存。以其不動。稱去不必去。謂不從今至古。以其不來。不來故。不馳騁於古今。不動故。各性住於一世。然則群籍殊文。百家異說。苟得其會。豈殊文之能惑哉。",
          "此對徵文滯句之士以明會理者不為文言所惑也。夫凡所說法因群情耳。豈有定法可說哉。又豈容以如言取著者乎。而徵文者不悟此意。即如言取著。故聞不遷則謂昔物不至今。聆流動者又謂今物可至昔。是以復就執遷者即遷而明不遷。以拂如言取著之見也。既曰下。因聆流動者謂今物可至昔。故先以不遷按定。是以下。正明遷而不遷之義。拂其以遷為遷之見。所謂言往不必往等者。蓋以聖人對計常者。雖說古今代謝物像變遷。然不妨古今萬物俱緣生無性。遷即不遷以說遷而物不遷。故云言往不必往。稱去不必去也。以言往而古今不往故。則古自住古。今自住今。故云古今常存。蓋以其古今各住而不動故。以稱去而今不去故。則今不去古。故不從今至古。蓋以其古而不來今故。然今古既不相往來。則不馳騁於古今。而古今既常存不動。則各性住於一世矣。然此既以古今緣生無性遷即不遷而言住。則知性住是以無性為性。無住為住。故永明謂。肇公所言性住。是無性為性也。若爾。則古今之性尚不可得。豈復有住乎。況清涼亦以物各性住為真諦相。豈以有物有住而為真諦之相者哉。而或人既不達無性無住真諦之義。反以有性有住而駁之。得非妄談般若乎。又今古既不相往來。則知言往不往。稱去不去。而聆流動者豈可以往為往。以去為去。而謂今物可至昔耶。則遷今至昔之見破矣。然則下。明會理者不為文言所惑。羣籍殊文。指眾經言。百家異說。就眾論言。蓋明會理者知說遷不遷。及殊文異說但為拂人之情執耳。元無定法。亦無殊致。故不為文言所惑而如語取著也。0931b05"
        ],
        [
          552,
          "是以人之所謂住。我則言其去。人之所謂去。我則言其住。然則去住雖殊。其致一也。故經云。正言似反。誰當信者。斯言有由矣。",
          "此結顯言殊致一之義。以明不可如語取著也。蓋以人所謂住。我言其去。然雖言去。不乖於住。由其以無動無滅而云去。故不乖住也。又人所謂去。我言其住。然雖言住。不乖於去。由其以去來即無去來而云住。故不乖去也。是則去住言殊。其致不異。豈可如言取著者乎。故經云下。引證言殊致一也。言正言似反者。謂言去實不乖住。說住實不異去。故云似反。言誰當信者。以其言殊致一之義殆非言思可及。故人所難信。非唯難信亦且難測。故前云可以神會難以事求。則經之言信必有由矣。0931c13"
        ],
        [
          553,
          "何者。人則求古於今。謂其不住。吾則求今於古。知其不去。今若至古。古應有今。古若至今。今應有古。今而無古。以知不來。古而無今。以知不去。若古不至今。今亦不至古。事各性住於一世。有何物而可去來。",
          "徵釋言反之意。復詳辯不遷也。何以人所謂去我言住耶。人則下。釋也。蓋常人謂古能遷至於今。故求古於今謂古不住。此則人之所謂遷也。吾則下。明我之所謂不遷耳。言求今於古知其不去者。謂以今時緣生無性不去於古。則於古求今而古中無今。故知今不去古矣。今若至古下。反推古今不相至義。今而無古下。順明古今不相至義。若古不至今下。牒結不遷以破其遷。則遷古至今之見破矣。然前後諸文皆對遷以廣明不遷者。欲人即遷而契不遷。故論題名為物不遷者。良有以也。0932a03"
        ],
        [
          554,
          "然則四象風馳。璇璣電卷。得意毫微。雖速而不轉。",
          "此引遷而不遷之事以成上古今遷而不遷也。四象即四時。凡四時備。更一周年。璇璣即北斗七星。凡一日一夜一周天。蓋取其遷也。言得意毫微等者。謂苟得緣生無性。無有去來之意毫微。則四時雖如風之馳。璇璣如電之卷。亦不可得而流轉矣。0932a14"
        ],
        [
          555,
          "是以如來功流萬世而常存。道通百劫而彌固。成山假就於始簣。修途托至於初步。果以功業不可朽故也。功業不可朽。故雖在昔而不化。不化故不遷。不遷故則湛然明矣。故經云。三灾彌綸而行業湛然。信其言也。",
          "此呈上古今不遷以明如來道業亦不遷也。道即所證之理。業即所修之因。以其因真而果不謬。故流萬世而常存。通百劫而彌固也。成山下。引喻以明功業不滅。果以下。以法結明。蓋成山假始簣而就。長途托初步而至。然始簣初步竟不可謂之滅不滅也。何者。謂始簣若滅。山假何成。始簣不滅。始土尚存。山相寧顯。始簣既爾。初步亦然。由是而知其所謂昔因不化不遷者。乃化而不化。遷而不遷。故云不化不遷。非謂昔因住昔不化為不遷也。而或人由不達化而不化遷而不遷之義。妄以昔因住昔不化而駁肇公者。得不謬斥先聖哉。故經云下。引證功業不滅。然前則約物約時以論不遷。此明如來功業不遷。則知世出世法皆不遷也。0932a24"
        ],
        [
          556,
          "何者。果不俱因。因因而果。因因而果。因不昔滅。果不俱因。因不來今。不滅不來。則不遷之致明矣。復何惑於去留。踟蹰於動靜之間哉。",
          "此徵釋昔因不化不滅以結不遷之致也。何以昔因不化不滅耶。果不下。釋也。蓋以因果從緣無性。各各寂滅而不相至。則果不至因。因不來果。故不俱也。然雖不俱而不妨因因而果。因因而果因不昔滅者。滅而不滅也。果不俱因因不來今者。不滅而滅也。既不滅而滅。滅而不滅。則不可謂之滅。亦不可謂之不滅。是則非滅非不滅。非遷非不遷。而名曰不遷。則不遷之致明矣。豈復迷惑踟蹰於遷不遷之間哉。然此一節。宗鏡引中論八不之義以會釋之。如欲委悉。請覽彼文。0932b16"
        ],
        [
          557,
          "然則乾坤倒覆無謂不靜。洪流滔天無謂其動。苟能契神於即物。斯不遠而可知矣。",
          "此結舉動而不動之事。而許智與理冥。境與神會者。默而識之則非言思分別可能知也。故宗鏡釋云。若能觸境明宗。契神即物。假使天翻地覆。海沸山崩。尚不見動靜之朕兆。況其餘之幻化影響乎。故云苟能契神於即物斯不遠而可知。凡究心者宜深鑒諸。毋得自昧己靈。妄談般若而謬斥先聖。以招謗法之罪。非惟自害亦害他人。慎之哉。慎之哉。0932c04"
        ]
      ],
      "tag": "界"
    },
    "遵": {
      "col": 0,
      "desc": "X0870 注肇論疏，宋·遵式",
      "name": "X0870_002",
      "notes": [
        [
          782,
          "○物不遷論第一",
          "物者事法也。世間不離三科。出世不過二果。但有名相竝稱為物。縱說古今時分。時無別體。仗相立名。但了名相無所不收。\n言不遷者。遷者動也。即變易義。今俗諦門中略有三義。故萬物不能遷易。一明物性。二明物相。三明物時。火熱風動水濕地堅等即緣性不可易。天尊地卑山高水澄聖淨凡染等即緣相不可易。古今朝暮剎那前後蓋時不可易。又此性相時。有相由義相成義。即中論云因緣所生法也。此則正屬始教。法相宗所陳百法名數各有體性。乃至真如涅槃亦理果淨物。故知俗諦一門攝法亦無不盡。故曰物不遷。正明動中有靜。靜不妨動。宜善得旨。勿濫真常。\n或曰。凡夫一念轉成聖時。何以曰不遷耶。答曰。秖由不遷故能轉也。何也。染淨二相各存故。真妄二性各立故。妄染時非真淨時故。由性相時分各住本位故。能從凡入聖矣。論謂言議推詰次在最先。故曰第一。物即不遷。持業釋。物不遷之論。依主釋。0148c11"
        ],
        [
          783,
          "夫生死交謝。",
          "生者起也。死者止也。此二亦云。生滅或於生後滅前。開之曰生住異滅。蓋言物之性相。緣會則起。緣離則止。故知俗諦生死能總萬物交互也。謝往也。生必交互於死曰生。死必交互於生曰死。故當生時死在。當死時生存。方曰交互也。人情不曉此理。見生時曰死往。見死時曰生往也。0149a07"
        ],
        [
          784,
          "寒暑迭遷。",
          "此以寒暑言物之時。以陰極曰寒。陽極曰暑。今寒暑者蓋言陰陽之生極也。或分四時。則春生夏長秋衰冬落。今不言四時而云寒暑者。蓋四時不出陰陽。陰陽之極曰寒暑。故以寒暑對上生死為句。故易云。一寒一暑是謂迭遷。又上生死既含四相。令寒暑亦含四時。故言萬物之時。不過寒暑為總。或約三世十世。或約心念剎那。延促不定耳。迭者遞互。遷謂動去也。以寒遞互於暑曰寒。以暑遞互於寒曰暑。既能遞互。即知各存。人不曉之。當暑時曰寒遷。當寒時謂暑去。0149a14"
        ],
        [
          785,
          "有物。",
          "即上生死寒暑所總萬有之物。0149b01"
        ],
        [
          786,
          "流動。",
          "水動曰流。即上交謝迭遷。0149b03"
        ],
        [
          787,
          "人之常情。",
          "人情執動常自如此。此上明所治之執。此下亦破斷見外道。撥無因果故。0149b05"
        ],
        [
          788,
          "余則謂之不然。",
          "謂者評論之詞。論主自所謂萬物性相道理。交而不謝。迭而不遷。0149b09"
        ],
        [
          789,
          "何者。",
          "自徵上下然之意者何也。0149b12"
        ],
        [
          790,
          "放光云。",
          "八部般若之一數。0149b14"
        ],
        [
          791,
          "法。",
          "軌持為義。真妄染淨色心依正。各具軌則住持。通得此名。即上物也。0149b16"
        ],
        [
          792,
          "無去來無動轉。",
          "即不遷也。謂生住生故無來。死住死故無去。中間寒暑。少壯各住。故無流動轉變矣。或去來約時。轉動約性相。緣生性相三世各住。故曰不遷。若般若宗多蕩相顯空。色心至乎種智。皆曰清淨今借文標為證信。不取彼意。下自推釋可見。0149b19"
        ],
        [
          793,
          "者。",
          "牒經也。0149c01"
        ],
        [
          794,
          "尋夫不動之作。",
          "推窮曰尋。夫即語詞。不動者。經云無去來動轉。作者推求也。尋究經中於諸法推求不動者也。0149c03"
        ],
        [
          795,
          "豈釋動以求靜。",
          "先破錯解釋捨也。0149c06"
        ],
        [
          796,
          "必求靜於諸動。",
          "此顯正意經中。定當推靜向於羣動。故令動中達性相各住。0149c08"
        ],
        [
          797,
          "必求靜於諸動。故雖動而常靜。",
          "上句牒前。下句釋成自意。經中既求靜於動。故我於生死交謝。寒暑迭遷。而見常靜。所以謂之不然也。0149c11"
        ],
        [
          798,
          "不釋動以求靜。故雖靜而不離動。",
          "亦先牒前。下句釋成經旨。雖靜者。法無去來動轉。不離遷謝而顯。故曰不離動。則所見即動而靜。與經即靜而動相符。0149c15"
        ],
        [
          799,
          "然則。",
          "承上連續之詞。因推經旨故。0149c20"
        ],
        [
          800,
          "動靜未始異。",
          "以經證於自意。則同辨緣法生滅性相常靜。故動靜不異。0149c22"
        ],
        [
          801,
          "而惑者不同。",
          "惑者生時不見死。乃執生靜而死動等。故動靜不同。0150a01"
        ],
        [
          802,
          "緣使真言滯於競辨。",
          "真言者稱實之言也。競辨者諍言也。惑者執異與不異。稱實之言相違。故有諍言。使真言成滯礙也。0150a04"
        ],
        [
          803,
          "宗途。",
          "途者道也。動靜不異之道。為學者之所宗故。0150a07"
        ],
        [
          804,
          "屈於好異。",
          "屈抑也。惑者好異而強說。故使宗途為邪解之屈抑。0150a09"
        ],
        [
          805,
          "所以靜躁之極。未易言也。",
          "躁動也。物之動靜理極於不二。惑者執二而強諍故。不可率易而言。0150a12"
        ],
        [
          806,
          "何者。",
          "推難言之意。0150a15"
        ],
        [
          807,
          "夫談真則逆俗。順俗則違真。",
          "稱實言則逆世俗。順俗見則違實理。故未易言也。0150a17"
        ],
        [
          808,
          "違真故迷性而莫返。",
          "出違真過也。人情長迷於物理。順之則不能返悟也。0150a19"
        ],
        [
          809,
          "逆俗故言淡而無味。",
          "出逆俗過也。淡即無味。談真逆俗。俗見不曉。無義味可采。故云言淡。道經云。樂與餌過客止道之出口淡乎無味。0150a22"
        ],
        [
          810,
          "緣使。",
          "解人說動靜理同。惑者執動靜有異。乃為中人之惑緣也。0150b02"
        ],
        [
          811,
          "中人未分於存亡。",
          "中根可語上。亦可以語下。故未能分辨解惑邪正。為當存同亡異。為復存異亡同。下論正被此機。上士已知動靜不異故。0150b05"
        ],
        [
          812,
          "下士撫掌而弗顧。",
          "即前惑者也。堅執不回弗顧正理。撫掌者大笑之貌也。道經曰不笑不足以為道矣。此上二句語。出道德經。文小改耳。0150b09"
        ],
        [
          813,
          "近而不可知者。",
          "物理近於人。而不可以執動靜者所知者。下云。0150b13"
        ],
        [
          814,
          "其唯物性乎。",
          "唯獨也。獨有萬物緣生之性。動中常靜。靜不妨動。此理最近而人不知。此即前三義中是約性一門。華嚴大疏。談不遷有三義。一能依不遷。即今約性相義。二依所依不遷。三唯所依不遷。即涅槃論明真性隨緣常住不變義。0150b15"
        ],
        [
          815,
          "然。",
          "躡上生起之詞。理極難言。故當杜默然。為中人不知物性如此。故下云。0150b21"
        ],
        [
          816,
          "不能自已(已止也)聊復寄心於動靜之際。",
          "聊略也。際邊畔也。動以靜為際。故即動以見靜。靜以動為際。故即靜以見動。略寄解心如此。故乃言之也。0150b24"
        ],
        [
          817,
          "豈曰必然。試論之曰。",
          "必者決定也。試且也。豈謂決定如然。且以此解心評論之耳。0150c04"
        ],
        [
          818,
          "道行云。",
          "小品一數也。0150c16"
        ],
        [
          819,
          "諸法。",
          "物也。即色受想行識曰五蘊。六根六境曰十二處。更加六識即十八界。世間法不過此之三科。又略而言不出色心為總。又菩提涅槃是出世法。今竝該之。故云諸法。0150c18"
        ],
        [
          820,
          "本無所從來。去亦無所至。",
          "不遷也。本者來之所起處。至者去之所到處。由諸法性相時分。各住本位。未甞有從本而來去至彼所。所謂本不見從凡中而來。去至聖所。又亦不見本從生死煩惱中來。至菩提涅槃處故。何也。聖凡染淨各不相到故。世出世法各住本位故。餘可例知。華嚴亦云。各各不相知。諸法亦如是。若據般若本部。多明無相真宗。直顯萬法本空無來去相。今借文標宗。用意則別。下定宗中可見。0150c23"
        ],
        [
          821,
          "中觀。",
          "即中觀論。今引之釋成經意。0151a08"
        ],
        [
          822,
          "云觀方知彼去。",
          "觀則見也。方通十方。且舉東方例之。彼者汎指彼人也。我觀東方。知彼一人從此而去。0151a10"
        ],
        [
          823,
          "去者不至方。",
          "者即人也。去東之人前步在前後步在後。故不見從此至彼方之相。故曰去亦無所至。反知從東方來此方。亦步步各住。故曰本無所從來。東方既爾。餘九亦然。人既即動而靜。以例諸法遷而不遷。故引中觀釋成道行。以立不遷宗旨也。0151a13"
        ],
        [
          824,
          "斯皆即動而求靜。以知物不遷明矣。",
          "斯此也。皆同也。此上經論同即動而推靜。用此證知緣生物理。性相不遷義已明矣。三量之申此約聖教量。0151a19"
        ],
        [
          825,
          "夫人之所謂動者。",
          "牒上有物流動人之常情。0151a24"
        ],
        [
          826,
          "以昔物不至今。",
          "如以死交互於生。則生為昔物。死為今物。故生不至今也。0151b02"
        ],
        [
          827,
          "故曰動而非靜。",
          "惑者見死時無生。謂生已謝故。執動而非靜。0151b05"
        ],
        [
          828,
          "我之所謂靜者。",
          "牒上余則謂不然也。0151b07"
        ],
        [
          829,
          "亦以昔物不至今(同上也)故曰靜而非動。",
          "論主所解生為昔物在昔。死為今物在今。故昔不至今曰靜而非動也。以生交死及寒暑等。例上可知。0151b09"
        ],
        [
          830,
          "動而非靜。以其不來。",
          "惑者執動為見昔不來今故。0151b13"
        ],
        [
          831,
          "靜而非動。以其不去。",
          "論主見靜已知昔物住昔而不去。此即前序中解惑耳。0151b15"
        ],
        [
          832,
          "然則所造未甞異。",
          "造詣也。同見昔物不至今。則所詣之境不異。0151b18"
        ],
        [
          833,
          "所見未甞同。",
          "解惑所見靜動不同。0151b20"
        ],
        [
          834,
          "逆之所謂塞。順之所謂通。",
          "逆理執動。所謂塞滯之人。順理見靜。所謂通解之者。古人多約論主。說逆順通塞。量無此理。0151b22"
        ],
        [
          835,
          "苟得其道。復何滯哉。",
          "苟若也。道物理也。若得物理無動而非靜。豈有動之可惑滯也。0151c01"
        ],
        [
          836,
          "傷夫人情之惑久矣。",
          "人被情執所惑。從來不覺。故可傷之。0151c04"
        ],
        [
          837,
          "目對真而莫覺。",
          "真者即昔物不至今也。雖見而執動。故目對而莫覺也。0151c06"
        ],
        [
          838,
          "既知往物而不來。",
          "牒前昔物不至今。往昔也。0151c09"
        ],
        [
          839,
          "而謂今物而可往。",
          "即前執動而非靜也。往去也。既執昔物不至今為動。必當謂今物亦可遷往矣。此乃情惑也。0151c11"
        ],
        [
          840,
          "往(昔也)物既不來。今物何所往。",
          "去也。惑者雖知昔物不來。而不知今物不去。若知今物在今而不去。亦了昔物在昔而不去。即不遷顯矣。則古住古而今住今。今古各不相往來。0151c15"
        ],
        [
          841,
          "何則。",
          "徵上二句。0151c20"
        ],
        [
          842,
          "求向物於向。於向未甞無。",
          "向昔也。求昔物於昔時。昔時定有。故知昔住昔位。0151c22"
        ],
        [
          843,
          "責向物於今。於今未甞有。",
          "推責昔物於今時。今時不見昔。0151c24"
        ],
        [
          844,
          "於今未甞有。以明物不來。",
          "明知昔物不至今也。0152a02"
        ],
        [
          845,
          "於向未甞無。故知物不去。",
          "昔時見昔故知不遷去。何以惑之。而謂動而非靜耶。此上釋成古無來去義。0152a04"
        ],
        [
          846,
          "覆而求今。今亦不往。",
          "去也。反覆更推今物。即知今物在今而不去。非唯不去。於古昔亦知不向於未來。故非動矣。此上釋成今無來云義。但變上文以向曰今。今曰向。來曰去。去曰來。讀之可見。如人有老少。少住昔而老住今。人多惑之。當老年衰朽不見[月*(?/口/用)]盛。乃謂少事已遷去。殊不思當少之年膚腠潤澤。故知在昔矣。何於今而求之。已自迷倒。況求之不得。乃謂遷去。故知甚惑。達物理者了今古各住。無毫髮可易。0152a07"
        ],
        [
          847,
          "是謂昔物自在昔。不從今以至昔。今物自在今。不從昔以至今。",
          "可見。0152a18"
        ],
        [
          848,
          "故仲尼曰。回也見新交臂非故。",
          "文出莊子外篇田子方章。云孔子謂顏回曰。吾終身與汝交一臂而失之。可不哀歟。郭注云。夫變化不可執而留也。故雖執臂相守。而不能令停。康師疏曰。郭注不當。謂交臂之頃已失前人。非謂交臂執手不能令停。今取康師釋交臂。此如兩臂相交。秪此少頃之時。已見新失於故。若以論中次文指此。以明新故各住之義。而未知仲尼本意若何。孔子若語不遷。何必哀傷其事。若謂吾汝終身同交臂之頃。爾則郭注所謂變化不能令停。亦甚得旨也。今論中文有小改。但取儒釋相符之義。非謂彼彼也。言見新者。即前今物自在今。非故者。即前昔物自在昔。秖少頃時。今昔尚各住一世。况日月年劫耶。0152a20"
        ],
        [
          849,
          "如此。則物不相往來明矣。",
          "牒上仲尼所說。則新故各住。物無來往義已明矣。0152b10"
        ],
        [
          850,
          "既無往返之微朕。有何物而可動乎。",
          "往返者去來也。微朕者小迹也。推諸法性相時分。求去來之迹。無毫末可得。未知惑者有何物而可曰動而非靜乎。自破題入序至此。破執動之見已訖。0152b13"
        ],
        [
          851,
          "然則旋嵐偃嶽而常靜。",
          "自開章已下盡顯萬物不遷。故今牒而結之。旋嵐者亦云毗藍。華嚴音義云。正梵語云吠藍婆。此云散所至。即風名。此風所至無不散壞。又翻云不遲。義翻為迅猛風。偃息也。嶽山也。偃息山嶽即風之散壞也。康云。偃者仆倒。亦取壞義。舉迅猛之風。偃息羣嶽無所不壞而風。畢竟非山。山畢竟非風。既不相是。亦不相到。故曰常靜。故知風山性相各有所住。雖飄鼓迅猛而常靜矣。下三句例知。0152b18"
        ],
        [
          852,
          "江河競注而不流。",
          "水雖奔競。前波後波各不相到故不流。又畢竟不能易於濕性。故不流動也。0152c03"
        ],
        [
          853,
          "野馬飄鼓而不動。",
          "莊子云野馬也。郭注云遊氣。以三陽之月日氣鬱盛。則見遊氣飄鼓。歙歙然而前後各位。故無所動。0152c06"
        ],
        [
          854,
          "日月歷天而不周。",
          "歷涉也。天輪左轉。日月右旋。時分各住。故歷涉天輪。不見有周帀之相。0152c09"
        ],
        [
          855,
          "復何怪哉。",
          "怪者異也。即動而靜。四皆不遷。何有動相可怪異也。0152c12"
        ],
        [
          856,
          "噫。",
          "傷不平之聲。教理相違故。0152c22"
        ],
        [
          857,
          "聖人。",
          "聖通也。孔子對哀公曰。聖人者智通乎大道。應變而不窮也。今此方釋宗。皆指佛為聖人。蓋就應迹人倫。窮達理事。無所不通。故曰聖人。佛德難思。且就正徧知義釋之耳。0152c24"
        ],
        [
          858,
          "有言曰。人命逝速。速於川流。",
          "文引。涅槃經云。人命不停過於山水。今小易其語。言命者。不相應行中一法曰命根。即第八賴耶識體。是受生總報主。來為最先。去為最後。此識體上有連持。計屬一報色心之功曰命根。乍生乍滅不停。如川水疾流。此則說無常教。詮無常理也。0153a05"
        ],
        [
          859,
          "是以聲聞悟非常以成道。",
          "難者恐雖有教理未必可信。故以行果成立教理決定也。聲聞者聞聲教證道之人也。成道者證偏真性也。聖人說無常教。聲聞聞之悟苦集滅道。現在無常破煩惱障。滅我執心。證我空真理。故八輩聖人。通號聲聞。0153a12"
        ],
        [
          860,
          "緣覺覺緣。離(平)以即真。",
          "梵語辟支迦羅。此云獨覺。亦云緣覺獨覺人自悟。緣覺者稟教。今取緣覺也。緣是所覺境。即三世十二因緣。覺是能了智。即生空觀。由聞無常教故。覺三世萬法緣聚暫有。緣離本空。故云即真。雖根利勝於聲聞。破執障證我空偏真理不別。0153a18"
        ],
        [
          861,
          "苟萬動而非化。(牒前也)豈尋化以階道。",
          "非化者不遷也。階道者次第證道故。且萬物不遷。無常教理則虗設。豈有二乘尋此變化教理。次第得聖道耶。二乘既得道。方知無常教理非虗。將恐論主所說不遷教理。未可取信。0153b01"
        ],
        [
          862,
          "覆尋聖言。",
          "三思曰覆。尋聖言即前無常教也。0153b07"
        ],
        [
          863,
          "微隱難測。",
          "歎俗諦不二理難測也。微謂微妙事法。不可以常無常定相思議。隱謂隱密不二之義。潛密在於教下。故難可以言教測度。0153b09"
        ],
        [
          864,
          "若動而靜。似去而留。",
          "據上說教詮事。則似云動去在物理。則動而常靜。去而常留。乃聖人不二之本旨。上句明立教。下句明詮事。故有重句也。0153b13"
        ],
        [
          865,
          "可以神會。難以事求。",
          "神解必可契會。事相固難推求。0153b17"
        ],
        [
          866,
          "是以言去不必去。閑人之常想。",
          "閑防也。人心起常見。聖教說諸法無常以防禦之。非謂定無常。0153b21"
        ],
        [
          867,
          "稱住不必住。釋人之所謂往耳。",
          "釋解也。人執無常遷往。聖教說萬物常住因果決定以解之。令捨所執。非謂定常。0153b24"
        ],
        [
          868,
          "豈曰去而可遣。住而可留耶。",
          "可定也。去住二教為破斷常二執。二執若除。教不定立。故知教雖異而意同歸也。0153c03"
        ],
        [
          869,
          "故成具云。",
          "成具光明定意經也。0153c07"
        ],
        [
          870,
          "菩薩。",
          "梵語。具云菩提薩埵。此云覺有情。三義釋之。如金剛疏。0153c09"
        ],
        [
          871,
          "處計常之中。而演非常之教。",
          "證上言去不必去閑人之常想。0153c12"
        ],
        [
          872,
          "摩訶衍論云。諸法不動。無去來處。",
          "證上稱住不必住釋人之所謂往。此上證教異。下顯意同。0153c14"
        ],
        [
          873,
          "斯皆導達羣方。",
          "群者不一也。方法也。經論法門不一。皆為導達執情故。0153c17"
        ],
        [
          874,
          "兩言。",
          "常門說住。無常門說去。0153c20"
        ],
        [
          875,
          "一會。",
          "常無常理一以會之。何也。且萬法雖生滅不停。而生滅各位。雖不失本位。而起滅何常。既動靜不殊。則理本自一。蓋俗諦不二之旨。縱隨機各陳。理無殊致。即聖人之深旨微隱難測也。0153c22"
        ],
        [
          876,
          "豈曰文殊而乖其致哉。",
          "不可以常無常教異。而謂不二之理有殊。故知物不遷之談。足以盡聖人俗諦教意也。0154a03"
        ],
        [
          877,
          "是以言常而不住。稱去而不遷。",
          "言常稱去。是兩言為對二執。常即不住。去即不遷。是動靜理一也。0154a07"
        ],
        [
          878,
          "不遷故(牒上下句)雖往而常靜。",
          "即動以見靜也。如於生死中見生不到死。生死各住。例諸法亦然。0154a10"
        ],
        [
          879,
          "不住故(牒上上句)雖靜而常往。",
          "即靜以見動。雖死生各住。而生死不停。此下二句。但翻覆文異。語意是同。0154a13"
        ],
        [
          880,
          "雖靜而常往故。",
          "牒上即靜而動。0154a16"
        ],
        [
          881,
          "往而弗遷。",
          "以顯動而常靜。0154a18"
        ],
        [
          882,
          "雖往而常靜故。靜而弗留矣。",
          "但反上准之。前是以靜為首。靜即動。動即靜。今是以動為首。動即靜。靜即動。以顯兩言一會矣。0154a20"
        ],
        [
          883,
          "然則。",
          "牒上動靜不二宗也。0154a24"
        ],
        [
          884,
          "莊生之所以藏山。",
          "莊子內篇太宗師章云。夫藏舟於壑。藏山於澤。謂之固矣。然而夜半有力者。負之而走。昧者不知也。郭注云。無力之力。莫大於變化。今取彼意。山有鬱茂。欲其不凋。若藏之於陂澤者。變化暗易。豈能令停固。昧者不知耳。0154b02"
        ],
        [
          885,
          "仲尼之所以臨川。",
          "論語云。子在川上曰。逝者如斯夫。不捨晝夜。今亦借意。仲尼以人事速變。勸進學立德。此二聖人。大同佛教說無常破常。而其教意必使捨一取一。豈令即當而達無常耶。0154b08"
        ],
        [
          886,
          "斯皆感往者之難留。豈曰排今而可往。",
          "排推也。可定也。莊孔二教皆感歎遷往之事。難以停留。乃一向見動。論主所見者。豈謂推排今物定有遷往耶。即動中見靜。已顯上往而弗遷之意也。0154b13"
        ],
        [
          887,
          "是以觀聖人心者。不同人之所見得也。",
          "以前動靜不二之理。而觀察佛聖人設教之心。必當如是者。則不可以人情所見。而得其意。0154b18"
        ],
        [
          888,
          "何者。",
          "推上人情所見。下釋。0154b22"
        ],
        [
          889,
          "人則謂少壯同體。",
          "少則幼年。三十曰壯年。同體者。凡人謂少壯同是一身。0154b24"
        ],
        [
          890,
          "百齡一質。",
          "齡年也。百年處世亦一軀質。0154c03"
        ],
        [
          891,
          "徒知年往。不覺形隨。",
          "徒虗也。虗知有少有壯年年遷往。而不覺形隨年變衰盛體殊。由不覺故。而執同體一質。此是滯常之情。0154c05"
        ],
        [
          892,
          "是以梵志出家。",
          "梵者具云梵摩。此云清潔寂靜。即淨也。西土事天婆羅門。此稱為淨志。亦云淨行。出家者即彼事天修遷之法。十五入山。以艸果為衣食。至三十歸家納妻生子。令種族繼世。至五十再入山永不歸。故曰出家。0154c09"
        ],
        [
          893,
          "白首而歸。",
          "有一梵志。三十不歸。人皆曰死。白首之年而歸。0154c15"
        ],
        [
          894,
          "隣人見之曰。昔人尚存乎。",
          "隣近也。五家曰隣。隣居識者曰昔人。梵志三十不歸。謂死矣。今尚存。此乃隣人執常也。0154c17"
        ],
        [
          895,
          "梵志曰。吾猶昔人非昔人也。",
          "猶尚也。上句牒隣人指吾尚為昔人。下句語之曰少年。昔人已謝。我今年老。故非昔人。此乃梵志滯無常也。0154c20"
        ],
        [
          896,
          "隣人皆愕然。非其言也。",
          "愕驚也。隣人堅執。聞說非昔人也。故驚愕不信其言。故曰非其言也。此上所引。雖梵志執無常。隣人執常。唯寄隣人常見以顯無常。故下結云。0154c24"
        ],
        [
          897,
          "所謂有力者負之而趨。昧者不覺。",
          "此借莊子文結斥也。隣人雖執昔人尚存。而不知莊子所謂無常有力者負之而走。新新不住。念念不停。蓋隣人昧者不覺此無常之理。然則隣人執常唯見昔。梵志執無常唯見今。若以今昔各住。常即無常。合此二見方為正理。今但寄隣人執常。結顯無常。即前云靜而弗留矣。0155a05"
        ],
        [
          898,
          "其斯之謂歟。",
          "其是也。斯此也。謂則言也。莊子云昧者不知。今隣人不知常中有無常。正是此言也。歟語助耳。0155a12"
        ],
        [
          899,
          "是以如來。",
          "是應身如來。說俗諦常無常教故。0155a17"
        ],
        [
          900,
          "因羣情。",
          "群者不一。即斷常二執故。0155a19"
        ],
        [
          901,
          "之所滯。",
          "滯有無二境。此上所治之病。以為起教之因。0155a21"
        ],
        [
          902,
          "則方言以辨惑。",
          "聖人立常無常方便之言。辨柝其惑情。即能治之藥。0155a23"
        ],
        [
          903,
          "乘莫二之真心。",
          "照常無常理不二者曰真心。乘運此心而設教故。0155b02"
        ],
        [
          904,
          "吐不一之殊教。",
          "吐說也。對二執說二教也。0155b04"
        ],
        [
          905,
          "乖(教異)而不可異(理一)者。(牒上同異)其唯聖言乎。",
          "唯獨佛教有此言異而意同。0155b06"
        ],
        [
          906,
          "故譚真。",
          "動中說靜曰談真。0155b08"
        ],
        [
          907,
          "有不遷之稱。",
          "破執無常者。撥喪因果之流也。0155b10"
        ],
        [
          908,
          "導俗。",
          "俗見多保守生事。故靜中說動以導接之。0155b12"
        ],
        [
          909,
          "有流動之說。",
          "無常剎那不停。古今代謝。上顯教權。下明意實。0155b14"
        ],
        [
          910,
          "雖復千途異唱。會歸同致矣。",
          "千者言其多數。途道也。雖因執設教說有多途。若契會所歸之理。必須動中見靜。靜處見動。故曰同致。則知教權而意實也。0155b16"
        ],
        [
          911,
          "而徵文者。",
          "徵執也。前執文詰難之者。0155b20"
        ],
        [
          912,
          "聞不遷。則謂昔物不至今。",
          "前境同見異中以昔不至今。論主曰靜而非動。難者聞之。乃謂是靜也。0155b22"
        ],
        [
          913,
          "聆流動者。而謂今物可至昔。",
          "聆聞也。聞上人命逝速之動。乃謂今物可去曰動。此亦不離前文動而非靜之情耳。難者既未達不二之旨。故於昔物不至今見靜。乃以今物可至昔為動。竝為情計。故前責曰往物既不來。今物何所往。情既未破。尚執動靜二教生難。下責執動之見云。0155c01"
        ],
        [
          914,
          "既曰古今。而欲遷之者何也。",
          "既曰古則住古。今則住今。而執惑之者。欲遷今為古者。意之何也。0155c08"
        ],
        [
          915,
          "是以言往(牒無常教)不必往。(遣執也)古今常存以其不動。",
          "古今各存一世而不動故。豈聞無常便謂定往。或作往昔釋之。意欲遣執常教之者。但今正破執動設難之者。故不從也。0155c13"
        ],
        [
          916,
          "稱去(亦牒無常教也)不必去。(遣執也)謂不從今至古。以其不來。",
          "前之遣執。令知古今各存。此之遣執。令達今不去古。古不來今。竝就無常教中說此常理。與前即動求靜。教理相照故。0155c17"
        ],
        [
          917,
          "不來故。不馳騁於古今。",
          "馳騁者去來不息也。0155c21"
        ],
        [
          918,
          "不動故。各性住於一世。",
          "古住古今住今故各一世也。0155c23"
        ],
        [
          919,
          "然則。",
          "牒上教權有異意實為同。0156a01"
        ],
        [
          920,
          "羣籍殊文。",
          "諸經說常無常。0156a03"
        ],
        [
          921,
          "百家異說。",
          "諸論說去說住。0156a05"
        ],
        [
          922,
          "苟得其會豈殊文之能惑哉。",
          "若契會常無常不二之旨。則殊文豈能為惑也。0156a07"
        ],
        [
          923,
          "是以。",
          "牒上佛教對機有異理意是同。0156a10"
        ],
        [
          924,
          "人之所謂住我則言其去。",
          "今人執常論主語之。以無常此宗無常立教。0156a12"
        ],
        [
          925,
          "人之所謂去我則言其住。",
          "人執無常論主語之。以常此宗常立教。0156a14"
        ],
        [
          926,
          "然則去住雖殊。(對機教殊)其致一也。",
          "前句即常中說無常。後句無常中說常。故知全動見靜全靜見動故同致也。非但後宗如此。前動中求靜本意如斯。0156a16"
        ],
        [
          927,
          "故經云。正言似反。誰當信者。",
          "正理之言說常無常似有相反未達不二之理者疑而不信者。字是牒經。古疏云。此文出普曜經。0156a20"
        ],
        [
          928,
          "斯言有由矣。",
          "斯言者不信之言也。因由理不二而言二。故不達者多不信矣。0156a23"
        ],
        [
          929,
          "何者(微上致一之義)人則求古。於今謂其不住。",
          "凡人今時不見古物執古物遷而不住。0156b02"
        ],
        [
          930,
          "吾則求今。於古知其不去。",
          "論主古時不見。今物知今物在今而不去。0156b04"
        ],
        [
          931,
          "今若至古。古應有今。古若至今。今應有古。",
          "反釋。0156b06"
        ],
        [
          932,
          "今而無古。以知不來。",
          "古住古而不來。0156b08"
        ],
        [
          933,
          "古而無今。以知不去。",
          "今住今而不去此上順釋也。0156b10"
        ],
        [
          934,
          "若古不至今。今亦不至古。事各性住。於一世有何物而可去來。",
          "事者今時事在今古時事在古。0156b13"
        ],
        [
          935,
          "然則。",
          "牒上動靜不二。0156b15"
        ],
        [
          936,
          "四象風馳。",
          "春夏秋冬曰四象。四時遷變馳疾如風。0156b17"
        ],
        [
          937,
          "璿璣電卷。",
          "尚書云。在璿璣玉衡以齊七政。璿即玉名。璣衡皆王者。正天文之器。衡則橫於上。璣則動於下。竝以玉為飾。故曰璿璣玉衡七政。謂日月五星。璿璣下轉。王者端視於玉衡寸穴。則知其天文變動。以審政事。今借彼意。唯取璿璣轉動。若閃電之疾速故曰電卷。古多謂璿璣是北斗之二名者。恐非其說。0156b19"
        ],
        [
          938,
          "得意毫微。雖速而不轉。",
          "毫微者毛端至小也。若於一毛端達性相時分各住本位。則萬物皆曰不遷。雖見四象璿璣速。若風電之不停。而位位各住即動而靜矣。上因外人不知論主動中說靜。故執無常教理行果致難。已明權實同異。會不二之旨。不殊於佛教。今即動顯靜結成令行人再照前不遷之旨。定為俗諦所宗。或曰若然者。二乘道果孰是非耶。答權則為是實則為非今此論廢權立實之教。二乘道果正當所破。謂彼偏滯無常教故。若達動靜不二之理。自然空有雙照。捨權歸實竝契中道。故知前引二乘行果為難。理不極成。上明會釋教意竟。0156c02"
        ],
        [
          939,
          "是以如來。",
          "就佛舉果也。然如來有二身。全智歸理曰真身。全理起智曰應身法。相宗說佛有二身謂。法報化報。中有自報他報。今他報合化為應身。自報合法為真身。真身寂滅。本非因致。縱假了因所顯定非生因所生俗諦門中未明此義今正就應身如來以果推因也。應果身相地前地上所見多種廣如諸教所辨。又此特就如來果上。推因不遷者。以顯此論宗在一乘無二無三故。0156c19"
        ],
        [
          940,
          "功。",
          "業也。明應果往因。曰功始自十信初心中間四十一位。所修十波羅蜜萬行之因。俱名功業也。0157a04"
        ],
        [
          941,
          "流萬世。",
          "水動曰流。言萬世者萬舉多數世者時分也。梵云劫波。此云時分。起信論。明信心。尚經十千劫。況入住已來歷三。阿僧祇。其中所修功業。今言萬世者。蓋指遠因遷流。至果已經多劫故也。0157a07"
        ],
        [
          942,
          "而常存。",
          "果上知昔因在昔故曰常存。0157a12"
        ],
        [
          943,
          "道。",
          "說文曰所行之謂道又道路也。皆取可履踐義行人。以智詣理所作皆真曰修道。此則以修正行曰道。道即因也。0157a14"
        ],
        [
          944,
          "通百劫而彌固。",
          "彌久也。昔日行道流通至果。雖經多劫定知在昔。故曰彌固。0157a18"
        ],
        [
          945,
          "成山假就於始簣。",
          "論語云。譬如為山雖覆一簣進吾往也。假者籍也。簣者土籠即取土之具。既籍始簣之土疊之成山。即簣土住。初而不滅以喻。昔日功業常存也。0157a21"
        ],
        [
          946,
          "修途託至於初步。",
          "道經曰千里之行始於初步。今云修途者長路也。託依也。欲行千里之途。始託於初步至千里已。則知初步在初而不滅以喻。昔日道行彌固矣。此以成山修途喻果顯簣土。初步明因存既果籍因招。則果成因在定矣。0157b01"
        ],
        [
          947,
          "果以功業不可朽故也。",
          "果決定也。以喻況之果然決知如來。昔日功業在昔不朽則因不遷矣。0157b07"
        ],
        [
          948,
          "功業不可朽。故雖在昔而不化。",
          "不化者不朽滅也。0157b10"
        ],
        [
          949,
          "不化故不遷。",
          "不遷者不來今之果時也。0157b12"
        ],
        [
          950,
          "不遷故。則湛然明矣。",
          "水澄曰湛今顯因位不動。故曰湛然明矣者。義已現也。0157b14"
        ],
        [
          951,
          "故經云。三災彌綸。而行業湛然。",
          "三災者水火風也。彌綸者充徧也。劫壞時火至初禪。水至二禪。風至三禪。三禪已下無不壞散。唯行人道行功業。湛然不動。0157b17"
        ],
        [
          952,
          "信其言也。",
          "佛語可信故。0157b21"
        ],
        [
          953,
          "何者。",
          "徵也。果上不見因。何以知其不化不遷耶。下釋。0157b23"
        ],
        [
          954,
          "果不俱因。",
          "俱同也。果在今而因在昔故不同時。0157c01"
        ],
        [
          955,
          "因因而果。",
          "上因即因由下因。是因行雖昔因今果而果籍因成故。0157c03"
        ],
        [
          956,
          "因因而果因不昔滅。",
          "既籍因成果。果時定知因不可滅故。故上曰雖在昔而不化也。0157c06"
        ],
        [
          957,
          "果不俱因因不來今。",
          "因果既不同時定知因。住昔而不來今之果時故。上曰不化故不遷也。0157c09"
        ],
        [
          958,
          "不滅不來。則不遷之致明矣。",
          "以果求因已知因中功業道行不滅去不遷來。則在昔之理明矣。0157c12"
        ],
        [
          959,
          "復何惑於去留。踟躇於動靜之間者哉。",
          "去留者即動靜也。踟躇者進退不前之言物理在乎動靜不二之間。何以疑惑而不進趣耶。故今責之。0157c15"
        ],
        [
          960,
          "然則。",
          "承上所推因果今昔之事動靜不二故。0157c19"
        ],
        [
          961,
          "乾坤倒覆。無謂不靜。",
          "易云天尊地卑乾坤定矣。天上覆而地下載今言倒覆者。設若天載而地覆。則乾坤尊卑不失陰陽本位。故無不靜。0157c21"
        ],
        [
          962,
          "洪流滔天。無謂其動。",
          "洪流者大水也。滔天者瀰漫也。尚書云滔滔洪水方割。以諸波各住自位。故無所動。0158a01"
        ],
        [
          963,
          "苟能契神於即物。斯不遠而可知矣。",
          "若能心契神解即物會理。則不二之理不遠中根之人。可於此而知存亡矣。0158a04"
        ]
      ],
      "tag": "遵"
    }
  },
  "rowPairs": [
    ":ke-type 1 肇論疏·元康"
  ]
}